var countryData = {
  "Location": {
    "CountryRegion": [
      {
        "name": "中国",
        "id": "1",
        "State": [
          {
            "name": "北京",
            "id": "11",
            "City": [
              {
                "name": "东城",
                "id": "1"
              },
              {
                "name": "西城",
                "id": "2"
              },
              {
                "name": "朝阳",
                "id": "5"
              },
              {
                "name": "丰台",
                "id": "6"
              },
              {
                "name": "石景山",
                "id": "7"
              },
              {
                "name": "海淀",
                "id": "8"
              },
              {
                "name": "门头沟",
                "id": "9"
              },
              {
                "name": "房山",
                "id": "11"
              },
              {
                "name": "通州",
                "id": "12"
              },
              {
                "name": "顺义",
                "id": "13"
              },
              {
                "name": "昌平",
                "id": "21"
              },
              {
                "name": "大兴",
                "id": "24"
              },
              {
                "name": "平谷",
                "id": "26"
              },
              {
                "name": "怀柔",
                "id": "27"
              },
              {
                "name": "密云",
                "id": "28"
              },
              {
                "name": "延庆",
                "id": "29"
              }
            ]
          },
          {
            "name": "天津",
            "id": "12",
            "City": [
              {
                "name": "和平",
                "id": "1"
              },
              {
                "name": "河东",
                "id": "2"
              },
              {
                "name": "河西",
                "id": "3"
              },
              {
                "name": "南开",
                "id": "4"
              },
              {
                "name": "河北",
                "id": "5"
              },
              {
                "name": "红桥",
                "id": "6"
              },
              {
                "name": "滨海新区",
                "id": "26"
              },
              {
                "name": "东丽",
                "id": "10"
              },
              {
                "name": "西青",
                "id": "11"
              },
              {
                "name": "津南",
                "id": "12"
              },
              {
                "name": "北辰",
                "id": "13"
              },
              {
                "name": "宁河",
                "id": "21"
              },
              {
                "name": "武清",
                "id": "22"
              },
              {
                "name": "静海",
                "id": "23"
              },
              {
                "name": "宝坻",
                "id": "24"
              },
              {
                "name": "蓟县",
                "id": "25"
              }
            ]
          },
          {
            "name": "河北",
            "id": "13",
            "City": [
              {
                "name": "石家庄",
                "id": "1",
                "Region": [
                  {
                    "name": "长安区",
                    "id": "2"
                  },
                  {
                    "name": "桥东区",
                    "id": "3"
                  },
                  {
                    "name": "桥西区",
                    "id": "4"
                  },
                  {
                    "name": "新华区",
                    "id": "5"
                  },
                  {
                    "name": "井陉矿区",
                    "id": "7"
                  },
                  {
                    "name": "裕华区",
                    "id": "8"
                  },
                  {
                    "name": "井陉县",
                    "id": "21"
                  },
                  {
                    "name": "正定县",
                    "id": "23"
                  },
                  {
                    "name": "栾城县",
                    "id": "24"
                  },
                  {
                    "name": "行唐县",
                    "id": "25"
                  },
                  {
                    "name": "灵寿县",
                    "id": "26"
                  },
                  {
                    "name": "高邑县",
                    "id": "27"
                  },
                  {
                    "name": "深泽县",
                    "id": "28"
                  },
                  {
                    "name": "赞皇县",
                    "id": "29"
                  },
                  {
                    "name": "无极县",
                    "id": "30"
                  },
                  {
                    "name": "平山县",
                    "id": "31"
                  },
                  {
                    "name": "元氏县",
                    "id": "32"
                  },
                  {
                    "name": "赵县",
                    "id": "33"
                  },
                  {
                    "name": "辛集市",
                    "id": "81"
                  },
                  {
                    "name": "藁城市",
                    "id": "82"
                  },
                  {
                    "name": "晋州市",
                    "id": "83"
                  },
                  {
                    "name": "新乐市",
                    "id": "84"
                  },
                  {
                    "name": "鹿泉市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "唐山",
                "id": "2",
                "Region": [
                  {
                    "name": "路南区",
                    "id": "2"
                  },
                  {
                    "name": "路北区",
                    "id": "3"
                  },
                  {
                    "name": "古冶区",
                    "id": "4"
                  },
                  {
                    "name": "开平区",
                    "id": "5"
                  },
                  {
                    "name": "丰南区",
                    "id": "7"
                  },
                  {
                    "name": "丰润区",
                    "id": "8"
                  },
                  {
                    "name": "曹妃甸区",
                    "id": "9"
                  },
                  {
                    "name": "滦　县",
                    "id": "23"
                  },
                  {
                    "name": "滦南县",
                    "id": "24"
                  },
                  {
                    "name": "乐亭县",
                    "id": "25"
                  },
                  {
                    "name": "迁西县",
                    "id": "27"
                  },
                  {
                    "name": "玉田县",
                    "id": "29"
                  },
                  {
                    "name": "遵化市",
                    "id": "81"
                  },
                  {
                    "name": "迁安市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "秦皇岛",
                "id": "3",
                "Region": [
                  {
                    "name": "海港区",
                    "id": "2"
                  },
                  {
                    "name": "山海关区",
                    "id": "3"
                  },
                  {
                    "name": "北戴河区",
                    "id": "4"
                  },
                  {
                    "name": "青龙满族自治县",
                    "id": "21"
                  },
                  {
                    "name": "昌黎县",
                    "id": "22"
                  },
                  {
                    "name": "抚宁县",
                    "id": "23"
                  },
                  {
                    "name": "卢龙县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "邯郸",
                "id": "4",
                "Region": [
                  {
                    "name": "邯山区",
                    "id": "2"
                  },
                  {
                    "name": "丛台区",
                    "id": "3"
                  },
                  {
                    "name": "复兴区",
                    "id": "4"
                  },
                  {
                    "name": "峰峰矿区",
                    "id": "6"
                  },
                  {
                    "name": "邯郸县",
                    "id": "21"
                  },
                  {
                    "name": "临漳县",
                    "id": "23"
                  },
                  {
                    "name": "成安县",
                    "id": "24"
                  },
                  {
                    "name": "大名县",
                    "id": "25"
                  },
                  {
                    "name": "涉　县",
                    "id": "26"
                  },
                  {
                    "name": "磁　县",
                    "id": "27"
                  },
                  {
                    "name": "肥乡县",
                    "id": "28"
                  },
                  {
                    "name": "永年县",
                    "id": "29"
                  },
                  {
                    "name": "邱　县",
                    "id": "30"
                  },
                  {
                    "name": "鸡泽县",
                    "id": "31"
                  },
                  {
                    "name": "广平县",
                    "id": "32"
                  },
                  {
                    "name": "馆陶县",
                    "id": "33"
                  },
                  {
                    "name": "魏　县",
                    "id": "34"
                  },
                  {
                    "name": "曲周县",
                    "id": "35"
                  },
                  {
                    "name": "武安市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "邢台",
                "id": "5",
                "Region": [
                  {
                    "name": "桥东区",
                    "id": "2"
                  },
                  {
                    "name": "桥西区",
                    "id": "3"
                  },
                  {
                    "name": "邢台县",
                    "id": "21"
                  },
                  {
                    "name": "临城县",
                    "id": "22"
                  },
                  {
                    "name": "内丘县",
                    "id": "23"
                  },
                  {
                    "name": "柏乡县",
                    "id": "24"
                  },
                  {
                    "name": "隆尧县",
                    "id": "25"
                  },
                  {
                    "name": "任　县",
                    "id": "26"
                  },
                  {
                    "name": "南和县",
                    "id": "27"
                  },
                  {
                    "name": "宁晋县",
                    "id": "28"
                  },
                  {
                    "name": "巨鹿县",
                    "id": "29"
                  },
                  {
                    "name": "新河县",
                    "id": "30"
                  },
                  {
                    "name": "广宗县",
                    "id": "31"
                  },
                  {
                    "name": "平乡县",
                    "id": "32"
                  },
                  {
                    "name": "威　县",
                    "id": "33"
                  },
                  {
                    "name": "清河县",
                    "id": "34"
                  },
                  {
                    "name": "临西县",
                    "id": "35"
                  },
                  {
                    "name": "南宫市",
                    "id": "81"
                  },
                  {
                    "name": "沙河市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "保定",
                "id": "6",
                "Region": [
                  {
                    "name": "新市区",
                    "id": "2"
                  },
                  {
                    "name": "北市区",
                    "id": "3"
                  },
                  {
                    "name": "南市区",
                    "id": "4"
                  },
                  {
                    "name": "满城县",
                    "id": "21"
                  },
                  {
                    "name": "清苑县",
                    "id": "22"
                  },
                  {
                    "name": "涞水县",
                    "id": "23"
                  },
                  {
                    "name": "阜平县",
                    "id": "24"
                  },
                  {
                    "name": "徐水县",
                    "id": "25"
                  },
                  {
                    "name": "定兴县",
                    "id": "26"
                  },
                  {
                    "name": "唐　县",
                    "id": "27"
                  },
                  {
                    "name": "高阳县",
                    "id": "28"
                  },
                  {
                    "name": "容城县",
                    "id": "29"
                  },
                  {
                    "name": "涞源县",
                    "id": "30"
                  },
                  {
                    "name": "望都县",
                    "id": "31"
                  },
                  {
                    "name": "安新县",
                    "id": "32"
                  },
                  {
                    "name": "易　县",
                    "id": "33"
                  },
                  {
                    "name": "曲阳县",
                    "id": "34"
                  },
                  {
                    "name": "蠡　县",
                    "id": "35"
                  },
                  {
                    "name": "顺平县",
                    "id": "36"
                  },
                  {
                    "name": "博野县",
                    "id": "37"
                  },
                  {
                    "name": "雄　县",
                    "id": "38"
                  },
                  {
                    "name": "涿州市",
                    "id": "81"
                  },
                  {
                    "name": "定州市",
                    "id": "82"
                  },
                  {
                    "name": "安国市",
                    "id": "83"
                  },
                  {
                    "name": "高碑店市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "张家口",
                "id": "7",
                "Region": [
                  {
                    "name": "桥东区",
                    "id": "2"
                  },
                  {
                    "name": "桥西区",
                    "id": "3"
                  },
                  {
                    "name": "宣化区",
                    "id": "5"
                  },
                  {
                    "name": "下花园区",
                    "id": "6"
                  },
                  {
                    "name": "宣化县",
                    "id": "21"
                  },
                  {
                    "name": "张北县",
                    "id": "22"
                  },
                  {
                    "name": "康保县",
                    "id": "23"
                  },
                  {
                    "name": "沽源县",
                    "id": "24"
                  },
                  {
                    "name": "尚义县",
                    "id": "25"
                  },
                  {
                    "name": "蔚　县",
                    "id": "26"
                  },
                  {
                    "name": "阳原县",
                    "id": "27"
                  },
                  {
                    "name": "怀安县",
                    "id": "28"
                  },
                  {
                    "name": "万全县",
                    "id": "29"
                  },
                  {
                    "name": "怀来县",
                    "id": "30"
                  },
                  {
                    "name": "涿鹿县",
                    "id": "31"
                  },
                  {
                    "name": "赤城县",
                    "id": "32"
                  },
                  {
                    "name": "崇礼县",
                    "id": "33"
                  }
                ]
              },
              {
                "name": "承德",
                "id": "8",
                "Region": [
                  {
                    "name": "双桥区",
                    "id": "2"
                  },
                  {
                    "name": "双滦区",
                    "id": "3"
                  },
                  {
                    "name": "鹰手营子矿区",
                    "id": "4"
                  },
                  {
                    "name": "承德县",
                    "id": "21"
                  },
                  {
                    "name": "兴隆县",
                    "id": "22"
                  },
                  {
                    "name": "平泉县",
                    "id": "23"
                  },
                  {
                    "name": "滦平县",
                    "id": "24"
                  },
                  {
                    "name": "隆化县",
                    "id": "25"
                  },
                  {
                    "name": "丰宁满族自治县",
                    "id": "26"
                  },
                  {
                    "name": "宽城满族自治县",
                    "id": "27"
                  },
                  {
                    "name": "围场满族蒙古族自治县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "沧州",
                "id": "9",
                "Region": [
                  {
                    "name": "新华区",
                    "id": "2"
                  },
                  {
                    "name": "运河区",
                    "id": "3"
                  },
                  {
                    "name": "沧　县",
                    "id": "21"
                  },
                  {
                    "name": "青　县",
                    "id": "22"
                  },
                  {
                    "name": "东光县",
                    "id": "23"
                  },
                  {
                    "name": "海兴县",
                    "id": "24"
                  },
                  {
                    "name": "盐山县",
                    "id": "25"
                  },
                  {
                    "name": "肃宁县",
                    "id": "26"
                  },
                  {
                    "name": "南皮县",
                    "id": "27"
                  },
                  {
                    "name": "吴桥县",
                    "id": "28"
                  },
                  {
                    "name": "献　县",
                    "id": "29"
                  },
                  {
                    "name": "孟村回族自治县",
                    "id": "30"
                  },
                  {
                    "name": "泊头市",
                    "id": "81"
                  },
                  {
                    "name": "任丘市",
                    "id": "82"
                  },
                  {
                    "name": "黄骅市",
                    "id": "83"
                  },
                  {
                    "name": "河间市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "廊坊",
                "id": "10",
                "Region": [
                  {
                    "name": "安次区",
                    "id": "2"
                  },
                  {
                    "name": "广阳区",
                    "id": "3"
                  },
                  {
                    "name": "固安县",
                    "id": "22"
                  },
                  {
                    "name": "永清县",
                    "id": "23"
                  },
                  {
                    "name": "香河县",
                    "id": "24"
                  },
                  {
                    "name": "大城县",
                    "id": "25"
                  },
                  {
                    "name": "文安县",
                    "id": "26"
                  },
                  {
                    "name": "大厂回族自治县",
                    "id": "28"
                  },
                  {
                    "name": "霸州市",
                    "id": "81"
                  },
                  {
                    "name": "三河市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "衡水",
                "id": "11",
                "Region": [
                  {
                    "name": "桃城区",
                    "id": "2"
                  },
                  {
                    "name": "枣强县",
                    "id": "21"
                  },
                  {
                    "name": "武邑县",
                    "id": "22"
                  },
                  {
                    "name": "武强县",
                    "id": "23"
                  },
                  {
                    "name": "饶阳县",
                    "id": "24"
                  },
                  {
                    "name": "安平县",
                    "id": "25"
                  },
                  {
                    "name": "故城县",
                    "id": "26"
                  },
                  {
                    "name": "景　县",
                    "id": "27"
                  },
                  {
                    "name": "阜城县",
                    "id": "28"
                  },
                  {
                    "name": "冀州市",
                    "id": "81"
                  },
                  {
                    "name": "深州市",
                    "id": "82"
                  }
                ]
              }
            ]
          },
          {
            "name": "山西",
            "id": "14",
            "City": [
              {
                "name": "太原",
                "id": "1",
                "Region": [
                  {
                    "name": "小店区",
                    "id": "5"
                  },
                  {
                    "name": "迎泽区",
                    "id": "6"
                  },
                  {
                    "name": "杏花岭区",
                    "id": "7"
                  },
                  {
                    "name": "尖草坪区",
                    "id": "8"
                  },
                  {
                    "name": "万柏林区",
                    "id": "9"
                  },
                  {
                    "name": "晋源区",
                    "id": "10"
                  },
                  {
                    "name": "清徐县",
                    "id": "21"
                  },
                  {
                    "name": "阳曲县",
                    "id": "22"
                  },
                  {
                    "name": "娄烦县",
                    "id": "23"
                  },
                  {
                    "name": "古交市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "大同",
                "id": "2",
                "Region": [
                  {
                    "name": "城　区",
                    "id": "2"
                  },
                  {
                    "name": "矿　区",
                    "id": "3"
                  },
                  {
                    "name": "南郊区",
                    "id": "11"
                  },
                  {
                    "name": "新荣区",
                    "id": "12"
                  },
                  {
                    "name": "阳高县",
                    "id": "21"
                  },
                  {
                    "name": "天镇县",
                    "id": "22"
                  },
                  {
                    "name": "广灵县",
                    "id": "23"
                  },
                  {
                    "name": "灵丘县",
                    "id": "24"
                  },
                  {
                    "name": "浑源县",
                    "id": "25"
                  },
                  {
                    "name": "左云县",
                    "id": "26"
                  },
                  {
                    "name": "大同县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "阳泉",
                "id": "3",
                "Region": [
                  {
                    "name": "城　区",
                    "id": "2"
                  },
                  {
                    "name": "矿　区",
                    "id": "3"
                  },
                  {
                    "name": "郊　区",
                    "id": "11"
                  },
                  {
                    "name": "平定县",
                    "id": "21"
                  },
                  {
                    "name": "盂　县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "长治",
                "id": "4",
                "Region": [
                  {
                    "name": "城　区",
                    "id": "2"
                  },
                  {
                    "name": "郊　区",
                    "id": "11"
                  },
                  {
                    "name": "长治县",
                    "id": "21"
                  },
                  {
                    "name": "襄垣县",
                    "id": "23"
                  },
                  {
                    "name": "屯留县",
                    "id": "24"
                  },
                  {
                    "name": "平顺县",
                    "id": "25"
                  },
                  {
                    "name": "黎城县",
                    "id": "26"
                  },
                  {
                    "name": "壶关县",
                    "id": "27"
                  },
                  {
                    "name": "长子县",
                    "id": "28"
                  },
                  {
                    "name": "武乡县",
                    "id": "29"
                  },
                  {
                    "name": "沁　县",
                    "id": "30"
                  },
                  {
                    "name": "沁源县",
                    "id": "31"
                  },
                  {
                    "name": "潞城市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "晋城",
                "id": "5",
                "Region": [
                  {
                    "name": "城　区",
                    "id": "2"
                  },
                  {
                    "name": "沁水县",
                    "id": "21"
                  },
                  {
                    "name": "阳城县",
                    "id": "22"
                  },
                  {
                    "name": "陵川县",
                    "id": "24"
                  },
                  {
                    "name": "泽州县",
                    "id": "25"
                  },
                  {
                    "name": "高平市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "朔州",
                "id": "6",
                "Region": [
                  {
                    "name": "朔城区",
                    "id": "2"
                  },
                  {
                    "name": "平鲁区",
                    "id": "3"
                  },
                  {
                    "name": "山阴县",
                    "id": "21"
                  },
                  {
                    "name": "应　县",
                    "id": "22"
                  },
                  {
                    "name": "右玉县",
                    "id": "23"
                  },
                  {
                    "name": "怀仁县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "晋中",
                "id": "7",
                "Region": [
                  {
                    "name": "榆次区",
                    "id": "2"
                  },
                  {
                    "name": "榆社县",
                    "id": "21"
                  },
                  {
                    "name": "左权县",
                    "id": "22"
                  },
                  {
                    "name": "和顺县",
                    "id": "23"
                  },
                  {
                    "name": "昔阳县",
                    "id": "24"
                  },
                  {
                    "name": "寿阳县",
                    "id": "25"
                  },
                  {
                    "name": "太谷县",
                    "id": "26"
                  },
                  {
                    "name": "祁　县",
                    "id": "27"
                  },
                  {
                    "name": "平遥县",
                    "id": "28"
                  },
                  {
                    "name": "灵石县",
                    "id": "29"
                  },
                  {
                    "name": "介休市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "运城",
                "id": "8",
                "Region": [
                  {
                    "name": "盐湖区",
                    "id": "2"
                  },
                  {
                    "name": "临猗县",
                    "id": "21"
                  },
                  {
                    "name": "万荣县",
                    "id": "22"
                  },
                  {
                    "name": "闻喜县",
                    "id": "23"
                  },
                  {
                    "name": "稷山县",
                    "id": "24"
                  },
                  {
                    "name": "新绛县",
                    "id": "25"
                  },
                  {
                    "name": "绛　县",
                    "id": "26"
                  },
                  {
                    "name": "垣曲县",
                    "id": "27"
                  },
                  {
                    "name": "夏　县",
                    "id": "28"
                  },
                  {
                    "name": "平陆县",
                    "id": "29"
                  },
                  {
                    "name": "芮城县",
                    "id": "30"
                  },
                  {
                    "name": "永济市",
                    "id": "81"
                  },
                  {
                    "name": "河津市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "忻州",
                "id": "9",
                "Region": [
                  {
                    "name": "忻府区",
                    "id": "2"
                  },
                  {
                    "name": "定襄县",
                    "id": "21"
                  },
                  {
                    "name": "五台县",
                    "id": "22"
                  },
                  {
                    "name": "代　县",
                    "id": "23"
                  },
                  {
                    "name": "繁峙县",
                    "id": "24"
                  },
                  {
                    "name": "宁武县",
                    "id": "25"
                  },
                  {
                    "name": "静乐县",
                    "id": "26"
                  },
                  {
                    "name": "神池县",
                    "id": "27"
                  },
                  {
                    "name": "五寨县",
                    "id": "28"
                  },
                  {
                    "name": "岢岚县",
                    "id": "29"
                  },
                  {
                    "name": "河曲县",
                    "id": "30"
                  },
                  {
                    "name": "保德县",
                    "id": "31"
                  },
                  {
                    "name": "偏关县",
                    "id": "32"
                  },
                  {
                    "name": "原平市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "临汾",
                "id": "10",
                "Region": [
                  {
                    "name": "尧都区",
                    "id": "2"
                  },
                  {
                    "name": "曲沃县",
                    "id": "21"
                  },
                  {
                    "name": "翼城县",
                    "id": "22"
                  },
                  {
                    "name": "襄汾县",
                    "id": "23"
                  },
                  {
                    "name": "洪洞县",
                    "id": "24"
                  },
                  {
                    "name": "古　县",
                    "id": "25"
                  },
                  {
                    "name": "安泽县",
                    "id": "26"
                  },
                  {
                    "name": "浮山县",
                    "id": "27"
                  },
                  {
                    "name": "吉　县",
                    "id": "28"
                  },
                  {
                    "name": "乡宁县",
                    "id": "29"
                  },
                  {
                    "name": "大宁县",
                    "id": "30"
                  },
                  {
                    "name": "隰　县",
                    "id": "31"
                  },
                  {
                    "name": "永和县",
                    "id": "32"
                  },
                  {
                    "name": "蒲　县",
                    "id": "33"
                  },
                  {
                    "name": "汾西县",
                    "id": "34"
                  },
                  {
                    "name": "侯马市",
                    "id": "81"
                  },
                  {
                    "name": "霍州市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "吕梁",
                "id": "11",
                "Region": [
                  {
                    "name": "离石区",
                    "id": "2"
                  },
                  {
                    "name": "文水县",
                    "id": "21"
                  },
                  {
                    "name": "交城县",
                    "id": "22"
                  },
                  {
                    "name": "兴　县",
                    "id": "23"
                  },
                  {
                    "name": "临　县",
                    "id": "24"
                  },
                  {
                    "name": "柳林县",
                    "id": "25"
                  },
                  {
                    "name": "石楼县",
                    "id": "26"
                  },
                  {
                    "name": "岚　县",
                    "id": "27"
                  },
                  {
                    "name": "方山县",
                    "id": "28"
                  },
                  {
                    "name": "中阳县",
                    "id": "29"
                  },
                  {
                    "name": "交口县",
                    "id": "30"
                  },
                  {
                    "name": "孝义市",
                    "id": "81"
                  },
                  {
                    "name": "汾阳市",
                    "id": "82"
                  }
                ]
              }
            ]
          },
          {
            "name": "内蒙古",
            "id": "15",
            "City": [
              {
                "name": "呼和浩特",
                "id": "1",
                "Region": [
                  {
                    "name": "新城区",
                    "id": "2"
                  },
                  {
                    "name": "回民区",
                    "id": "3"
                  },
                  {
                    "name": "玉泉区",
                    "id": "4"
                  },
                  {
                    "name": "赛罕区",
                    "id": "5"
                  },
                  {
                    "name": "土默特左旗",
                    "id": "21"
                  },
                  {
                    "name": "托克托县",
                    "id": "22"
                  },
                  {
                    "name": "和林格尔县",
                    "id": "23"
                  },
                  {
                    "name": "清水河县",
                    "id": "24"
                  },
                  {
                    "name": "武川县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "包头",
                "id": "2",
                "Region": [
                  {
                    "name": "东河区",
                    "id": "2"
                  },
                  {
                    "name": "昆都仑区",
                    "id": "3"
                  },
                  {
                    "name": "青山区",
                    "id": "4"
                  },
                  {
                    "name": "石拐区",
                    "id": "5"
                  },
                  {
                    "name": "白云鄂博矿区",
                    "id": "6"
                  },
                  {
                    "name": "九原区",
                    "id": "7"
                  },
                  {
                    "name": "土默特右旗",
                    "id": "21"
                  },
                  {
                    "name": "固阳县",
                    "id": "22"
                  },
                  {
                    "name": "达尔罕茂明安联合旗",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "乌海",
                "id": "3",
                "Region": [
                  {
                    "name": "海勃湾区",
                    "id": "2"
                  },
                  {
                    "name": "海南区",
                    "id": "3"
                  },
                  {
                    "name": "乌达区",
                    "id": "4"
                  }
                ]
              },
              {
                "name": "赤峰",
                "id": "4",
                "Region": [
                  {
                    "name": "红山区",
                    "id": "2"
                  },
                  {
                    "name": "元宝山区",
                    "id": "3"
                  },
                  {
                    "name": "松山区",
                    "id": "4"
                  },
                  {
                    "name": "阿鲁科尔沁旗",
                    "id": "21"
                  },
                  {
                    "name": "巴林左旗",
                    "id": "22"
                  },
                  {
                    "name": "巴林右旗",
                    "id": "23"
                  },
                  {
                    "name": "林西县",
                    "id": "24"
                  },
                  {
                    "name": "克什克腾旗",
                    "id": "25"
                  },
                  {
                    "name": "翁牛特旗",
                    "id": "26"
                  },
                  {
                    "name": "喀喇沁旗",
                    "id": "28"
                  },
                  {
                    "name": "宁城县",
                    "id": "29"
                  },
                  {
                    "name": "敖汉旗",
                    "id": "30"
                  }
                ]
              },
              {
                "name": "通辽",
                "id": "5",
                "Region": [
                  {
                    "name": "科尔沁区",
                    "id": "2"
                  },
                  {
                    "name": "科尔沁左翼中旗",
                    "id": "21"
                  },
                  {
                    "name": "科尔沁左翼后旗",
                    "id": "22"
                  },
                  {
                    "name": "开鲁县",
                    "id": "23"
                  },
                  {
                    "name": "库伦旗",
                    "id": "24"
                  },
                  {
                    "name": "奈曼旗",
                    "id": "25"
                  },
                  {
                    "name": "扎鲁特旗",
                    "id": "26"
                  },
                  {
                    "name": "霍林郭勒市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "鄂尔多斯",
                "id": "6",
                "Region": [
                  {
                    "name": "东胜区",
                    "id": "2"
                  },
                  {
                    "name": "达拉特旗",
                    "id": "21"
                  },
                  {
                    "name": "准格尔旗",
                    "id": "22"
                  },
                  {
                    "name": "鄂托克前旗",
                    "id": "23"
                  },
                  {
                    "name": "鄂托克旗",
                    "id": "24"
                  },
                  {
                    "name": "杭锦旗",
                    "id": "25"
                  },
                  {
                    "name": "乌审旗",
                    "id": "26"
                  },
                  {
                    "name": "伊金霍洛旗",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "呼伦贝尔",
                "id": "7",
                "Region": [
                  {
                    "name": "海拉尔区",
                    "id": "2"
                  },
                  {
                    "name": "阿荣旗",
                    "id": "21"
                  },
                  {
                    "name": "莫力达瓦达斡尔族自治旗",
                    "id": "22"
                  },
                  {
                    "name": "鄂伦春自治旗",
                    "id": "23"
                  },
                  {
                    "name": "鄂温克族自治旗",
                    "id": "24"
                  },
                  {
                    "name": "陈巴尔虎旗",
                    "id": "25"
                  },
                  {
                    "name": "新巴尔虎左旗",
                    "id": "26"
                  },
                  {
                    "name": "新巴尔虎右旗",
                    "id": "27"
                  },
                  {
                    "name": "满洲里市",
                    "id": "81"
                  },
                  {
                    "name": "牙克石市",
                    "id": "82"
                  },
                  {
                    "name": "扎兰屯市",
                    "id": "83"
                  },
                  {
                    "name": "额尔古纳市",
                    "id": "84"
                  },
                  {
                    "name": "根河市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "巴彦淖尔",
                "id": "8",
                "Region": [
                  {
                    "name": "临河区",
                    "id": "2"
                  },
                  {
                    "name": "五原县",
                    "id": "21"
                  },
                  {
                    "name": "磴口县",
                    "id": "22"
                  },
                  {
                    "name": "乌拉特前旗",
                    "id": "23"
                  },
                  {
                    "name": "乌拉特中旗",
                    "id": "24"
                  },
                  {
                    "name": "乌拉特后旗",
                    "id": "25"
                  },
                  {
                    "name": "杭锦后旗",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "乌兰察布",
                "id": "9",
                "Region": [
                  {
                    "name": "集宁区",
                    "id": "2"
                  },
                  {
                    "name": "卓资县",
                    "id": "21"
                  },
                  {
                    "name": "化德县",
                    "id": "22"
                  },
                  {
                    "name": "商都县",
                    "id": "23"
                  },
                  {
                    "name": "兴和县",
                    "id": "24"
                  },
                  {
                    "name": "凉城县",
                    "id": "25"
                  },
                  {
                    "name": "察哈尔右翼前旗",
                    "id": "26"
                  },
                  {
                    "name": "察哈尔右翼中旗",
                    "id": "27"
                  },
                  {
                    "name": "察哈尔右翼后旗",
                    "id": "28"
                  },
                  {
                    "name": "四子王旗",
                    "id": "29"
                  },
                  {
                    "name": "丰镇市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "兴安",
                "id": "22",
                "Region": [
                  {
                    "name": "乌兰浩特市",
                    "id": "1"
                  },
                  {
                    "name": "阿尔山市",
                    "id": "2"
                  },
                  {
                    "name": "科尔沁右翼前旗",
                    "id": "21"
                  },
                  {
                    "name": "科尔沁右翼中旗",
                    "id": "22"
                  },
                  {
                    "name": "扎赉特旗",
                    "id": "23"
                  },
                  {
                    "name": "突泉县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "锡林郭勒",
                "id": "25",
                "Region": [
                  {
                    "name": "二连浩特市",
                    "id": "1"
                  },
                  {
                    "name": "锡林浩特市",
                    "id": "2"
                  },
                  {
                    "name": "阿巴嘎旗",
                    "id": "22"
                  },
                  {
                    "name": "苏尼特左旗",
                    "id": "23"
                  },
                  {
                    "name": "苏尼特右旗",
                    "id": "24"
                  },
                  {
                    "name": "东乌珠穆沁旗",
                    "id": "25"
                  },
                  {
                    "name": "西乌珠穆沁旗",
                    "id": "26"
                  },
                  {
                    "name": "太仆寺旗",
                    "id": "27"
                  },
                  {
                    "name": "镶黄旗",
                    "id": "28"
                  },
                  {
                    "name": "正镶白旗",
                    "id": "29"
                  },
                  {
                    "name": "正蓝旗",
                    "id": "30"
                  },
                  {
                    "name": "多伦县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "阿拉善",
                "id": "29",
                "Region": [
                  {
                    "name": "阿拉善左旗",
                    "id": "21"
                  },
                  {
                    "name": "阿拉善右旗",
                    "id": "22"
                  },
                  {
                    "name": "额济纳旗",
                    "id": "23"
                  }
                ]
              }
            ]
          },
          {
            "name": "辽宁",
            "id": "21",
            "City": [
              {
                "name": "沈阳",
                "id": "1",
                "Region": [
                  {
                    "name": "和平区",
                    "id": "2"
                  },
                  {
                    "name": "沈河区",
                    "id": "3"
                  },
                  {
                    "name": "大东区",
                    "id": "4"
                  },
                  {
                    "name": "皇姑区",
                    "id": "5"
                  },
                  {
                    "name": "铁西区",
                    "id": "6"
                  },
                  {
                    "name": "苏家屯区",
                    "id": "11"
                  },
                  {
                    "name": "东陵区",
                    "id": "12"
                  },
                  {
                    "name": "沈北新区",
                    "id": "13"
                  },
                  {
                    "name": "于洪区",
                    "id": "14"
                  },
                  {
                    "name": "辽中县",
                    "id": "22"
                  },
                  {
                    "name": "康平县",
                    "id": "23"
                  },
                  {
                    "name": "法库县",
                    "id": "24"
                  },
                  {
                    "name": "新民市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "大连",
                "id": "2",
                "Region": [
                  {
                    "name": "中山区",
                    "id": "2"
                  },
                  {
                    "name": "西岗区",
                    "id": "3"
                  },
                  {
                    "name": "沙河口区",
                    "id": "4"
                  },
                  {
                    "name": "甘井子区",
                    "id": "11"
                  },
                  {
                    "name": "旅顺口区",
                    "id": "12"
                  },
                  {
                    "name": "金州区",
                    "id": "13"
                  },
                  {
                    "name": "长海县",
                    "id": "24"
                  },
                  {
                    "name": "瓦房店市",
                    "id": "81"
                  },
                  {
                    "name": "普兰店市",
                    "id": "82"
                  },
                  {
                    "name": "庄河市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "鞍山",
                "id": "3",
                "Region": [
                  {
                    "name": "铁东区",
                    "id": "2"
                  },
                  {
                    "name": "铁西区",
                    "id": "3"
                  },
                  {
                    "name": "立山区",
                    "id": "4"
                  },
                  {
                    "name": "千山区",
                    "id": "11"
                  },
                  {
                    "name": "台安县",
                    "id": "21"
                  },
                  {
                    "name": "岫岩满族自治县",
                    "id": "23"
                  },
                  {
                    "name": "海城市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "抚顺",
                "id": "4",
                "Region": [
                  {
                    "name": "新抚区",
                    "id": "2"
                  },
                  {
                    "name": "东洲区",
                    "id": "3"
                  },
                  {
                    "name": "望花区",
                    "id": "4"
                  },
                  {
                    "name": "顺城区",
                    "id": "11"
                  },
                  {
                    "name": "抚顺县",
                    "id": "21"
                  },
                  {
                    "name": "新宾满族自治县",
                    "id": "22"
                  },
                  {
                    "name": "清原满族自治县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "本溪",
                "id": "5",
                "Region": [
                  {
                    "name": "平山区",
                    "id": "2"
                  },
                  {
                    "name": "溪湖区",
                    "id": "3"
                  },
                  {
                    "name": "明山区",
                    "id": "4"
                  },
                  {
                    "name": "南芬区",
                    "id": "5"
                  },
                  {
                    "name": "本溪满族自治县",
                    "id": "21"
                  },
                  {
                    "name": "桓仁满族自治县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "丹东",
                "id": "6",
                "Region": [
                  {
                    "name": "元宝区",
                    "id": "2"
                  },
                  {
                    "name": "振兴区",
                    "id": "3"
                  },
                  {
                    "name": "振安区",
                    "id": "4"
                  },
                  {
                    "name": "宽甸满族自治县",
                    "id": "24"
                  },
                  {
                    "name": "东港市",
                    "id": "81"
                  },
                  {
                    "name": "凤城市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "锦州",
                "id": "7",
                "Region": [
                  {
                    "name": "古塔区",
                    "id": "2"
                  },
                  {
                    "name": "凌河区",
                    "id": "3"
                  },
                  {
                    "name": "太和区",
                    "id": "11"
                  },
                  {
                    "name": "黑山县",
                    "id": "26"
                  },
                  {
                    "name": "义　县",
                    "id": "27"
                  },
                  {
                    "name": "凌海市",
                    "id": "81"
                  },
                  {
                    "name": "北镇市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "营口",
                "id": "8",
                "Region": [
                  {
                    "name": "站前区",
                    "id": "2"
                  },
                  {
                    "name": "西市区",
                    "id": "3"
                  },
                  {
                    "name": "鲅鱼圈区",
                    "id": "4"
                  },
                  {
                    "name": "老边区",
                    "id": "11"
                  },
                  {
                    "name": "盖州市",
                    "id": "81"
                  },
                  {
                    "name": "大石桥市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "阜新",
                "id": "9",
                "Region": [
                  {
                    "name": "海州区",
                    "id": "2"
                  },
                  {
                    "name": "新邱区",
                    "id": "3"
                  },
                  {
                    "name": "太平区",
                    "id": "4"
                  },
                  {
                    "name": "清河门区",
                    "id": "5"
                  },
                  {
                    "name": "细河区",
                    "id": "11"
                  },
                  {
                    "name": "阜新蒙古族自治县",
                    "id": "21"
                  },
                  {
                    "name": "彰武县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "辽阳",
                "id": "10",
                "Region": [
                  {
                    "name": "白塔区",
                    "id": "2"
                  },
                  {
                    "name": "文圣区",
                    "id": "3"
                  },
                  {
                    "name": "宏伟区",
                    "id": "4"
                  },
                  {
                    "name": "弓长岭区",
                    "id": "5"
                  },
                  {
                    "name": "太子河区",
                    "id": "11"
                  },
                  {
                    "name": "辽阳县",
                    "id": "21"
                  },
                  {
                    "name": "灯塔市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "盘锦",
                "id": "11",
                "Region": [
                  {
                    "name": "双台子区",
                    "id": "2"
                  },
                  {
                    "name": "兴隆台区",
                    "id": "3"
                  },
                  {
                    "name": "大洼县",
                    "id": "21"
                  },
                  {
                    "name": "盘山县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "铁岭",
                "id": "12",
                "Region": [
                  {
                    "name": "银州区",
                    "id": "2"
                  },
                  {
                    "name": "清河区",
                    "id": "4"
                  },
                  {
                    "name": "铁岭县",
                    "id": "21"
                  },
                  {
                    "name": "西丰县",
                    "id": "23"
                  },
                  {
                    "name": "昌图县",
                    "id": "24"
                  },
                  {
                    "name": "调兵山市",
                    "id": "81"
                  },
                  {
                    "name": "开原市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "朝阳",
                "id": "13",
                "Region": [
                  {
                    "name": "双塔区",
                    "id": "2"
                  },
                  {
                    "name": "龙城区",
                    "id": "3"
                  },
                  {
                    "name": "朝阳县",
                    "id": "21"
                  },
                  {
                    "name": "建平县",
                    "id": "22"
                  },
                  {
                    "name": "喀喇沁左翼蒙古族自治县",
                    "id": "24"
                  },
                  {
                    "name": "北票市",
                    "id": "81"
                  },
                  {
                    "name": "凌源市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "葫芦岛",
                "id": "14",
                "Region": [
                  {
                    "name": "连山区",
                    "id": "2"
                  },
                  {
                    "name": "龙港区",
                    "id": "3"
                  },
                  {
                    "name": "南票区",
                    "id": "4"
                  },
                  {
                    "name": "绥中县",
                    "id": "21"
                  },
                  {
                    "name": "建昌县",
                    "id": "22"
                  },
                  {
                    "name": "兴城市",
                    "id": "81"
                  }
                ]
              }
            ]
          },
          {
            "name": "吉林",
            "id": "22",
            "City": [
              {
                "name": "长春",
                "id": "1",
                "Region": [
                  {
                    "name": "南关区",
                    "id": "2"
                  },
                  {
                    "name": "宽城区",
                    "id": "3"
                  },
                  {
                    "name": "朝阳区",
                    "id": "4"
                  },
                  {
                    "name": "二道区",
                    "id": "5"
                  },
                  {
                    "name": "绿园区",
                    "id": "6"
                  },
                  {
                    "name": "双阳区",
                    "id": "12"
                  },
                  {
                    "name": "农安县",
                    "id": "22"
                  },
                  {
                    "name": "九台市",
                    "id": "81"
                  },
                  {
                    "name": "榆树市",
                    "id": "82"
                  },
                  {
                    "name": "德惠市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "吉林",
                "id": "2",
                "Region": [
                  {
                    "name": "昌邑区",
                    "id": "2"
                  },
                  {
                    "name": "龙潭区",
                    "id": "3"
                  },
                  {
                    "name": "船营区",
                    "id": "4"
                  },
                  {
                    "name": "丰满区",
                    "id": "11"
                  },
                  {
                    "name": "永吉县",
                    "id": "21"
                  },
                  {
                    "name": "蛟河市",
                    "id": "81"
                  },
                  {
                    "name": "桦甸市",
                    "id": "82"
                  },
                  {
                    "name": "舒兰市",
                    "id": "83"
                  },
                  {
                    "name": "磐石市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "四平",
                "id": "3",
                "Region": [
                  {
                    "name": "铁西区",
                    "id": "2"
                  },
                  {
                    "name": "铁东区",
                    "id": "3"
                  },
                  {
                    "name": "梨树县",
                    "id": "22"
                  },
                  {
                    "name": "伊通满族自治县",
                    "id": "23"
                  },
                  {
                    "name": "公主岭市",
                    "id": "81"
                  },
                  {
                    "name": "双辽市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "辽源",
                "id": "4",
                "Region": [
                  {
                    "name": "龙山区",
                    "id": "2"
                  },
                  {
                    "name": "西安区",
                    "id": "3"
                  },
                  {
                    "name": "东丰县",
                    "id": "21"
                  },
                  {
                    "name": "东辽县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "通化",
                "id": "5",
                "Region": [
                  {
                    "name": "东昌区",
                    "id": "2"
                  },
                  {
                    "name": "二道江区",
                    "id": "3"
                  },
                  {
                    "name": "通化县",
                    "id": "21"
                  },
                  {
                    "name": "辉南县",
                    "id": "23"
                  },
                  {
                    "name": "柳河县",
                    "id": "24"
                  },
                  {
                    "name": "梅河口市",
                    "id": "81"
                  },
                  {
                    "name": "集安市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "白山",
                "id": "6",
                "Region": [
                  {
                    "name": "八道江区",
                    "id": "2"
                  },
                  {
                    "name": "江源区",
                    "id": "5"
                  },
                  {
                    "name": "抚松县",
                    "id": "21"
                  },
                  {
                    "name": "靖宇县",
                    "id": "22"
                  },
                  {
                    "name": "长白朝鲜族自治县",
                    "id": "23"
                  },
                  {
                    "name": "临江市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "松原",
                "id": "7",
                "Region": [
                  {
                    "name": "宁江区",
                    "id": "2"
                  },
                  {
                    "name": "前郭尔罗斯蒙古族自治县",
                    "id": "21"
                  },
                  {
                    "name": "长岭县",
                    "id": "22"
                  },
                  {
                    "name": "乾安县",
                    "id": "23"
                  },
                  {
                    "name": "扶余县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "白城",
                "id": "8",
                "Region": [
                  {
                    "name": "洮北区",
                    "id": "2"
                  },
                  {
                    "name": "镇赉县",
                    "id": "21"
                  },
                  {
                    "name": "通榆县",
                    "id": "22"
                  },
                  {
                    "name": "洮南市",
                    "id": "81"
                  },
                  {
                    "name": "大安市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "延边",
                "id": "24",
                "Region": [
                  {
                    "name": "延吉市",
                    "id": "1"
                  },
                  {
                    "name": "图们市",
                    "id": "2"
                  },
                  {
                    "name": "敦化市",
                    "id": "3"
                  },
                  {
                    "name": "珲春市",
                    "id": "4"
                  },
                  {
                    "name": "龙井市",
                    "id": "5"
                  },
                  {
                    "name": "和龙市",
                    "id": "6"
                  },
                  {
                    "name": "汪清县",
                    "id": "24"
                  },
                  {
                    "name": "安图县",
                    "id": "26"
                  }
                ]
              }
            ]
          },
          {
            "name": "黑龙江",
            "id": "23",
            "City": [
              {
                "name": "哈尔滨",
                "id": "1",
                "Region": [
                  {
                    "name": "道里区",
                    "id": "2"
                  },
                  {
                    "name": "南岗区",
                    "id": "3"
                  },
                  {
                    "name": "道外区",
                    "id": "4"
                  },
                  {
                    "name": "平房区",
                    "id": "8"
                  },
                  {
                    "name": "松北区",
                    "id": "9"
                  },
                  {
                    "name": "香坊区",
                    "id": "10"
                  },
                  {
                    "name": "呼兰区",
                    "id": "11"
                  },
                  {
                    "name": "阿城区",
                    "id": "12"
                  },
                  {
                    "name": "依兰县",
                    "id": "23"
                  },
                  {
                    "name": "方正县",
                    "id": "24"
                  },
                  {
                    "name": "宾　县",
                    "id": "25"
                  },
                  {
                    "name": "巴彦县",
                    "id": "26"
                  },
                  {
                    "name": "木兰县",
                    "id": "27"
                  },
                  {
                    "name": "通河县",
                    "id": "28"
                  },
                  {
                    "name": "延寿县",
                    "id": "29"
                  },
                  {
                    "name": "双城市",
                    "id": "82"
                  },
                  {
                    "name": "尚志市",
                    "id": "83"
                  },
                  {
                    "name": "五常市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "齐齐哈尔",
                "id": "2",
                "Region": [
                  {
                    "name": "龙沙区",
                    "id": "2"
                  },
                  {
                    "name": "建华区",
                    "id": "3"
                  },
                  {
                    "name": "铁锋区",
                    "id": "4"
                  },
                  {
                    "name": "昂昂溪区",
                    "id": "5"
                  },
                  {
                    "name": "富拉尔基区",
                    "id": "6"
                  },
                  {
                    "name": "碾子山区",
                    "id": "7"
                  },
                  {
                    "name": "梅里斯达斡尔族区",
                    "id": "8"
                  },
                  {
                    "name": "龙江县",
                    "id": "21"
                  },
                  {
                    "name": "依安县",
                    "id": "23"
                  },
                  {
                    "name": "泰来县",
                    "id": "24"
                  },
                  {
                    "name": "甘南县",
                    "id": "25"
                  },
                  {
                    "name": "富裕县",
                    "id": "27"
                  },
                  {
                    "name": "克山县",
                    "id": "29"
                  },
                  {
                    "name": "克东县",
                    "id": "30"
                  },
                  {
                    "name": "拜泉县",
                    "id": "31"
                  },
                  {
                    "name": "讷河市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "鸡西",
                "id": "3",
                "Region": [
                  {
                    "name": "鸡冠区",
                    "id": "2"
                  },
                  {
                    "name": "恒山区",
                    "id": "3"
                  },
                  {
                    "name": "滴道区",
                    "id": "4"
                  },
                  {
                    "name": "梨树区",
                    "id": "5"
                  },
                  {
                    "name": "城子河区",
                    "id": "6"
                  },
                  {
                    "name": "麻山区",
                    "id": "7"
                  },
                  {
                    "name": "鸡东县",
                    "id": "21"
                  },
                  {
                    "name": "虎林市",
                    "id": "81"
                  },
                  {
                    "name": "密山市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "鹤岗",
                "id": "4",
                "Region": [
                  {
                    "name": "向阳区",
                    "id": "2"
                  },
                  {
                    "name": "工农区",
                    "id": "3"
                  },
                  {
                    "name": "南山区",
                    "id": "4"
                  },
                  {
                    "name": "兴安区",
                    "id": "5"
                  },
                  {
                    "name": "东山区",
                    "id": "6"
                  },
                  {
                    "name": "兴山区",
                    "id": "7"
                  },
                  {
                    "name": "萝北县",
                    "id": "21"
                  },
                  {
                    "name": "绥滨县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "双鸭山",
                "id": "5",
                "Region": [
                  {
                    "name": "尖山区",
                    "id": "2"
                  },
                  {
                    "name": "岭东区",
                    "id": "3"
                  },
                  {
                    "name": "四方台区",
                    "id": "5"
                  },
                  {
                    "name": "宝山区",
                    "id": "6"
                  },
                  {
                    "name": "集贤县",
                    "id": "21"
                  },
                  {
                    "name": "友谊县",
                    "id": "22"
                  },
                  {
                    "name": "宝清县",
                    "id": "23"
                  },
                  {
                    "name": "饶河县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "大庆",
                "id": "6",
                "Region": [
                  {
                    "name": "萨尔图区",
                    "id": "2"
                  },
                  {
                    "name": "龙凤区",
                    "id": "3"
                  },
                  {
                    "name": "让胡路区",
                    "id": "4"
                  },
                  {
                    "name": "红岗区",
                    "id": "5"
                  },
                  {
                    "name": "大同区",
                    "id": "6"
                  },
                  {
                    "name": "肇州县",
                    "id": "21"
                  },
                  {
                    "name": "肇源县",
                    "id": "22"
                  },
                  {
                    "name": "林甸县",
                    "id": "23"
                  },
                  {
                    "name": "杜尔伯特蒙古族自治县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "伊春",
                "id": "7",
                "Region": [
                  {
                    "name": "伊春区",
                    "id": "2"
                  },
                  {
                    "name": "南岔区",
                    "id": "3"
                  },
                  {
                    "name": "友好区",
                    "id": "4"
                  },
                  {
                    "name": "西林区",
                    "id": "5"
                  },
                  {
                    "name": "翠峦区",
                    "id": "6"
                  },
                  {
                    "name": "新青区",
                    "id": "7"
                  },
                  {
                    "name": "美溪区",
                    "id": "8"
                  },
                  {
                    "name": "金山屯区",
                    "id": "9"
                  },
                  {
                    "name": "五营区",
                    "id": "10"
                  },
                  {
                    "name": "乌马河区",
                    "id": "11"
                  },
                  {
                    "name": "汤旺河区",
                    "id": "12"
                  },
                  {
                    "name": "带岭区",
                    "id": "13"
                  },
                  {
                    "name": "乌伊岭区",
                    "id": "14"
                  },
                  {
                    "name": "红星区",
                    "id": "15"
                  },
                  {
                    "name": "上甘岭区",
                    "id": "16"
                  },
                  {
                    "name": "嘉荫县",
                    "id": "22"
                  },
                  {
                    "name": "铁力市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "佳木斯",
                "id": "8",
                "Region": [
                  {
                    "name": "向阳区",
                    "id": "3"
                  },
                  {
                    "name": "前进区",
                    "id": "4"
                  },
                  {
                    "name": "东风区",
                    "id": "5"
                  },
                  {
                    "name": "郊　区",
                    "id": "11"
                  },
                  {
                    "name": "桦南县",
                    "id": "22"
                  },
                  {
                    "name": "桦川县",
                    "id": "26"
                  },
                  {
                    "name": "汤原县",
                    "id": "28"
                  },
                  {
                    "name": "抚远县",
                    "id": "33"
                  },
                  {
                    "name": "同江市",
                    "id": "81"
                  },
                  {
                    "name": "富锦市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "七台河",
                "id": "9",
                "Region": [
                  {
                    "name": "新兴区",
                    "id": "2"
                  },
                  {
                    "name": "桃山区",
                    "id": "3"
                  },
                  {
                    "name": "茄子河区",
                    "id": "4"
                  },
                  {
                    "name": "勃利县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "牡丹江",
                "id": "10",
                "Region": [
                  {
                    "name": "东安区",
                    "id": "2"
                  },
                  {
                    "name": "阳明区",
                    "id": "3"
                  },
                  {
                    "name": "爱民区",
                    "id": "4"
                  },
                  {
                    "name": "西安区",
                    "id": "5"
                  },
                  {
                    "name": "东宁县",
                    "id": "24"
                  },
                  {
                    "name": "林口县",
                    "id": "25"
                  },
                  {
                    "name": "绥芬河市",
                    "id": "81"
                  },
                  {
                    "name": "海林市",
                    "id": "83"
                  },
                  {
                    "name": "宁安市",
                    "id": "84"
                  },
                  {
                    "name": "穆棱市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "黑河",
                "id": "11",
                "Region": [
                  {
                    "name": "爱辉区",
                    "id": "2"
                  },
                  {
                    "name": "嫩江县",
                    "id": "21"
                  },
                  {
                    "name": "逊克县",
                    "id": "23"
                  },
                  {
                    "name": "孙吴县",
                    "id": "24"
                  },
                  {
                    "name": "北安市",
                    "id": "81"
                  },
                  {
                    "name": "五大连池市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "绥化",
                "id": "12",
                "Region": [
                  {
                    "name": "北林区",
                    "id": "2"
                  },
                  {
                    "name": "望奎县",
                    "id": "21"
                  },
                  {
                    "name": "兰西县",
                    "id": "22"
                  },
                  {
                    "name": "青冈县",
                    "id": "23"
                  },
                  {
                    "name": "庆安县",
                    "id": "24"
                  },
                  {
                    "name": "明水县",
                    "id": "25"
                  },
                  {
                    "name": "绥棱县",
                    "id": "26"
                  },
                  {
                    "name": "安达市",
                    "id": "81"
                  },
                  {
                    "name": "肇东市",
                    "id": "82"
                  },
                  {
                    "name": "海伦市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "大兴安岭",
                "id": "27",
                "Region": [
                  {
                    "name": "呼玛县",
                    "id": "21"
                  },
                  {
                    "name": "塔河县",
                    "id": "22"
                  },
                  {
                    "name": "漠河县",
                    "id": "23"
                  }
                ]
              }
            ]
          },
          {
            "name": "上海",
            "id": "31",
            "City": [
              {
                "name": "黄浦",
                "id": "1"
              },
              {
                "name": "卢湾",
                "id": "3"
              },
              {
                "name": "徐汇",
                "id": "4"
              },
              {
                "name": "长宁",
                "id": "5"
              },
              {
                "name": "静安",
                "id": "6"
              },
              {
                "name": "普陀",
                "id": "7"
              },
              {
                "name": "闸北",
                "id": "8"
              },
              {
                "name": "虹口",
                "id": "9"
              },
              {
                "name": "杨浦",
                "id": "11"
              },
              {
                "name": "闵行",
                "id": "12"
              },
              {
                "name": "宝山",
                "id": "13"
              },
              {
                "name": "嘉定",
                "id": "14"
              },
              {
                "name": "浦东新区",
                "id": "15"
              },
              {
                "name": "金山",
                "id": "16"
              },
              {
                "name": "松江",
                "id": "17"
              },
              {
                "name": "奉贤",
                "id": "26"
              },
              {
                "name": "青浦",
                "id": "29"
              },
              {
                "name": "崇明",
                "id": "30"
              }
            ]
          },
          {
            "name": "江苏",
            "id": "32",
            "City": [
              {
                "name": "南京",
                "id": "1",
                "Region": [
                  {
                    "name": "玄武区",
                    "id": "2"
                  },
                  {
                    "name": "白下区",
                    "id": "3"
                  },
                  {
                    "name": "秦淮区",
                    "id": "4"
                  },
                  {
                    "name": "建邺区",
                    "id": "5"
                  },
                  {
                    "name": "鼓楼区",
                    "id": "6"
                  },
                  {
                    "name": "下关区",
                    "id": "7"
                  },
                  {
                    "name": "浦口区",
                    "id": "11"
                  },
                  {
                    "name": "栖霞区",
                    "id": "13"
                  },
                  {
                    "name": "雨花台区",
                    "id": "14"
                  },
                  {
                    "name": "江宁区",
                    "id": "15"
                  },
                  {
                    "name": "六合区",
                    "id": "16"
                  },
                  {
                    "name": "溧水县",
                    "id": "24"
                  },
                  {
                    "name": "高淳县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "无锡",
                "id": "2",
                "Region": [
                  {
                    "name": "崇安区",
                    "id": "2"
                  },
                  {
                    "name": "南长区",
                    "id": "3"
                  },
                  {
                    "name": "北塘区",
                    "id": "4"
                  },
                  {
                    "name": "锡山区",
                    "id": "5"
                  },
                  {
                    "name": "惠山区",
                    "id": "6"
                  },
                  {
                    "name": "滨湖区",
                    "id": "11"
                  },
                  {
                    "name": "江阴市",
                    "id": "81"
                  },
                  {
                    "name": "宜兴市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "徐州",
                "id": "3",
                "Region": [
                  {
                    "name": "鼓楼区",
                    "id": "2"
                  },
                  {
                    "name": "云龙区",
                    "id": "3"
                  },
                  {
                    "name": "九里区",
                    "id": "4"
                  },
                  {
                    "name": "贾汪区",
                    "id": "5"
                  },
                  {
                    "name": "泉山区",
                    "id": "11"
                  },
                  {
                    "name": "丰　县",
                    "id": "21"
                  },
                  {
                    "name": "沛　县",
                    "id": "22"
                  },
                  {
                    "name": "铜山县",
                    "id": "23"
                  },
                  {
                    "name": "睢宁县",
                    "id": "24"
                  },
                  {
                    "name": "新沂市",
                    "id": "81"
                  },
                  {
                    "name": "邳州市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "常州",
                "id": "4",
                "Region": [
                  {
                    "name": "天宁区",
                    "id": "2"
                  },
                  {
                    "name": "钟楼区",
                    "id": "4"
                  },
                  {
                    "name": "戚墅堰区",
                    "id": "5"
                  },
                  {
                    "name": "新北区",
                    "id": "11"
                  },
                  {
                    "name": "武进区",
                    "id": "12"
                  },
                  {
                    "name": "溧阳市",
                    "id": "81"
                  },
                  {
                    "name": "金坛市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "苏州",
                "id": "5",
                "Region": [
                  {
                    "name": "姑苏区",
                    "id": "4"
                  },
                  {
                    "name": "虎丘区",
                    "id": "5"
                  },
                  {
                    "name": "吴中区",
                    "id": "6"
                  },
                  {
                    "name": "相城区",
                    "id": "7"
                  },
                  {
                    "name": "吴江区",
                    "id": "8"
                  },
                  {
                    "name": "常熟市",
                    "id": "81"
                  },
                  {
                    "name": "张家港市",
                    "id": "82"
                  },
                  {
                    "name": "昆山市",
                    "id": "83"
                  },
                  {
                    "name": "太仓市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "南通",
                "id": "6",
                "Region": [
                  {
                    "name": "崇川区",
                    "id": "2"
                  },
                  {
                    "name": "港闸区",
                    "id": "11"
                  },
                  {
                    "name": "海安县",
                    "id": "21"
                  },
                  {
                    "name": "如东县",
                    "id": "23"
                  },
                  {
                    "name": "启东市",
                    "id": "81"
                  },
                  {
                    "name": "如皋市",
                    "id": "82"
                  },
                  {
                    "name": "通州市",
                    "id": "83"
                  },
                  {
                    "name": "海门市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "连云港",
                "id": "7",
                "Region": [
                  {
                    "name": "连云区",
                    "id": "3"
                  },
                  {
                    "name": "新浦区",
                    "id": "5"
                  },
                  {
                    "name": "海州区",
                    "id": "6"
                  },
                  {
                    "name": "赣榆县",
                    "id": "21"
                  },
                  {
                    "name": "东海县",
                    "id": "22"
                  },
                  {
                    "name": "灌云县",
                    "id": "23"
                  },
                  {
                    "name": "灌南县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "淮安",
                "id": "8",
                "Region": [
                  {
                    "name": "清河区",
                    "id": "2"
                  },
                  {
                    "name": "淮安区",
                    "id": "3"
                  },
                  {
                    "name": "淮阴区",
                    "id": "4"
                  },
                  {
                    "name": "清浦区",
                    "id": "11"
                  },
                  {
                    "name": "涟水县",
                    "id": "26"
                  },
                  {
                    "name": "洪泽县",
                    "id": "29"
                  },
                  {
                    "name": "盱眙县",
                    "id": "30"
                  },
                  {
                    "name": "金湖县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "盐城",
                "id": "9",
                "Region": [
                  {
                    "name": "亭湖区",
                    "id": "2"
                  },
                  {
                    "name": "盐都区",
                    "id": "3"
                  },
                  {
                    "name": "响水县",
                    "id": "21"
                  },
                  {
                    "name": "滨海县",
                    "id": "22"
                  },
                  {
                    "name": "阜宁县",
                    "id": "23"
                  },
                  {
                    "name": "射阳县",
                    "id": "24"
                  },
                  {
                    "name": "建湖县",
                    "id": "25"
                  },
                  {
                    "name": "东台市",
                    "id": "81"
                  },
                  {
                    "name": "大丰市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "扬州",
                "id": "10",
                "Region": [
                  {
                    "name": "广陵区",
                    "id": "2"
                  },
                  {
                    "name": "邗江区",
                    "id": "3"
                  },
                  {
                    "name": "维扬区",
                    "id": "11"
                  },
                  {
                    "name": "宝应县",
                    "id": "23"
                  },
                  {
                    "name": "仪征市",
                    "id": "81"
                  },
                  {
                    "name": "高邮市",
                    "id": "84"
                  },
                  {
                    "name": "江都市",
                    "id": "88"
                  }
                ]
              },
              {
                "name": "镇江",
                "id": "11",
                "Region": [
                  {
                    "name": "京口区",
                    "id": "2"
                  },
                  {
                    "name": "润州区",
                    "id": "11"
                  },
                  {
                    "name": "丹徒区",
                    "id": "12"
                  },
                  {
                    "name": "丹阳市",
                    "id": "81"
                  },
                  {
                    "name": "扬中市",
                    "id": "82"
                  },
                  {
                    "name": "句容市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "泰州",
                "id": "12",
                "Region": [
                  {
                    "name": "海陵区",
                    "id": "2"
                  },
                  {
                    "name": "高港区",
                    "id": "3"
                  },
                  {
                    "name": "兴化市",
                    "id": "81"
                  },
                  {
                    "name": "靖江市",
                    "id": "82"
                  },
                  {
                    "name": "泰兴市",
                    "id": "83"
                  },
                  {
                    "name": "姜堰市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "宿迁",
                "id": "13",
                "Region": [
                  {
                    "name": "宿城区",
                    "id": "2"
                  },
                  {
                    "name": "宿豫区",
                    "id": "11"
                  },
                  {
                    "name": "沭阳县",
                    "id": "22"
                  },
                  {
                    "name": "泗阳县",
                    "id": "23"
                  },
                  {
                    "name": "泗洪县",
                    "id": "24"
                  }
                ]
              }
            ]
          },
          {
            "name": "浙江",
            "id": "33",
            "City": [
              {
                "name": "杭州",
                "id": "1",
                "Region": [
                  {
                    "name": "上城区",
                    "id": "2"
                  },
                  {
                    "name": "下城区",
                    "id": "3"
                  },
                  {
                    "name": "江干区",
                    "id": "4"
                  },
                  {
                    "name": "拱墅区",
                    "id": "5"
                  },
                  {
                    "name": "西湖区",
                    "id": "6"
                  },
                  {
                    "name": "滨江区",
                    "id": "8"
                  },
                  {
                    "name": "萧山区",
                    "id": "9"
                  },
                  {
                    "name": "余杭区",
                    "id": "10"
                  },
                  {
                    "name": "桐庐县",
                    "id": "22"
                  },
                  {
                    "name": "淳安县",
                    "id": "27"
                  },
                  {
                    "name": "建德市",
                    "id": "82"
                  },
                  {
                    "name": "富阳市",
                    "id": "83"
                  },
                  {
                    "name": "临安市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "宁波",
                "id": "2",
                "Region": [
                  {
                    "name": "海曙区",
                    "id": "3"
                  },
                  {
                    "name": "江东区",
                    "id": "4"
                  },
                  {
                    "name": "江北区",
                    "id": "5"
                  },
                  {
                    "name": "北仑区",
                    "id": "6"
                  },
                  {
                    "name": "镇海区",
                    "id": "11"
                  },
                  {
                    "name": "鄞州区",
                    "id": "12"
                  },
                  {
                    "name": "象山县",
                    "id": "25"
                  },
                  {
                    "name": "宁海县",
                    "id": "26"
                  },
                  {
                    "name": "余姚市",
                    "id": "81"
                  },
                  {
                    "name": "慈溪市",
                    "id": "82"
                  },
                  {
                    "name": "奉化市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "温州",
                "id": "3",
                "Region": [
                  {
                    "name": "鹿城区",
                    "id": "2"
                  },
                  {
                    "name": "龙湾区",
                    "id": "3"
                  },
                  {
                    "name": "瓯海区",
                    "id": "4"
                  },
                  {
                    "name": "洞头县",
                    "id": "22"
                  },
                  {
                    "name": "永嘉县",
                    "id": "24"
                  },
                  {
                    "name": "平阳县",
                    "id": "26"
                  },
                  {
                    "name": "苍南县",
                    "id": "27"
                  },
                  {
                    "name": "文成县",
                    "id": "28"
                  },
                  {
                    "name": "泰顺县",
                    "id": "29"
                  },
                  {
                    "name": "瑞安市",
                    "id": "81"
                  },
                  {
                    "name": "乐清市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "嘉兴",
                "id": "4",
                "Region": [
                  {
                    "name": "南湖区",
                    "id": "2"
                  },
                  {
                    "name": "秀洲区",
                    "id": "11"
                  },
                  {
                    "name": "嘉善县",
                    "id": "21"
                  },
                  {
                    "name": "海盐县",
                    "id": "24"
                  },
                  {
                    "name": "海宁市",
                    "id": "81"
                  },
                  {
                    "name": "平湖市",
                    "id": "82"
                  },
                  {
                    "name": "桐乡市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "湖州",
                "id": "5",
                "Region": [
                  {
                    "name": "吴兴区",
                    "id": "2"
                  },
                  {
                    "name": "南浔区",
                    "id": "3"
                  },
                  {
                    "name": "德清县",
                    "id": "21"
                  },
                  {
                    "name": "长兴县",
                    "id": "22"
                  },
                  {
                    "name": "安吉县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "绍兴",
                "id": "6",
                "Region": [
                  {
                    "name": "越城区",
                    "id": "2"
                  },
                  {
                    "name": "绍兴县",
                    "id": "21"
                  },
                  {
                    "name": "新昌县",
                    "id": "24"
                  },
                  {
                    "name": "诸暨市",
                    "id": "81"
                  },
                  {
                    "name": "上虞市",
                    "id": "82"
                  },
                  {
                    "name": "嵊州市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "金华",
                "id": "7",
                "Region": [
                  {
                    "name": "婺城区",
                    "id": "2"
                  },
                  {
                    "name": "金东区",
                    "id": "3"
                  },
                  {
                    "name": "武义县",
                    "id": "23"
                  },
                  {
                    "name": "浦江县",
                    "id": "26"
                  },
                  {
                    "name": "磐安县",
                    "id": "27"
                  },
                  {
                    "name": "兰溪市",
                    "id": "81"
                  },
                  {
                    "name": "义乌市",
                    "id": "82"
                  },
                  {
                    "name": "东阳市",
                    "id": "83"
                  },
                  {
                    "name": "永康市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "衢州",
                "id": "8",
                "Region": [
                  {
                    "name": "柯城区",
                    "id": "2"
                  },
                  {
                    "name": "衢江区",
                    "id": "3"
                  },
                  {
                    "name": "常山县",
                    "id": "22"
                  },
                  {
                    "name": "开化县",
                    "id": "24"
                  },
                  {
                    "name": "龙游县",
                    "id": "25"
                  },
                  {
                    "name": "江山市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "舟山",
                "id": "9",
                "Region": [
                  {
                    "name": "定海区",
                    "id": "2"
                  },
                  {
                    "name": "普陀区",
                    "id": "3"
                  },
                  {
                    "name": "岱山县",
                    "id": "21"
                  },
                  {
                    "name": "嵊泗县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "台州",
                "id": "10",
                "Region": [
                  {
                    "name": "椒江区",
                    "id": "2"
                  },
                  {
                    "name": "黄岩区",
                    "id": "3"
                  },
                  {
                    "name": "路桥区",
                    "id": "4"
                  },
                  {
                    "name": "玉环县",
                    "id": "21"
                  },
                  {
                    "name": "三门县",
                    "id": "22"
                  },
                  {
                    "name": "天台县",
                    "id": "23"
                  },
                  {
                    "name": "仙居县",
                    "id": "24"
                  },
                  {
                    "name": "温岭市",
                    "id": "81"
                  },
                  {
                    "name": "临海市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "丽水",
                "id": "11",
                "Region": [
                  {
                    "name": "莲都区",
                    "id": "2"
                  },
                  {
                    "name": "青田县",
                    "id": "21"
                  },
                  {
                    "name": "缙云县",
                    "id": "22"
                  },
                  {
                    "name": "遂昌县",
                    "id": "23"
                  },
                  {
                    "name": "松阳县",
                    "id": "24"
                  },
                  {
                    "name": "云和县",
                    "id": "25"
                  },
                  {
                    "name": "庆元县",
                    "id": "26"
                  },
                  {
                    "name": "景宁畲族自治县",
                    "id": "27"
                  },
                  {
                    "name": "龙泉市",
                    "id": "81"
                  }
                ]
              }
            ]
          },
          {
            "name": "安徽",
            "id": "34",
            "City": [
              {
                "name": "合肥",
                "id": "1",
                "Region": [
                  {
                    "name": "瑶海区",
                    "id": "2"
                  },
                  {
                    "name": "庐阳区",
                    "id": "3"
                  },
                  {
                    "name": "蜀山区",
                    "id": "4"
                  },
                  {
                    "name": "包河区",
                    "id": "11"
                  },
                  {
                    "name": "长丰县",
                    "id": "21"
                  },
                  {
                    "name": "肥东县",
                    "id": "22"
                  },
                  {
                    "name": "肥西县",
                    "id": "23"
                  },
                  {
                    "name": "庐江县",
                    "id": "24"
                  },
                  {
                    "name": "巢湖市",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "芜湖",
                "id": "2",
                "Region": [
                  {
                    "name": "镜湖区",
                    "id": "2"
                  },
                  {
                    "name": "弋江区",
                    "id": "3"
                  },
                  {
                    "name": "鸠江区",
                    "id": "7"
                  },
                  {
                    "name": "三山区",
                    "id": "8"
                  },
                  {
                    "name": "芜湖县",
                    "id": "21"
                  },
                  {
                    "name": "繁昌县",
                    "id": "22"
                  },
                  {
                    "name": "南陵县",
                    "id": "23"
                  },
                  {
                    "name": "无为县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "蚌埠",
                "id": "3",
                "Region": [
                  {
                    "name": "龙子湖区",
                    "id": "2"
                  },
                  {
                    "name": "蚌山区",
                    "id": "3"
                  },
                  {
                    "name": "禹会区",
                    "id": "4"
                  },
                  {
                    "name": "淮上区",
                    "id": "11"
                  },
                  {
                    "name": "怀远县",
                    "id": "21"
                  },
                  {
                    "name": "五河县",
                    "id": "22"
                  },
                  {
                    "name": "固镇县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "淮南",
                "id": "4",
                "Region": [
                  {
                    "name": "大通区",
                    "id": "2"
                  },
                  {
                    "name": "田家庵区",
                    "id": "3"
                  },
                  {
                    "name": "谢家集区",
                    "id": "4"
                  },
                  {
                    "name": "八公山区",
                    "id": "5"
                  },
                  {
                    "name": "潘集区",
                    "id": "6"
                  },
                  {
                    "name": "凤台县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "马鞍山",
                "id": "5",
                "Region": [
                  {
                    "name": "花山区",
                    "id": "3"
                  },
                  {
                    "name": "雨山区",
                    "id": "4"
                  },
                  {
                    "name": "博望区",
                    "id": "5"
                  },
                  {
                    "name": "当涂县",
                    "id": "21"
                  },
                  {
                    "name": "含山县",
                    "id": "22"
                  },
                  {
                    "name": "和县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "淮北",
                "id": "6",
                "Region": [
                  {
                    "name": "杜集区",
                    "id": "2"
                  },
                  {
                    "name": "相山区",
                    "id": "3"
                  },
                  {
                    "name": "烈山区",
                    "id": "4"
                  },
                  {
                    "name": "濉溪县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "铜陵",
                "id": "7",
                "Region": [
                  {
                    "name": "铜官山区",
                    "id": "2"
                  },
                  {
                    "name": "狮子山区",
                    "id": "3"
                  },
                  {
                    "name": "郊　区",
                    "id": "11"
                  },
                  {
                    "name": "铜陵县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "安庆",
                "id": "8",
                "Region": [
                  {
                    "name": "迎江区",
                    "id": "2"
                  },
                  {
                    "name": "大观区",
                    "id": "3"
                  },
                  {
                    "name": "宜秀区",
                    "id": "11"
                  },
                  {
                    "name": "怀宁县",
                    "id": "22"
                  },
                  {
                    "name": "枞阳县",
                    "id": "23"
                  },
                  {
                    "name": "潜山县",
                    "id": "24"
                  },
                  {
                    "name": "太湖县",
                    "id": "25"
                  },
                  {
                    "name": "宿松县",
                    "id": "26"
                  },
                  {
                    "name": "望江县",
                    "id": "27"
                  },
                  {
                    "name": "岳西县",
                    "id": "28"
                  },
                  {
                    "name": "桐城市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "黄山",
                "id": "10",
                "Region": [
                  {
                    "name": "屯溪区",
                    "id": "2"
                  },
                  {
                    "name": "黄山区",
                    "id": "3"
                  },
                  {
                    "name": "徽州区",
                    "id": "4"
                  },
                  {
                    "name": "歙　县",
                    "id": "21"
                  },
                  {
                    "name": "休宁县",
                    "id": "22"
                  },
                  {
                    "name": "黟　县",
                    "id": "23"
                  },
                  {
                    "name": "祁门县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "滁州",
                "id": "11",
                "Region": [
                  {
                    "name": "琅琊区",
                    "id": "2"
                  },
                  {
                    "name": "南谯区",
                    "id": "3"
                  },
                  {
                    "name": "来安县",
                    "id": "22"
                  },
                  {
                    "name": "全椒县",
                    "id": "24"
                  },
                  {
                    "name": "定远县",
                    "id": "25"
                  },
                  {
                    "name": "凤阳县",
                    "id": "26"
                  },
                  {
                    "name": "天长市",
                    "id": "81"
                  },
                  {
                    "name": "明光市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "阜阳",
                "id": "12",
                "Region": [
                  {
                    "name": "颍州区",
                    "id": "2"
                  },
                  {
                    "name": "颍东区",
                    "id": "3"
                  },
                  {
                    "name": "颍泉区",
                    "id": "4"
                  },
                  {
                    "name": "临泉县",
                    "id": "21"
                  },
                  {
                    "name": "太和县",
                    "id": "22"
                  },
                  {
                    "name": "阜南县",
                    "id": "25"
                  },
                  {
                    "name": "颍上县",
                    "id": "26"
                  },
                  {
                    "name": "界首市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "宿州",
                "id": "13",
                "Region": [
                  {
                    "name": "埇桥区",
                    "id": "2"
                  },
                  {
                    "name": "砀山县",
                    "id": "21"
                  },
                  {
                    "name": "萧　县",
                    "id": "22"
                  },
                  {
                    "name": "灵璧县",
                    "id": "23"
                  },
                  {
                    "name": "泗　县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "六安",
                "id": "15",
                "Region": [
                  {
                    "name": "金安区",
                    "id": "2"
                  },
                  {
                    "name": "裕安区",
                    "id": "3"
                  },
                  {
                    "name": "寿　县",
                    "id": "21"
                  },
                  {
                    "name": "霍邱县",
                    "id": "22"
                  },
                  {
                    "name": "舒城县",
                    "id": "23"
                  },
                  {
                    "name": "金寨县",
                    "id": "24"
                  },
                  {
                    "name": "霍山县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "亳州",
                "id": "16",
                "Region": [
                  {
                    "name": "谯城区",
                    "id": "2"
                  },
                  {
                    "name": "涡阳县",
                    "id": "21"
                  },
                  {
                    "name": "蒙城县",
                    "id": "22"
                  },
                  {
                    "name": "利辛县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "池州",
                "id": "17",
                "Region": [
                  {
                    "name": "贵池区",
                    "id": "2"
                  },
                  {
                    "name": "东至县",
                    "id": "21"
                  },
                  {
                    "name": "石台县",
                    "id": "22"
                  },
                  {
                    "name": "青阳县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "宣城",
                "id": "18",
                "Region": [
                  {
                    "name": "宣州区",
                    "id": "2"
                  },
                  {
                    "name": "郎溪县",
                    "id": "21"
                  },
                  {
                    "name": "广德县",
                    "id": "22"
                  },
                  {
                    "name": "泾　县",
                    "id": "23"
                  },
                  {
                    "name": "绩溪县",
                    "id": "24"
                  },
                  {
                    "name": "旌德县",
                    "id": "25"
                  },
                  {
                    "name": "宁国市",
                    "id": "81"
                  }
                ]
              }
            ]
          },
          {
            "name": "福建",
            "id": "35",
            "City": [
              {
                "name": "福州",
                "id": "1",
                "Region": [
                  {
                    "name": "鼓楼区",
                    "id": "2"
                  },
                  {
                    "name": "台江区",
                    "id": "3"
                  },
                  {
                    "name": "仓山区",
                    "id": "4"
                  },
                  {
                    "name": "马尾区",
                    "id": "5"
                  },
                  {
                    "name": "晋安区",
                    "id": "11"
                  },
                  {
                    "name": "闽侯县",
                    "id": "21"
                  },
                  {
                    "name": "连江县",
                    "id": "22"
                  },
                  {
                    "name": "罗源县",
                    "id": "23"
                  },
                  {
                    "name": "闽清县",
                    "id": "24"
                  },
                  {
                    "name": "永泰县",
                    "id": "25"
                  },
                  {
                    "name": "平潭县",
                    "id": "28"
                  },
                  {
                    "name": "福清市",
                    "id": "81"
                  },
                  {
                    "name": "长乐市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "厦门",
                "id": "2",
                "Region": [
                  {
                    "name": "思明区",
                    "id": "3"
                  },
                  {
                    "name": "海沧区",
                    "id": "5"
                  },
                  {
                    "name": "湖里区",
                    "id": "6"
                  },
                  {
                    "name": "集美区",
                    "id": "11"
                  },
                  {
                    "name": "同安区",
                    "id": "12"
                  },
                  {
                    "name": "翔安区",
                    "id": "13"
                  }
                ]
              },
              {
                "name": "莆田",
                "id": "3",
                "Region": [
                  {
                    "name": "城厢区",
                    "id": "2"
                  },
                  {
                    "name": "涵江区",
                    "id": "3"
                  },
                  {
                    "name": "荔城区",
                    "id": "4"
                  },
                  {
                    "name": "秀屿区",
                    "id": "5"
                  },
                  {
                    "name": "仙游县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "三明",
                "id": "4",
                "Region": [
                  {
                    "name": "梅列区",
                    "id": "2"
                  },
                  {
                    "name": "三元区",
                    "id": "3"
                  },
                  {
                    "name": "明溪县",
                    "id": "21"
                  },
                  {
                    "name": "清流县",
                    "id": "23"
                  },
                  {
                    "name": "宁化县",
                    "id": "24"
                  },
                  {
                    "name": "大田县",
                    "id": "25"
                  },
                  {
                    "name": "尤溪县",
                    "id": "26"
                  },
                  {
                    "name": "沙　县",
                    "id": "27"
                  },
                  {
                    "name": "将乐县",
                    "id": "28"
                  },
                  {
                    "name": "泰宁县",
                    "id": "29"
                  },
                  {
                    "name": "建宁县",
                    "id": "30"
                  },
                  {
                    "name": "永安市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "泉州",
                "id": "5",
                "Region": [
                  {
                    "name": "鲤城区",
                    "id": "2"
                  },
                  {
                    "name": "丰泽区",
                    "id": "3"
                  },
                  {
                    "name": "洛江区",
                    "id": "4"
                  },
                  {
                    "name": "泉港区",
                    "id": "5"
                  },
                  {
                    "name": "惠安县",
                    "id": "21"
                  },
                  {
                    "name": "安溪县",
                    "id": "24"
                  },
                  {
                    "name": "永春县",
                    "id": "25"
                  },
                  {
                    "name": "德化县",
                    "id": "26"
                  },
                  {
                    "name": "金门县",
                    "id": "27"
                  },
                  {
                    "name": "石狮市",
                    "id": "81"
                  },
                  {
                    "name": "晋江市",
                    "id": "82"
                  },
                  {
                    "name": "南安市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "漳州",
                "id": "6",
                "Region": [
                  {
                    "name": "芗城区",
                    "id": "2"
                  },
                  {
                    "name": "龙文区",
                    "id": "3"
                  },
                  {
                    "name": "云霄县",
                    "id": "22"
                  },
                  {
                    "name": "漳浦县",
                    "id": "23"
                  },
                  {
                    "name": "诏安县",
                    "id": "24"
                  },
                  {
                    "name": "长泰县",
                    "id": "25"
                  },
                  {
                    "name": "东山县",
                    "id": "26"
                  },
                  {
                    "name": "南靖县",
                    "id": "27"
                  },
                  {
                    "name": "平和县",
                    "id": "28"
                  },
                  {
                    "name": "华安县",
                    "id": "29"
                  },
                  {
                    "name": "龙海市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "南平",
                "id": "7",
                "Region": [
                  {
                    "name": "延平区",
                    "id": "2"
                  },
                  {
                    "name": "顺昌县",
                    "id": "21"
                  },
                  {
                    "name": "浦城县",
                    "id": "22"
                  },
                  {
                    "name": "光泽县",
                    "id": "23"
                  },
                  {
                    "name": "松溪县",
                    "id": "24"
                  },
                  {
                    "name": "政和县",
                    "id": "25"
                  },
                  {
                    "name": "邵武市",
                    "id": "81"
                  },
                  {
                    "name": "武夷山市",
                    "id": "82"
                  },
                  {
                    "name": "建瓯市",
                    "id": "83"
                  },
                  {
                    "name": "建阳市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "龙岩",
                "id": "8",
                "Region": [
                  {
                    "name": "新罗区",
                    "id": "2"
                  },
                  {
                    "name": "长汀县",
                    "id": "21"
                  },
                  {
                    "name": "永定县",
                    "id": "22"
                  },
                  {
                    "name": "上杭县",
                    "id": "23"
                  },
                  {
                    "name": "武平县",
                    "id": "24"
                  },
                  {
                    "name": "连城县",
                    "id": "25"
                  },
                  {
                    "name": "漳平市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "宁德",
                "id": "9",
                "Region": [
                  {
                    "name": "蕉城区",
                    "id": "2"
                  },
                  {
                    "name": "霞浦县",
                    "id": "21"
                  },
                  {
                    "name": "古田县",
                    "id": "22"
                  },
                  {
                    "name": "屏南县",
                    "id": "23"
                  },
                  {
                    "name": "寿宁县",
                    "id": "24"
                  },
                  {
                    "name": "周宁县",
                    "id": "25"
                  },
                  {
                    "name": "柘荣县",
                    "id": "26"
                  },
                  {
                    "name": "福安市",
                    "id": "81"
                  },
                  {
                    "name": "福鼎市",
                    "id": "82"
                  }
                ]
              }
            ]
          },
          {
            "name": "江西",
            "id": "36",
            "City": [
              {
                "name": "南昌",
                "id": "1",
                "Region": [
                  {
                    "name": "东湖区",
                    "id": "2"
                  },
                  {
                    "name": "西湖区",
                    "id": "3"
                  },
                  {
                    "name": "青云谱区",
                    "id": "4"
                  },
                  {
                    "name": "湾里区",
                    "id": "5"
                  },
                  {
                    "name": "青山湖区",
                    "id": "11"
                  },
                  {
                    "name": "南昌县",
                    "id": "21"
                  },
                  {
                    "name": "新建县",
                    "id": "22"
                  },
                  {
                    "name": "安义县",
                    "id": "23"
                  },
                  {
                    "name": "进贤县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "景德镇",
                "id": "2",
                "Region": [
                  {
                    "name": "昌江区",
                    "id": "2"
                  },
                  {
                    "name": "珠山区",
                    "id": "3"
                  },
                  {
                    "name": "浮梁县",
                    "id": "22"
                  },
                  {
                    "name": "乐平市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "萍乡",
                "id": "3",
                "Region": [
                  {
                    "name": "安源区",
                    "id": "2"
                  },
                  {
                    "name": "湘东区",
                    "id": "13"
                  },
                  {
                    "name": "莲花县",
                    "id": "21"
                  },
                  {
                    "name": "上栗县",
                    "id": "22"
                  },
                  {
                    "name": "芦溪县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "九江",
                "id": "4",
                "Region": [
                  {
                    "name": "庐山区",
                    "id": "2"
                  },
                  {
                    "name": "浔阳区",
                    "id": "3"
                  },
                  {
                    "name": "九江县",
                    "id": "21"
                  },
                  {
                    "name": "武宁县",
                    "id": "23"
                  },
                  {
                    "name": "修水县",
                    "id": "24"
                  },
                  {
                    "name": "永修县",
                    "id": "25"
                  },
                  {
                    "name": "德安县",
                    "id": "26"
                  },
                  {
                    "name": "星子县",
                    "id": "27"
                  },
                  {
                    "name": "都昌县",
                    "id": "28"
                  },
                  {
                    "name": "湖口县",
                    "id": "29"
                  },
                  {
                    "name": "彭泽县",
                    "id": "30"
                  },
                  {
                    "name": "瑞昌市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "新余",
                "id": "5",
                "Region": [
                  {
                    "name": "渝水区",
                    "id": "2"
                  },
                  {
                    "name": "分宜县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "鹰潭",
                "id": "6",
                "Region": [
                  {
                    "name": "月湖区",
                    "id": "2"
                  },
                  {
                    "name": "余江县",
                    "id": "22"
                  },
                  {
                    "name": "贵溪市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "赣州",
                "id": "7",
                "Region": [
                  {
                    "name": "章贡区",
                    "id": "2"
                  },
                  {
                    "name": "赣　县",
                    "id": "21"
                  },
                  {
                    "name": "信丰县",
                    "id": "22"
                  },
                  {
                    "name": "大余县",
                    "id": "23"
                  },
                  {
                    "name": "上犹县",
                    "id": "24"
                  },
                  {
                    "name": "崇义县",
                    "id": "25"
                  },
                  {
                    "name": "安远县",
                    "id": "26"
                  },
                  {
                    "name": "龙南县",
                    "id": "27"
                  },
                  {
                    "name": "定南县",
                    "id": "28"
                  },
                  {
                    "name": "全南县",
                    "id": "29"
                  },
                  {
                    "name": "宁都县",
                    "id": "30"
                  },
                  {
                    "name": "于都县",
                    "id": "31"
                  },
                  {
                    "name": "兴国县",
                    "id": "32"
                  },
                  {
                    "name": "会昌县",
                    "id": "33"
                  },
                  {
                    "name": "寻乌县",
                    "id": "34"
                  },
                  {
                    "name": "石城县",
                    "id": "35"
                  },
                  {
                    "name": "瑞金市",
                    "id": "81"
                  },
                  {
                    "name": "南康市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "吉安",
                "id": "8",
                "Region": [
                  {
                    "name": "吉州区",
                    "id": "2"
                  },
                  {
                    "name": "青原区",
                    "id": "3"
                  },
                  {
                    "name": "吉安县",
                    "id": "21"
                  },
                  {
                    "name": "吉水县",
                    "id": "22"
                  },
                  {
                    "name": "峡江县",
                    "id": "23"
                  },
                  {
                    "name": "新干县",
                    "id": "24"
                  },
                  {
                    "name": "永丰县",
                    "id": "25"
                  },
                  {
                    "name": "泰和县",
                    "id": "26"
                  },
                  {
                    "name": "遂川县",
                    "id": "27"
                  },
                  {
                    "name": "万安县",
                    "id": "28"
                  },
                  {
                    "name": "安福县",
                    "id": "29"
                  },
                  {
                    "name": "永新县",
                    "id": "30"
                  },
                  {
                    "name": "井冈山市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "宜春",
                "id": "9",
                "Region": [
                  {
                    "name": "袁州区",
                    "id": "2"
                  },
                  {
                    "name": "奉新县",
                    "id": "21"
                  },
                  {
                    "name": "万载县",
                    "id": "22"
                  },
                  {
                    "name": "上高县",
                    "id": "23"
                  },
                  {
                    "name": "宜丰县",
                    "id": "24"
                  },
                  {
                    "name": "靖安县",
                    "id": "25"
                  },
                  {
                    "name": "铜鼓县",
                    "id": "26"
                  },
                  {
                    "name": "丰城市",
                    "id": "81"
                  },
                  {
                    "name": "樟树市",
                    "id": "82"
                  },
                  {
                    "name": "高安市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "抚州",
                "id": "10",
                "Region": [
                  {
                    "name": "临川区",
                    "id": "2"
                  },
                  {
                    "name": "南城县",
                    "id": "21"
                  },
                  {
                    "name": "黎川县",
                    "id": "22"
                  },
                  {
                    "name": "南丰县",
                    "id": "23"
                  },
                  {
                    "name": "崇仁县",
                    "id": "24"
                  },
                  {
                    "name": "乐安县",
                    "id": "25"
                  },
                  {
                    "name": "宜黄县",
                    "id": "26"
                  },
                  {
                    "name": "金溪县",
                    "id": "27"
                  },
                  {
                    "name": "资溪县",
                    "id": "28"
                  },
                  {
                    "name": "东乡县",
                    "id": "29"
                  },
                  {
                    "name": "广昌县",
                    "id": "30"
                  }
                ]
              },
              {
                "name": "上饶",
                "id": "11",
                "Region": [
                  {
                    "name": "信州区",
                    "id": "2"
                  },
                  {
                    "name": "上饶县",
                    "id": "21"
                  },
                  {
                    "name": "广丰县",
                    "id": "22"
                  },
                  {
                    "name": "玉山县",
                    "id": "23"
                  },
                  {
                    "name": "铅山县",
                    "id": "24"
                  },
                  {
                    "name": "横峰县",
                    "id": "25"
                  },
                  {
                    "name": "弋阳县",
                    "id": "26"
                  },
                  {
                    "name": "余干县",
                    "id": "27"
                  },
                  {
                    "name": "鄱阳县",
                    "id": "28"
                  },
                  {
                    "name": "万年县",
                    "id": "29"
                  },
                  {
                    "name": "婺源县",
                    "id": "30"
                  },
                  {
                    "name": "德兴市",
                    "id": "81"
                  }
                ]
              }
            ]
          },
          {
            "name": "山东",
            "id": "37",
            "City": [
              {
                "name": "济南",
                "id": "1",
                "Region": [
                  {
                    "name": "历下区",
                    "id": "2"
                  },
                  {
                    "name": "市中区",
                    "id": "3"
                  },
                  {
                    "name": "槐荫区",
                    "id": "4"
                  },
                  {
                    "name": "天桥区",
                    "id": "5"
                  },
                  {
                    "name": "历城区",
                    "id": "12"
                  },
                  {
                    "name": "长清区",
                    "id": "13"
                  },
                  {
                    "name": "平阴县",
                    "id": "24"
                  },
                  {
                    "name": "济阳县",
                    "id": "25"
                  },
                  {
                    "name": "商河县",
                    "id": "26"
                  },
                  {
                    "name": "章丘市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "青岛",
                "id": "2",
                "Region": [
                  {
                    "name": "市南区",
                    "id": "2"
                  },
                  {
                    "name": "市北区",
                    "id": "3"
                  },
                  {
                    "name": "四方区",
                    "id": "5"
                  },
                  {
                    "name": "黄岛区",
                    "id": "11"
                  },
                  {
                    "name": "崂山区",
                    "id": "12"
                  },
                  {
                    "name": "李沧区",
                    "id": "13"
                  },
                  {
                    "name": "城阳区",
                    "id": "14"
                  },
                  {
                    "name": "胶州市",
                    "id": "81"
                  },
                  {
                    "name": "即墨市",
                    "id": "82"
                  },
                  {
                    "name": "平度市",
                    "id": "83"
                  },
                  {
                    "name": "胶南市",
                    "id": "84"
                  },
                  {
                    "name": "莱西市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "淄博",
                "id": "3",
                "Region": [
                  {
                    "name": "淄川区",
                    "id": "2"
                  },
                  {
                    "name": "张店区",
                    "id": "3"
                  },
                  {
                    "name": "博山区",
                    "id": "4"
                  },
                  {
                    "name": "临淄区",
                    "id": "5"
                  },
                  {
                    "name": "周村区",
                    "id": "6"
                  },
                  {
                    "name": "桓台县",
                    "id": "21"
                  },
                  {
                    "name": "高青县",
                    "id": "22"
                  },
                  {
                    "name": "沂源县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "枣庄",
                "id": "4",
                "Region": [
                  {
                    "name": "市中区",
                    "id": "2"
                  },
                  {
                    "name": "薛城区",
                    "id": "3"
                  },
                  {
                    "name": "峄城区",
                    "id": "4"
                  },
                  {
                    "name": "台儿庄区",
                    "id": "5"
                  },
                  {
                    "name": "山亭区",
                    "id": "6"
                  },
                  {
                    "name": "滕州市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "东营",
                "id": "5",
                "Region": [
                  {
                    "name": "东营区",
                    "id": "2"
                  },
                  {
                    "name": "河口区",
                    "id": "3"
                  },
                  {
                    "name": "垦利县",
                    "id": "21"
                  },
                  {
                    "name": "利津县",
                    "id": "22"
                  },
                  {
                    "name": "广饶县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "烟台",
                "id": "6",
                "Region": [
                  {
                    "name": "芝罘区",
                    "id": "2"
                  },
                  {
                    "name": "福山区",
                    "id": "11"
                  },
                  {
                    "name": "牟平区",
                    "id": "12"
                  },
                  {
                    "name": "莱山区",
                    "id": "13"
                  },
                  {
                    "name": "长岛县",
                    "id": "34"
                  },
                  {
                    "name": "龙口市",
                    "id": "81"
                  },
                  {
                    "name": "莱阳市",
                    "id": "82"
                  },
                  {
                    "name": "莱州市",
                    "id": "83"
                  },
                  {
                    "name": "蓬莱市",
                    "id": "84"
                  },
                  {
                    "name": "招远市",
                    "id": "85"
                  },
                  {
                    "name": "栖霞市",
                    "id": "86"
                  },
                  {
                    "name": "海阳市",
                    "id": "87"
                  }
                ]
              },
              {
                "name": "潍坊",
                "id": "7",
                "Region": [
                  {
                    "name": "潍城区",
                    "id": "2"
                  },
                  {
                    "name": "寒亭区",
                    "id": "3"
                  },
                  {
                    "name": "坊子区",
                    "id": "4"
                  },
                  {
                    "name": "奎文区",
                    "id": "5"
                  },
                  {
                    "name": "临朐县",
                    "id": "24"
                  },
                  {
                    "name": "昌乐县",
                    "id": "25"
                  },
                  {
                    "name": "青州市",
                    "id": "81"
                  },
                  {
                    "name": "诸城市",
                    "id": "82"
                  },
                  {
                    "name": "寿光市",
                    "id": "83"
                  },
                  {
                    "name": "安丘市",
                    "id": "84"
                  },
                  {
                    "name": "高密市",
                    "id": "85"
                  },
                  {
                    "name": "昌邑市",
                    "id": "86"
                  }
                ]
              },
              {
                "name": "济宁",
                "id": "8",
                "Region": [
                  {
                    "name": "市中区",
                    "id": "2"
                  },
                  {
                    "name": "任城区",
                    "id": "11"
                  },
                  {
                    "name": "微山县",
                    "id": "26"
                  },
                  {
                    "name": "鱼台县",
                    "id": "27"
                  },
                  {
                    "name": "金乡县",
                    "id": "28"
                  },
                  {
                    "name": "嘉祥县",
                    "id": "29"
                  },
                  {
                    "name": "汶上县",
                    "id": "30"
                  },
                  {
                    "name": "泗水县",
                    "id": "31"
                  },
                  {
                    "name": "梁山县",
                    "id": "32"
                  },
                  {
                    "name": "曲阜市",
                    "id": "81"
                  },
                  {
                    "name": "兖州市",
                    "id": "82"
                  },
                  {
                    "name": "邹城市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "泰安",
                "id": "9",
                "Region": [
                  {
                    "name": "泰山区",
                    "id": "2"
                  },
                  {
                    "name": "岱岳区",
                    "id": "11"
                  },
                  {
                    "name": "宁阳县",
                    "id": "21"
                  },
                  {
                    "name": "东平县",
                    "id": "23"
                  },
                  {
                    "name": "新泰市",
                    "id": "82"
                  },
                  {
                    "name": "肥城市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "威海",
                "id": "10",
                "Region": [
                  {
                    "name": "环翠区",
                    "id": "2"
                  },
                  {
                    "name": "文登市",
                    "id": "81"
                  },
                  {
                    "name": "荣成市",
                    "id": "82"
                  },
                  {
                    "name": "乳山市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "日照",
                "id": "11",
                "Region": [
                  {
                    "name": "东港区",
                    "id": "2"
                  },
                  {
                    "name": "岚山区",
                    "id": "3"
                  },
                  {
                    "name": "五莲县",
                    "id": "21"
                  },
                  {
                    "name": "莒　县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "莱芜",
                "id": "12",
                "Region": [
                  {
                    "name": "莱城区",
                    "id": "2"
                  },
                  {
                    "name": "钢城区",
                    "id": "3"
                  }
                ]
              },
              {
                "name": "临沂",
                "id": "13",
                "Region": [
                  {
                    "name": "兰山区",
                    "id": "2"
                  },
                  {
                    "name": "罗庄区",
                    "id": "11"
                  },
                  {
                    "name": "河东区",
                    "id": "12"
                  },
                  {
                    "name": "沂南县",
                    "id": "21"
                  },
                  {
                    "name": "郯城县",
                    "id": "22"
                  },
                  {
                    "name": "沂水县",
                    "id": "23"
                  },
                  {
                    "name": "苍山县",
                    "id": "24"
                  },
                  {
                    "name": "费　县",
                    "id": "25"
                  },
                  {
                    "name": "平邑县",
                    "id": "26"
                  },
                  {
                    "name": "莒南县",
                    "id": "27"
                  },
                  {
                    "name": "蒙阴县",
                    "id": "28"
                  },
                  {
                    "name": "临沭县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "德州",
                "id": "14",
                "Region": [
                  {
                    "name": "德城区",
                    "id": "2"
                  },
                  {
                    "name": "陵　县",
                    "id": "21"
                  },
                  {
                    "name": "宁津县",
                    "id": "22"
                  },
                  {
                    "name": "庆云县",
                    "id": "23"
                  },
                  {
                    "name": "临邑县",
                    "id": "24"
                  },
                  {
                    "name": "齐河县",
                    "id": "25"
                  },
                  {
                    "name": "平原县",
                    "id": "26"
                  },
                  {
                    "name": "夏津县",
                    "id": "27"
                  },
                  {
                    "name": "武城县",
                    "id": "28"
                  },
                  {
                    "name": "乐陵市",
                    "id": "81"
                  },
                  {
                    "name": "禹城市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "聊城",
                "id": "15",
                "Region": [
                  {
                    "name": "东昌府区",
                    "id": "2"
                  },
                  {
                    "name": "阳谷县",
                    "id": "21"
                  },
                  {
                    "name": "莘　县",
                    "id": "22"
                  },
                  {
                    "name": "茌平县",
                    "id": "23"
                  },
                  {
                    "name": "东阿县",
                    "id": "24"
                  },
                  {
                    "name": "冠　县",
                    "id": "25"
                  },
                  {
                    "name": "高唐县",
                    "id": "26"
                  },
                  {
                    "name": "临清市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "滨州",
                "id": "16",
                "Region": [
                  {
                    "name": "滨城区",
                    "id": "2"
                  },
                  {
                    "name": "惠民县",
                    "id": "21"
                  },
                  {
                    "name": "阳信县",
                    "id": "22"
                  },
                  {
                    "name": "无棣县",
                    "id": "23"
                  },
                  {
                    "name": "沾化县",
                    "id": "24"
                  },
                  {
                    "name": "博兴县",
                    "id": "25"
                  },
                  {
                    "name": "邹平县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "菏泽",
                "id": "17",
                "Region": [
                  {
                    "name": "牡丹区",
                    "id": "2"
                  },
                  {
                    "name": "曹　县",
                    "id": "21"
                  },
                  {
                    "name": "单　县",
                    "id": "22"
                  },
                  {
                    "name": "成武县",
                    "id": "23"
                  },
                  {
                    "name": "巨野县",
                    "id": "24"
                  },
                  {
                    "name": "郓城县",
                    "id": "25"
                  },
                  {
                    "name": "鄄城县",
                    "id": "26"
                  },
                  {
                    "name": "定陶县",
                    "id": "27"
                  },
                  {
                    "name": "东明县",
                    "id": "28"
                  }
                ]
              }
            ]
          },
          {
            "name": "河南",
            "id": "41",
            "City": [
              {
                "name": "郑州",
                "id": "1",
                "Region": [
                  {
                    "name": "中原区",
                    "id": "2"
                  },
                  {
                    "name": "二七区",
                    "id": "3"
                  },
                  {
                    "name": "管城回族区",
                    "id": "4"
                  },
                  {
                    "name": "金水区",
                    "id": "5"
                  },
                  {
                    "name": "上街区",
                    "id": "6"
                  },
                  {
                    "name": "惠济区",
                    "id": "8"
                  },
                  {
                    "name": "中牟县",
                    "id": "22"
                  },
                  {
                    "name": "巩义市",
                    "id": "81"
                  },
                  {
                    "name": "荥阳市",
                    "id": "82"
                  },
                  {
                    "name": "新密市",
                    "id": "83"
                  },
                  {
                    "name": "新郑市",
                    "id": "84"
                  },
                  {
                    "name": "登封市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "开封",
                "id": "2",
                "Region": [
                  {
                    "name": "龙亭区",
                    "id": "2"
                  },
                  {
                    "name": "顺河回族区",
                    "id": "3"
                  },
                  {
                    "name": "鼓楼区",
                    "id": "4"
                  },
                  {
                    "name": "禹王台区",
                    "id": "5"
                  },
                  {
                    "name": "金明区",
                    "id": "11"
                  },
                  {
                    "name": "杞　县",
                    "id": "21"
                  },
                  {
                    "name": "通许县",
                    "id": "22"
                  },
                  {
                    "name": "尉氏县",
                    "id": "23"
                  },
                  {
                    "name": "开封县",
                    "id": "24"
                  },
                  {
                    "name": "兰考县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "洛阳",
                "id": "3",
                "Region": [
                  {
                    "name": "老城区",
                    "id": "2"
                  },
                  {
                    "name": "西工区",
                    "id": "3"
                  },
                  {
                    "name": "瀍河回族区",
                    "id": "4"
                  },
                  {
                    "name": "涧西区",
                    "id": "5"
                  },
                  {
                    "name": "吉利区",
                    "id": "6"
                  },
                  {
                    "name": "洛龙区",
                    "id": "11"
                  },
                  {
                    "name": "孟津县",
                    "id": "22"
                  },
                  {
                    "name": "新安县",
                    "id": "23"
                  },
                  {
                    "name": "栾川县",
                    "id": "24"
                  },
                  {
                    "name": "嵩　县",
                    "id": "25"
                  },
                  {
                    "name": "汝阳县",
                    "id": "26"
                  },
                  {
                    "name": "宜阳县",
                    "id": "27"
                  },
                  {
                    "name": "洛宁县",
                    "id": "28"
                  },
                  {
                    "name": "伊川县",
                    "id": "29"
                  },
                  {
                    "name": "偃师市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "平顶山",
                "id": "4",
                "Region": [
                  {
                    "name": "新华区",
                    "id": "2"
                  },
                  {
                    "name": "卫东区",
                    "id": "3"
                  },
                  {
                    "name": "石龙区",
                    "id": "4"
                  },
                  {
                    "name": "湛河区",
                    "id": "11"
                  },
                  {
                    "name": "宝丰县",
                    "id": "21"
                  },
                  {
                    "name": "叶　县",
                    "id": "22"
                  },
                  {
                    "name": "鲁山县",
                    "id": "23"
                  },
                  {
                    "name": "郏　县",
                    "id": "25"
                  },
                  {
                    "name": "舞钢市",
                    "id": "81"
                  },
                  {
                    "name": "汝州市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "安阳",
                "id": "5",
                "Region": [
                  {
                    "name": "文峰区",
                    "id": "2"
                  },
                  {
                    "name": "北关区",
                    "id": "3"
                  },
                  {
                    "name": "殷都区",
                    "id": "5"
                  },
                  {
                    "name": "龙安区",
                    "id": "6"
                  },
                  {
                    "name": "安阳县",
                    "id": "22"
                  },
                  {
                    "name": "汤阴县",
                    "id": "23"
                  },
                  {
                    "name": "滑　县",
                    "id": "26"
                  },
                  {
                    "name": "内黄县",
                    "id": "27"
                  },
                  {
                    "name": "林州市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "鹤壁",
                "id": "6",
                "Region": [
                  {
                    "name": "鹤山区",
                    "id": "2"
                  },
                  {
                    "name": "山城区",
                    "id": "3"
                  },
                  {
                    "name": "淇滨区",
                    "id": "11"
                  },
                  {
                    "name": "浚　县",
                    "id": "21"
                  },
                  {
                    "name": "淇　县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "新乡",
                "id": "7",
                "Region": [
                  {
                    "name": "红旗区",
                    "id": "2"
                  },
                  {
                    "name": "卫滨区",
                    "id": "3"
                  },
                  {
                    "name": "凤泉区",
                    "id": "4"
                  },
                  {
                    "name": "牧野区",
                    "id": "11"
                  },
                  {
                    "name": "新乡县",
                    "id": "21"
                  },
                  {
                    "name": "获嘉县",
                    "id": "24"
                  },
                  {
                    "name": "原阳县",
                    "id": "25"
                  },
                  {
                    "name": "延津县",
                    "id": "26"
                  },
                  {
                    "name": "封丘县",
                    "id": "27"
                  },
                  {
                    "name": "长垣县",
                    "id": "28"
                  },
                  {
                    "name": "卫辉市",
                    "id": "81"
                  },
                  {
                    "name": "辉县市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "焦作",
                "id": "8",
                "Region": [
                  {
                    "name": "解放区",
                    "id": "2"
                  },
                  {
                    "name": "中站区",
                    "id": "3"
                  },
                  {
                    "name": "马村区",
                    "id": "4"
                  },
                  {
                    "name": "山阳区",
                    "id": "11"
                  },
                  {
                    "name": "修武县",
                    "id": "21"
                  },
                  {
                    "name": "博爱县",
                    "id": "22"
                  },
                  {
                    "name": "武陟县",
                    "id": "23"
                  },
                  {
                    "name": "温　县",
                    "id": "25"
                  },
                  {
                    "name": "沁阳市",
                    "id": "82"
                  },
                  {
                    "name": "孟州市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "濮阳",
                "id": "9",
                "Region": [
                  {
                    "name": "华龙区",
                    "id": "2"
                  },
                  {
                    "name": "清丰县",
                    "id": "22"
                  },
                  {
                    "name": "南乐县",
                    "id": "23"
                  },
                  {
                    "name": "范　县",
                    "id": "26"
                  },
                  {
                    "name": "台前县",
                    "id": "27"
                  },
                  {
                    "name": "濮阳县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "许昌",
                "id": "10",
                "Region": [
                  {
                    "name": "魏都区",
                    "id": "2"
                  },
                  {
                    "name": "许昌县",
                    "id": "23"
                  },
                  {
                    "name": "鄢陵县",
                    "id": "24"
                  },
                  {
                    "name": "襄城县",
                    "id": "25"
                  },
                  {
                    "name": "禹州市",
                    "id": "81"
                  },
                  {
                    "name": "长葛市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "漯河",
                "id": "11",
                "Region": [
                  {
                    "name": "源汇区",
                    "id": "2"
                  },
                  {
                    "name": "郾城区",
                    "id": "3"
                  },
                  {
                    "name": "召陵区",
                    "id": "4"
                  },
                  {
                    "name": "舞阳县",
                    "id": "21"
                  },
                  {
                    "name": "临颍县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "三门峡",
                "id": "12",
                "Region": [
                  {
                    "name": "湖滨区",
                    "id": "2"
                  },
                  {
                    "name": "渑池县",
                    "id": "21"
                  },
                  {
                    "name": "陕　县",
                    "id": "22"
                  },
                  {
                    "name": "卢氏县",
                    "id": "24"
                  },
                  {
                    "name": "义马市",
                    "id": "81"
                  },
                  {
                    "name": "灵宝市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "南阳",
                "id": "13",
                "Region": [
                  {
                    "name": "宛城区",
                    "id": "2"
                  },
                  {
                    "name": "卧龙区",
                    "id": "3"
                  },
                  {
                    "name": "南召县",
                    "id": "21"
                  },
                  {
                    "name": "方城县",
                    "id": "22"
                  },
                  {
                    "name": "西峡县",
                    "id": "23"
                  },
                  {
                    "name": "镇平县",
                    "id": "24"
                  },
                  {
                    "name": "内乡县",
                    "id": "25"
                  },
                  {
                    "name": "淅川县",
                    "id": "26"
                  },
                  {
                    "name": "社旗县",
                    "id": "27"
                  },
                  {
                    "name": "唐河县",
                    "id": "28"
                  },
                  {
                    "name": "新野县",
                    "id": "29"
                  },
                  {
                    "name": "桐柏县",
                    "id": "30"
                  },
                  {
                    "name": "邓州市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "商丘",
                "id": "14",
                "Region": [
                  {
                    "name": "梁园区",
                    "id": "2"
                  },
                  {
                    "name": "睢阳区",
                    "id": "3"
                  },
                  {
                    "name": "民权县",
                    "id": "21"
                  },
                  {
                    "name": "睢　县",
                    "id": "22"
                  },
                  {
                    "name": "宁陵县",
                    "id": "23"
                  },
                  {
                    "name": "柘城县",
                    "id": "24"
                  },
                  {
                    "name": "虞城县",
                    "id": "25"
                  },
                  {
                    "name": "夏邑县",
                    "id": "26"
                  },
                  {
                    "name": "永城市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "信阳",
                "id": "15",
                "Region": [
                  {
                    "name": "浉河区",
                    "id": "2"
                  },
                  {
                    "name": "平桥区",
                    "id": "3"
                  },
                  {
                    "name": "罗山县",
                    "id": "21"
                  },
                  {
                    "name": "光山县",
                    "id": "22"
                  },
                  {
                    "name": "新　县",
                    "id": "23"
                  },
                  {
                    "name": "商城县",
                    "id": "24"
                  },
                  {
                    "name": "固始县",
                    "id": "25"
                  },
                  {
                    "name": "潢川县",
                    "id": "26"
                  },
                  {
                    "name": "淮滨县",
                    "id": "27"
                  },
                  {
                    "name": "息　县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "周口",
                "id": "16",
                "Region": [
                  {
                    "name": "川汇区",
                    "id": "2"
                  },
                  {
                    "name": "扶沟县",
                    "id": "21"
                  },
                  {
                    "name": "西华县",
                    "id": "22"
                  },
                  {
                    "name": "商水县",
                    "id": "23"
                  },
                  {
                    "name": "沈丘县",
                    "id": "24"
                  },
                  {
                    "name": "郸城县",
                    "id": "25"
                  },
                  {
                    "name": "淮阳县",
                    "id": "26"
                  },
                  {
                    "name": "太康县",
                    "id": "27"
                  },
                  {
                    "name": "鹿邑县",
                    "id": "28"
                  },
                  {
                    "name": "项城市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "驻马店",
                "id": "17",
                "Region": [
                  {
                    "name": "驿城区",
                    "id": "2"
                  },
                  {
                    "name": "西平县",
                    "id": "21"
                  },
                  {
                    "name": "上蔡县",
                    "id": "22"
                  },
                  {
                    "name": "平舆县",
                    "id": "23"
                  },
                  {
                    "name": "正阳县",
                    "id": "24"
                  },
                  {
                    "name": "确山县",
                    "id": "25"
                  },
                  {
                    "name": "泌阳县",
                    "id": "26"
                  },
                  {
                    "name": "汝南县",
                    "id": "27"
                  },
                  {
                    "name": "遂平县",
                    "id": "28"
                  },
                  {
                    "name": "新蔡县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "济源",
                "id": "18"
              }
            ]
          },
          {
            "name": "湖北",
            "id": "42",
            "City": [
              {
                "name": "武汉",
                "id": "1",
                "Region": [
                  {
                    "name": "江岸区",
                    "id": "2"
                  },
                  {
                    "name": "江汉区",
                    "id": "3"
                  },
                  {
                    "name": "硚口区",
                    "id": "4"
                  },
                  {
                    "name": "汉阳区",
                    "id": "5"
                  },
                  {
                    "name": "武昌区",
                    "id": "6"
                  },
                  {
                    "name": "青山区",
                    "id": "7"
                  },
                  {
                    "name": "洪山区",
                    "id": "11"
                  },
                  {
                    "name": "东西湖区",
                    "id": "12"
                  },
                  {
                    "name": "汉南区",
                    "id": "13"
                  },
                  {
                    "name": "蔡甸区",
                    "id": "14"
                  },
                  {
                    "name": "江夏区",
                    "id": "15"
                  },
                  {
                    "name": "黄陂区",
                    "id": "16"
                  },
                  {
                    "name": "新洲区",
                    "id": "17"
                  }
                ]
              },
              {
                "name": "黄石",
                "id": "2",
                "Region": [
                  {
                    "name": "黄石港区",
                    "id": "2"
                  },
                  {
                    "name": "西塞山区",
                    "id": "3"
                  },
                  {
                    "name": "下陆区",
                    "id": "4"
                  },
                  {
                    "name": "铁山区",
                    "id": "5"
                  },
                  {
                    "name": "阳新县",
                    "id": "22"
                  },
                  {
                    "name": "大冶市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "十堰",
                "id": "3",
                "Region": [
                  {
                    "name": "茅箭区",
                    "id": "2"
                  },
                  {
                    "name": "张湾区",
                    "id": "3"
                  },
                  {
                    "name": "郧　县",
                    "id": "21"
                  },
                  {
                    "name": "郧西县",
                    "id": "22"
                  },
                  {
                    "name": "竹山县",
                    "id": "23"
                  },
                  {
                    "name": "竹溪县",
                    "id": "24"
                  },
                  {
                    "name": "房　县",
                    "id": "25"
                  },
                  {
                    "name": "丹江口市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "宜昌",
                "id": "5",
                "Region": [
                  {
                    "name": "西陵区",
                    "id": "2"
                  },
                  {
                    "name": "伍家岗区",
                    "id": "3"
                  },
                  {
                    "name": "点军区",
                    "id": "4"
                  },
                  {
                    "name": "猇亭区",
                    "id": "5"
                  },
                  {
                    "name": "夷陵区",
                    "id": "6"
                  },
                  {
                    "name": "远安县",
                    "id": "25"
                  },
                  {
                    "name": "兴山县",
                    "id": "26"
                  },
                  {
                    "name": "秭归县",
                    "id": "27"
                  },
                  {
                    "name": "长阳土家族自治县",
                    "id": "28"
                  },
                  {
                    "name": "五峰土家族自治县",
                    "id": "29"
                  },
                  {
                    "name": "宜都市",
                    "id": "81"
                  },
                  {
                    "name": "当阳市",
                    "id": "82"
                  },
                  {
                    "name": "枝江市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "襄阳",
                "id": "6",
                "Region": [
                  {
                    "name": "襄城区",
                    "id": "2"
                  },
                  {
                    "name": "樊城区",
                    "id": "6"
                  },
                  {
                    "name": "襄州区",
                    "id": "7"
                  },
                  {
                    "name": "南漳县",
                    "id": "24"
                  },
                  {
                    "name": "谷城县",
                    "id": "25"
                  },
                  {
                    "name": "保康县",
                    "id": "26"
                  },
                  {
                    "name": "老河口市",
                    "id": "82"
                  },
                  {
                    "name": "枣阳市",
                    "id": "83"
                  },
                  {
                    "name": "宜城市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "鄂州",
                "id": "7",
                "Region": [
                  {
                    "name": "梁子湖区",
                    "id": "2"
                  },
                  {
                    "name": "华容区",
                    "id": "3"
                  },
                  {
                    "name": "鄂城区",
                    "id": "4"
                  }
                ]
              },
              {
                "name": "荆门",
                "id": "8",
                "Region": [
                  {
                    "name": "东宝区",
                    "id": "2"
                  },
                  {
                    "name": "掇刀区",
                    "id": "4"
                  },
                  {
                    "name": "京山县",
                    "id": "21"
                  },
                  {
                    "name": "沙洋县",
                    "id": "22"
                  },
                  {
                    "name": "钟祥市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "孝感",
                "id": "9",
                "Region": [
                  {
                    "name": "孝南区",
                    "id": "2"
                  },
                  {
                    "name": "孝昌县",
                    "id": "21"
                  },
                  {
                    "name": "大悟县",
                    "id": "22"
                  },
                  {
                    "name": "云梦县",
                    "id": "23"
                  },
                  {
                    "name": "应城市",
                    "id": "81"
                  },
                  {
                    "name": "安陆市",
                    "id": "82"
                  },
                  {
                    "name": "汉川市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "荆州",
                "id": "10",
                "Region": [
                  {
                    "name": "沙市区",
                    "id": "2"
                  },
                  {
                    "name": "荆州区",
                    "id": "3"
                  },
                  {
                    "name": "公安县",
                    "id": "22"
                  },
                  {
                    "name": "监利县",
                    "id": "23"
                  },
                  {
                    "name": "江陵县",
                    "id": "24"
                  },
                  {
                    "name": "石首市",
                    "id": "81"
                  },
                  {
                    "name": "洪湖市",
                    "id": "83"
                  },
                  {
                    "name": "松滋市",
                    "id": "87"
                  }
                ]
              },
              {
                "name": "黄冈",
                "id": "11",
                "Region": [
                  {
                    "name": "黄州区",
                    "id": "2"
                  },
                  {
                    "name": "团风县",
                    "id": "21"
                  },
                  {
                    "name": "红安县",
                    "id": "22"
                  },
                  {
                    "name": "罗田县",
                    "id": "23"
                  },
                  {
                    "name": "英山县",
                    "id": "24"
                  },
                  {
                    "name": "浠水县",
                    "id": "25"
                  },
                  {
                    "name": "蕲春县",
                    "id": "26"
                  },
                  {
                    "name": "黄梅县",
                    "id": "27"
                  },
                  {
                    "name": "麻城市",
                    "id": "81"
                  },
                  {
                    "name": "武穴市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "咸宁",
                "id": "12",
                "Region": [
                  {
                    "name": "咸安区",
                    "id": "2"
                  },
                  {
                    "name": "嘉鱼县",
                    "id": "21"
                  },
                  {
                    "name": "通城县",
                    "id": "22"
                  },
                  {
                    "name": "崇阳县",
                    "id": "23"
                  },
                  {
                    "name": "通山县",
                    "id": "24"
                  },
                  {
                    "name": "赤壁市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "随州",
                "id": "13",
                "Region": [
                  {
                    "name": "曾都区",
                    "id": "2"
                  },
                  {
                    "name": "随县",
                    "id": "21"
                  },
                  {
                    "name": "广水市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "恩施",
                "id": "28",
                "Region": [
                  {
                    "name": "恩施市",
                    "id": "1"
                  },
                  {
                    "name": "利川市",
                    "id": "2"
                  },
                  {
                    "name": "建始县",
                    "id": "22"
                  },
                  {
                    "name": "巴东县",
                    "id": "23"
                  },
                  {
                    "name": "宣恩县",
                    "id": "25"
                  },
                  {
                    "name": "咸丰县",
                    "id": "26"
                  },
                  {
                    "name": "来凤县",
                    "id": "27"
                  },
                  {
                    "name": "鹤峰县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "仙桃",
                "id": "94"
              },
              {
                "name": "潜江",
                "id": "95"
              },
              {
                "name": "天门",
                "id": "96"
              },
              {
                "name": "神农架",
                "id": "A21"
              }
            ]
          },
          {
            "name": "湖南",
            "id": "43",
            "City": [
              {
                "name": "长沙",
                "id": "1",
                "Region": [
                  {
                    "name": "芙蓉区",
                    "id": "2"
                  },
                  {
                    "name": "天心区",
                    "id": "3"
                  },
                  {
                    "name": "岳麓区",
                    "id": "4"
                  },
                  {
                    "name": "开福区",
                    "id": "5"
                  },
                  {
                    "name": "雨花区",
                    "id": "11"
                  },
                  {
                    "name": "长沙县",
                    "id": "21"
                  },
                  {
                    "name": "望城区",
                    "id": "22"
                  },
                  {
                    "name": "宁乡县",
                    "id": "24"
                  },
                  {
                    "name": "浏阳市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "株洲",
                "id": "2",
                "Region": [
                  {
                    "name": "荷塘区",
                    "id": "2"
                  },
                  {
                    "name": "芦淞区",
                    "id": "3"
                  },
                  {
                    "name": "石峰区",
                    "id": "4"
                  },
                  {
                    "name": "天元区",
                    "id": "11"
                  },
                  {
                    "name": "株洲县",
                    "id": "21"
                  },
                  {
                    "name": "攸　县",
                    "id": "23"
                  },
                  {
                    "name": "茶陵县",
                    "id": "24"
                  },
                  {
                    "name": "炎陵县",
                    "id": "25"
                  },
                  {
                    "name": "醴陵市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "湘潭",
                "id": "3",
                "Region": [
                  {
                    "name": "雨湖区",
                    "id": "2"
                  },
                  {
                    "name": "岳塘区",
                    "id": "4"
                  },
                  {
                    "name": "湘潭县",
                    "id": "21"
                  },
                  {
                    "name": "湘乡市",
                    "id": "81"
                  },
                  {
                    "name": "韶山市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "衡阳",
                "id": "4",
                "Region": [
                  {
                    "name": "珠晖区",
                    "id": "5"
                  },
                  {
                    "name": "雁峰区",
                    "id": "6"
                  },
                  {
                    "name": "石鼓区",
                    "id": "7"
                  },
                  {
                    "name": "蒸湘区",
                    "id": "8"
                  },
                  {
                    "name": "南岳区",
                    "id": "12"
                  },
                  {
                    "name": "衡阳县",
                    "id": "21"
                  },
                  {
                    "name": "衡南县",
                    "id": "22"
                  },
                  {
                    "name": "衡山县",
                    "id": "23"
                  },
                  {
                    "name": "衡东县",
                    "id": "24"
                  },
                  {
                    "name": "祁东县",
                    "id": "26"
                  },
                  {
                    "name": "耒阳市",
                    "id": "81"
                  },
                  {
                    "name": "常宁市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "邵阳",
                "id": "5",
                "Region": [
                  {
                    "name": "双清区",
                    "id": "2"
                  },
                  {
                    "name": "大祥区",
                    "id": "3"
                  },
                  {
                    "name": "北塔区",
                    "id": "11"
                  },
                  {
                    "name": "邵东县",
                    "id": "21"
                  },
                  {
                    "name": "新邵县",
                    "id": "22"
                  },
                  {
                    "name": "邵阳县",
                    "id": "23"
                  },
                  {
                    "name": "隆回县",
                    "id": "24"
                  },
                  {
                    "name": "洞口县",
                    "id": "25"
                  },
                  {
                    "name": "绥宁县",
                    "id": "27"
                  },
                  {
                    "name": "新宁县",
                    "id": "28"
                  },
                  {
                    "name": "城步苗族自治县",
                    "id": "29"
                  },
                  {
                    "name": "武冈市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "岳阳",
                "id": "6",
                "Region": [
                  {
                    "name": "岳阳楼区",
                    "id": "2"
                  },
                  {
                    "name": "云溪区",
                    "id": "3"
                  },
                  {
                    "name": "君山区",
                    "id": "11"
                  },
                  {
                    "name": "岳阳县",
                    "id": "21"
                  },
                  {
                    "name": "华容县",
                    "id": "23"
                  },
                  {
                    "name": "湘阴县",
                    "id": "24"
                  },
                  {
                    "name": "平江县",
                    "id": "26"
                  },
                  {
                    "name": "汨罗市",
                    "id": "81"
                  },
                  {
                    "name": "临湘市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "常德",
                "id": "7",
                "Region": [
                  {
                    "name": "武陵区",
                    "id": "2"
                  },
                  {
                    "name": "鼎城区",
                    "id": "3"
                  },
                  {
                    "name": "安乡县",
                    "id": "21"
                  },
                  {
                    "name": "汉寿县",
                    "id": "22"
                  },
                  {
                    "name": "澧　县",
                    "id": "23"
                  },
                  {
                    "name": "临澧县",
                    "id": "24"
                  },
                  {
                    "name": "桃源县",
                    "id": "25"
                  },
                  {
                    "name": "石门县",
                    "id": "26"
                  },
                  {
                    "name": "津市市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "张家界",
                "id": "8",
                "Region": [
                  {
                    "name": "永定区",
                    "id": "2"
                  },
                  {
                    "name": "武陵源区",
                    "id": "11"
                  },
                  {
                    "name": "慈利县",
                    "id": "21"
                  },
                  {
                    "name": "桑植县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "益阳",
                "id": "9",
                "Region": [
                  {
                    "name": "资阳区",
                    "id": "2"
                  },
                  {
                    "name": "赫山区",
                    "id": "3"
                  },
                  {
                    "name": "南　县",
                    "id": "21"
                  },
                  {
                    "name": "桃江县",
                    "id": "22"
                  },
                  {
                    "name": "安化县",
                    "id": "23"
                  },
                  {
                    "name": "沅江市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "郴州",
                "id": "10",
                "Region": [
                  {
                    "name": "北湖区",
                    "id": "2"
                  },
                  {
                    "name": "苏仙区",
                    "id": "3"
                  },
                  {
                    "name": "桂阳县",
                    "id": "21"
                  },
                  {
                    "name": "宜章县",
                    "id": "22"
                  },
                  {
                    "name": "永兴县",
                    "id": "23"
                  },
                  {
                    "name": "嘉禾县",
                    "id": "24"
                  },
                  {
                    "name": "临武县",
                    "id": "25"
                  },
                  {
                    "name": "汝城县",
                    "id": "26"
                  },
                  {
                    "name": "桂东县",
                    "id": "27"
                  },
                  {
                    "name": "安仁县",
                    "id": "28"
                  },
                  {
                    "name": "资兴市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "永州",
                "id": "11",
                "Region": [
                  {
                    "name": "零陵区",
                    "id": "2"
                  },
                  {
                    "name": "冷水滩区",
                    "id": "3"
                  },
                  {
                    "name": "祁阳县",
                    "id": "21"
                  },
                  {
                    "name": "东安县",
                    "id": "22"
                  },
                  {
                    "name": "双牌县",
                    "id": "23"
                  },
                  {
                    "name": "道　县",
                    "id": "24"
                  },
                  {
                    "name": "江永县",
                    "id": "25"
                  },
                  {
                    "name": "宁远县",
                    "id": "26"
                  },
                  {
                    "name": "蓝山县",
                    "id": "27"
                  },
                  {
                    "name": "新田县",
                    "id": "28"
                  },
                  {
                    "name": "江华瑶族自治县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "怀化",
                "id": "12",
                "Region": [
                  {
                    "name": "鹤城区",
                    "id": "2"
                  },
                  {
                    "name": "中方县",
                    "id": "21"
                  },
                  {
                    "name": "沅陵县",
                    "id": "22"
                  },
                  {
                    "name": "辰溪县",
                    "id": "23"
                  },
                  {
                    "name": "溆浦县",
                    "id": "24"
                  },
                  {
                    "name": "会同县",
                    "id": "25"
                  },
                  {
                    "name": "麻阳苗族自治县",
                    "id": "26"
                  },
                  {
                    "name": "新晃侗族自治县",
                    "id": "27"
                  },
                  {
                    "name": "芷江侗族自治县",
                    "id": "28"
                  },
                  {
                    "name": "靖州苗族侗族自治县",
                    "id": "29"
                  },
                  {
                    "name": "通道侗族自治县",
                    "id": "30"
                  },
                  {
                    "name": "洪江市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "娄底",
                "id": "13",
                "Region": [
                  {
                    "name": "娄星区",
                    "id": "2"
                  },
                  {
                    "name": "双峰县",
                    "id": "21"
                  },
                  {
                    "name": "新化县",
                    "id": "22"
                  },
                  {
                    "name": "冷水江市",
                    "id": "81"
                  },
                  {
                    "name": "涟源市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "湘西",
                "id": "31",
                "Region": [
                  {
                    "name": "吉首市",
                    "id": "1"
                  },
                  {
                    "name": "泸溪县",
                    "id": "22"
                  },
                  {
                    "name": "凤凰县",
                    "id": "23"
                  },
                  {
                    "name": "花垣县",
                    "id": "24"
                  },
                  {
                    "name": "保靖县",
                    "id": "25"
                  },
                  {
                    "name": "古丈县",
                    "id": "26"
                  },
                  {
                    "name": "永顺县",
                    "id": "27"
                  },
                  {
                    "name": "龙山县",
                    "id": "30"
                  }
                ]
              }
            ]
          },
          {
            "name": "广东",
            "id": "44",
            "City": [
              {
                "name": "广州",
                "id": "1",
                "Region": [
                  {
                    "name": "荔湾区",
                    "id": "3"
                  },
                  {
                    "name": "越秀区",
                    "id": "4"
                  },
                  {
                    "name": "海珠区",
                    "id": "5"
                  },
                  {
                    "name": "天河区",
                    "id": "6"
                  },
                  {
                    "name": "白云区",
                    "id": "11"
                  },
                  {
                    "name": "黄埔区",
                    "id": "12"
                  },
                  {
                    "name": "番禺区",
                    "id": "13"
                  },
                  {
                    "name": "花都区",
                    "id": "14"
                  },
                  {
                    "name": "南沙区",
                    "id": "15"
                  },
                  {
                    "name": "萝岗区",
                    "id": "16"
                  },
                  {
                    "name": "增城市",
                    "id": "83"
                  },
                  {
                    "name": "从化市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "韶关",
                "id": "2",
                "Region": [
                  {
                    "name": "武江区",
                    "id": "3"
                  },
                  {
                    "name": "浈江区",
                    "id": "4"
                  },
                  {
                    "name": "曲江区",
                    "id": "5"
                  },
                  {
                    "name": "始兴县",
                    "id": "22"
                  },
                  {
                    "name": "仁化县",
                    "id": "24"
                  },
                  {
                    "name": "翁源县",
                    "id": "29"
                  },
                  {
                    "name": "乳源瑶族自治县",
                    "id": "32"
                  },
                  {
                    "name": "新丰县",
                    "id": "33"
                  },
                  {
                    "name": "乐昌市",
                    "id": "81"
                  },
                  {
                    "name": "南雄市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "深圳",
                "id": "3",
                "Region": [
                  {
                    "name": "罗湖区",
                    "id": "3"
                  },
                  {
                    "name": "福田区",
                    "id": "4"
                  },
                  {
                    "name": "南山区",
                    "id": "5"
                  },
                  {
                    "name": "宝安区",
                    "id": "6"
                  },
                  {
                    "name": "龙岗区",
                    "id": "7"
                  },
                  {
                    "name": "盐田区",
                    "id": "8"
                  }
                ]
              },
              {
                "name": "珠海",
                "id": "4",
                "Region": [
                  {
                    "name": "香洲区",
                    "id": "2"
                  },
                  {
                    "name": "斗门区",
                    "id": "3"
                  },
                  {
                    "name": "金湾区",
                    "id": "4"
                  }
                ]
              },
              {
                "name": "汕头",
                "id": "5",
                "Region": [
                  {
                    "name": "龙湖区",
                    "id": "7"
                  },
                  {
                    "name": "金平区",
                    "id": "11"
                  },
                  {
                    "name": "濠江区",
                    "id": "12"
                  },
                  {
                    "name": "潮阳区",
                    "id": "13"
                  },
                  {
                    "name": "潮南区",
                    "id": "14"
                  },
                  {
                    "name": "澄海区",
                    "id": "15"
                  },
                  {
                    "name": "南澳县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "佛山",
                "id": "6",
                "Region": [
                  {
                    "name": "禅城区",
                    "id": "4"
                  },
                  {
                    "name": "南海区",
                    "id": "5"
                  },
                  {
                    "name": "顺德区",
                    "id": "6"
                  },
                  {
                    "name": "三水区",
                    "id": "7"
                  },
                  {
                    "name": "高明区",
                    "id": "8"
                  }
                ]
              },
              {
                "name": "江门",
                "id": "7",
                "Region": [
                  {
                    "name": "蓬江区",
                    "id": "3"
                  },
                  {
                    "name": "江海区",
                    "id": "4"
                  },
                  {
                    "name": "新会区",
                    "id": "5"
                  },
                  {
                    "name": "台山市",
                    "id": "81"
                  },
                  {
                    "name": "开平市",
                    "id": "83"
                  },
                  {
                    "name": "鹤山市",
                    "id": "84"
                  },
                  {
                    "name": "恩平市",
                    "id": "85"
                  }
                ]
              },
              {
                "name": "湛江",
                "id": "8",
                "Region": [
                  {
                    "name": "赤坎区",
                    "id": "2"
                  },
                  {
                    "name": "霞山区",
                    "id": "3"
                  },
                  {
                    "name": "坡头区",
                    "id": "4"
                  },
                  {
                    "name": "麻章区",
                    "id": "11"
                  },
                  {
                    "name": "遂溪县",
                    "id": "23"
                  },
                  {
                    "name": "徐闻县",
                    "id": "25"
                  },
                  {
                    "name": "廉江市",
                    "id": "81"
                  },
                  {
                    "name": "雷州市",
                    "id": "82"
                  },
                  {
                    "name": "吴川市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "茂名",
                "id": "9",
                "Region": [
                  {
                    "name": "茂南区",
                    "id": "2"
                  },
                  {
                    "name": "茂港区",
                    "id": "3"
                  },
                  {
                    "name": "电白县",
                    "id": "23"
                  },
                  {
                    "name": "高州市",
                    "id": "81"
                  },
                  {
                    "name": "化州市",
                    "id": "82"
                  },
                  {
                    "name": "信宜市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "肇庆",
                "id": "12",
                "Region": [
                  {
                    "name": "端州区",
                    "id": "2"
                  },
                  {
                    "name": "鼎湖区",
                    "id": "3"
                  },
                  {
                    "name": "广宁县",
                    "id": "23"
                  },
                  {
                    "name": "怀集县",
                    "id": "24"
                  },
                  {
                    "name": "封开县",
                    "id": "25"
                  },
                  {
                    "name": "德庆县",
                    "id": "26"
                  },
                  {
                    "name": "高要市",
                    "id": "83"
                  },
                  {
                    "name": "四会市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "惠州",
                "id": "13",
                "Region": [
                  {
                    "name": "惠城区",
                    "id": "2"
                  },
                  {
                    "name": "惠阳区",
                    "id": "3"
                  },
                  {
                    "name": "博罗县",
                    "id": "22"
                  },
                  {
                    "name": "惠东县",
                    "id": "23"
                  },
                  {
                    "name": "龙门县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "梅州",
                "id": "14",
                "Region": [
                  {
                    "name": "梅江区",
                    "id": "2"
                  },
                  {
                    "name": "梅　县",
                    "id": "21"
                  },
                  {
                    "name": "大埔县",
                    "id": "22"
                  },
                  {
                    "name": "丰顺县",
                    "id": "23"
                  },
                  {
                    "name": "五华县",
                    "id": "24"
                  },
                  {
                    "name": "平远县",
                    "id": "26"
                  },
                  {
                    "name": "蕉岭县",
                    "id": "27"
                  },
                  {
                    "name": "兴宁市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "汕尾",
                "id": "15",
                "Region": [
                  {
                    "name": "城　区",
                    "id": "2"
                  },
                  {
                    "name": "海丰县",
                    "id": "21"
                  },
                  {
                    "name": "陆河县",
                    "id": "23"
                  },
                  {
                    "name": "陆丰市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "河源",
                "id": "16",
                "Region": [
                  {
                    "name": "源城区",
                    "id": "2"
                  },
                  {
                    "name": "紫金县",
                    "id": "21"
                  },
                  {
                    "name": "龙川县",
                    "id": "22"
                  },
                  {
                    "name": "连平县",
                    "id": "23"
                  },
                  {
                    "name": "和平县",
                    "id": "24"
                  },
                  {
                    "name": "东源县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "阳江",
                "id": "17",
                "Region": [
                  {
                    "name": "江城区",
                    "id": "2"
                  },
                  {
                    "name": "阳西县",
                    "id": "21"
                  },
                  {
                    "name": "阳东县",
                    "id": "23"
                  },
                  {
                    "name": "阳春市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "清远",
                "id": "18",
                "Region": [
                  {
                    "name": "清城区",
                    "id": "2"
                  },
                  {
                    "name": "佛冈县",
                    "id": "21"
                  },
                  {
                    "name": "阳山县",
                    "id": "23"
                  },
                  {
                    "name": "连山壮族瑶族自治县",
                    "id": "25"
                  },
                  {
                    "name": "连南瑶族自治县",
                    "id": "26"
                  },
                  {
                    "name": "清新县",
                    "id": "27"
                  },
                  {
                    "name": "英德市",
                    "id": "81"
                  },
                  {
                    "name": "连州市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "东莞",
                "id": "19",
                "Region": {
                  "name": "东莞市",
                  "id": "0"
                }
              },
              {
                "name": "中山",
                "id": "20",
                "Region": {
                  "name": "中山市",
                  "id": "0"
                }
              },
              {
                "name": "潮州",
                "id": "51",
                "Region": [
                  {
                    "name": "湘桥区",
                    "id": "2"
                  },
                  {
                    "name": "潮安县",
                    "id": "21"
                  },
                  {
                    "name": "饶平县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "揭阳",
                "id": "52",
                "Region": [
                  {
                    "name": "榕城区",
                    "id": "2"
                  },
                  {
                    "name": "揭东县",
                    "id": "21"
                  },
                  {
                    "name": "揭西县",
                    "id": "22"
                  },
                  {
                    "name": "惠来县",
                    "id": "24"
                  },
                  {
                    "name": "普宁市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "云浮",
                "id": "53",
                "Region": [
                  {
                    "name": "云城区",
                    "id": "2"
                  },
                  {
                    "name": "新兴县",
                    "id": "21"
                  },
                  {
                    "name": "郁南县",
                    "id": "22"
                  },
                  {
                    "name": "云安县",
                    "id": "23"
                  },
                  {
                    "name": "罗定市",
                    "id": "81"
                  }
                ]
              }
            ]
          },
          {
            "name": "广西",
            "id": "45",
            "City": [
              {
                "name": "南宁",
                "id": "1",
                "Region": [
                  {
                    "name": "兴宁区",
                    "id": "2"
                  },
                  {
                    "name": "青秀区",
                    "id": "3"
                  },
                  {
                    "name": "江南区",
                    "id": "5"
                  },
                  {
                    "name": "西乡塘区",
                    "id": "7"
                  },
                  {
                    "name": "良庆区",
                    "id": "8"
                  },
                  {
                    "name": "邕宁区",
                    "id": "9"
                  },
                  {
                    "name": "武鸣县",
                    "id": "22"
                  },
                  {
                    "name": "隆安县",
                    "id": "23"
                  },
                  {
                    "name": "马山县",
                    "id": "24"
                  },
                  {
                    "name": "上林县",
                    "id": "25"
                  },
                  {
                    "name": "宾阳县",
                    "id": "26"
                  },
                  {
                    "name": "横　县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "柳州",
                "id": "2",
                "Region": [
                  {
                    "name": "城中区",
                    "id": "2"
                  },
                  {
                    "name": "鱼峰区",
                    "id": "3"
                  },
                  {
                    "name": "柳南区",
                    "id": "4"
                  },
                  {
                    "name": "柳北区",
                    "id": "5"
                  },
                  {
                    "name": "柳江县",
                    "id": "21"
                  },
                  {
                    "name": "柳城县",
                    "id": "22"
                  },
                  {
                    "name": "鹿寨县",
                    "id": "23"
                  },
                  {
                    "name": "融安县",
                    "id": "24"
                  },
                  {
                    "name": "融水苗族自治县",
                    "id": "25"
                  },
                  {
                    "name": "三江侗族自治县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "桂林",
                "id": "3",
                "Region": [
                  {
                    "name": "秀峰区",
                    "id": "2"
                  },
                  {
                    "name": "叠彩区",
                    "id": "3"
                  },
                  {
                    "name": "象山区",
                    "id": "4"
                  },
                  {
                    "name": "七星区",
                    "id": "5"
                  },
                  {
                    "name": "雁山区",
                    "id": "11"
                  },
                  {
                    "name": "阳朔县",
                    "id": "21"
                  },
                  {
                    "name": "临桂县",
                    "id": "22"
                  },
                  {
                    "name": "灵川县",
                    "id": "23"
                  },
                  {
                    "name": "全州县",
                    "id": "24"
                  },
                  {
                    "name": "兴安县",
                    "id": "25"
                  },
                  {
                    "name": "永福县",
                    "id": "26"
                  },
                  {
                    "name": "灌阳县",
                    "id": "27"
                  },
                  {
                    "name": "龙胜各族自治县",
                    "id": "28"
                  },
                  {
                    "name": "资源县",
                    "id": "29"
                  },
                  {
                    "name": "平乐县",
                    "id": "30"
                  },
                  {
                    "name": "荔浦县",
                    "id": "31"
                  },
                  {
                    "name": "恭城瑶族自治县",
                    "id": "32"
                  }
                ]
              },
              {
                "name": "梧州",
                "id": "4",
                "Region": [
                  {
                    "name": "万秀区",
                    "id": "3"
                  },
                  {
                    "name": "蝶山区",
                    "id": "4"
                  },
                  {
                    "name": "长洲区",
                    "id": "5"
                  },
                  {
                    "name": "苍梧县",
                    "id": "21"
                  },
                  {
                    "name": "藤　县",
                    "id": "22"
                  },
                  {
                    "name": "蒙山县",
                    "id": "23"
                  },
                  {
                    "name": "岑溪市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "北海",
                "id": "5",
                "Region": [
                  {
                    "name": "海城区",
                    "id": "2"
                  },
                  {
                    "name": "银海区",
                    "id": "3"
                  },
                  {
                    "name": "铁山港区",
                    "id": "12"
                  },
                  {
                    "name": "合浦县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "防城港",
                "id": "6",
                "Region": [
                  {
                    "name": "港口区",
                    "id": "2"
                  },
                  {
                    "name": "防城区",
                    "id": "3"
                  },
                  {
                    "name": "上思县",
                    "id": "21"
                  },
                  {
                    "name": "东兴市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "钦州",
                "id": "7",
                "Region": [
                  {
                    "name": "钦南区",
                    "id": "2"
                  },
                  {
                    "name": "钦北区",
                    "id": "3"
                  },
                  {
                    "name": "灵山县",
                    "id": "21"
                  },
                  {
                    "name": "浦北县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "贵港",
                "id": "8",
                "Region": [
                  {
                    "name": "港北区",
                    "id": "2"
                  },
                  {
                    "name": "港南区",
                    "id": "3"
                  },
                  {
                    "name": "覃塘区",
                    "id": "4"
                  },
                  {
                    "name": "平南县",
                    "id": "21"
                  },
                  {
                    "name": "桂平市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "玉林",
                "id": "9",
                "Region": [
                  {
                    "name": "玉州区",
                    "id": "2"
                  },
                  {
                    "name": "容　县",
                    "id": "21"
                  },
                  {
                    "name": "陆川县",
                    "id": "22"
                  },
                  {
                    "name": "博白县",
                    "id": "23"
                  },
                  {
                    "name": "兴业县",
                    "id": "24"
                  },
                  {
                    "name": "北流市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "百色",
                "id": "10",
                "Region": [
                  {
                    "name": "右江区",
                    "id": "2"
                  },
                  {
                    "name": "田阳县",
                    "id": "21"
                  },
                  {
                    "name": "田东县",
                    "id": "22"
                  },
                  {
                    "name": "平果县",
                    "id": "23"
                  },
                  {
                    "name": "德保县",
                    "id": "24"
                  },
                  {
                    "name": "靖西县",
                    "id": "25"
                  },
                  {
                    "name": "那坡县",
                    "id": "26"
                  },
                  {
                    "name": "凌云县",
                    "id": "27"
                  },
                  {
                    "name": "乐业县",
                    "id": "28"
                  },
                  {
                    "name": "田林县",
                    "id": "29"
                  },
                  {
                    "name": "西林县",
                    "id": "30"
                  },
                  {
                    "name": "隆林各族自治县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "贺州",
                "id": "11",
                "Region": [
                  {
                    "name": "八步区",
                    "id": "2"
                  },
                  {
                    "name": "昭平县",
                    "id": "21"
                  },
                  {
                    "name": "钟山县",
                    "id": "22"
                  },
                  {
                    "name": "富川瑶族自治县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "河池",
                "id": "12",
                "Region": [
                  {
                    "name": "金城江区",
                    "id": "2"
                  },
                  {
                    "name": "南丹县",
                    "id": "21"
                  },
                  {
                    "name": "天峨县",
                    "id": "22"
                  },
                  {
                    "name": "凤山县",
                    "id": "23"
                  },
                  {
                    "name": "东兰县",
                    "id": "24"
                  },
                  {
                    "name": "罗城仫佬族自治县",
                    "id": "25"
                  },
                  {
                    "name": "环江毛南族自治县",
                    "id": "26"
                  },
                  {
                    "name": "巴马瑶族自治县",
                    "id": "27"
                  },
                  {
                    "name": "都安瑶族自治县",
                    "id": "28"
                  },
                  {
                    "name": "大化瑶族自治县",
                    "id": "29"
                  },
                  {
                    "name": "宜州市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "来宾",
                "id": "13",
                "Region": [
                  {
                    "name": "兴宾区",
                    "id": "2"
                  },
                  {
                    "name": "忻城县",
                    "id": "21"
                  },
                  {
                    "name": "象州县",
                    "id": "22"
                  },
                  {
                    "name": "武宣县",
                    "id": "23"
                  },
                  {
                    "name": "金秀瑶族自治县",
                    "id": "24"
                  },
                  {
                    "name": "合山市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "崇左",
                "id": "14",
                "Region": [
                  {
                    "name": "江洲区",
                    "id": "2"
                  },
                  {
                    "name": "扶绥县",
                    "id": "21"
                  },
                  {
                    "name": "宁明县",
                    "id": "22"
                  },
                  {
                    "name": "龙州县",
                    "id": "23"
                  },
                  {
                    "name": "大新县",
                    "id": "24"
                  },
                  {
                    "name": "天等县",
                    "id": "25"
                  },
                  {
                    "name": "凭祥市",
                    "id": "81"
                  }
                ]
              }
            ]
          },
          {
            "name": "海南",
            "id": "46",
            "City": [
              {
                "name": "海口",
                "id": "1",
                "Region": [
                  {
                    "name": "秀英区",
                    "id": "5"
                  },
                  {
                    "name": "龙华区",
                    "id": "6"
                  },
                  {
                    "name": "琼山区",
                    "id": "7"
                  },
                  {
                    "name": "美兰区",
                    "id": "8"
                  }
                ]
              },
              {
                "name": "三亚",
                "id": "2"
              },
              {
                "name": "三沙",
                "id": "3"
              },
              {
                "name": "五指山",
                "id": "91"
              },
              {
                "name": "琼海",
                "id": "92"
              },
              {
                "name": "儋州",
                "id": "93"
              },
              {
                "name": "文昌",
                "id": "95"
              },
              {
                "name": "万宁",
                "id": "96"
              },
              {
                "name": "东方",
                "id": "97"
              },
              {
                "name": "定安",
                "id": "A25"
              },
              {
                "name": "屯昌",
                "id": "A26"
              },
              {
                "name": "澄迈",
                "id": "A27"
              },
              {
                "name": "临高",
                "id": "A28"
              },
              {
                "name": "白沙",
                "id": "A30"
              },
              {
                "name": "昌江",
                "id": "A31"
              },
              {
                "name": "乐东",
                "id": "A33"
              },
              {
                "name": "陵水",
                "id": "A34"
              },
              {
                "name": "保亭",
                "id": "A35"
              },
              {
                "name": "琼中",
                "id": "A36"
              }
            ]
          },
          {
            "name": "重庆",
            "id": "50",
            "City": [
              {
                "name": "万州",
                "id": "1"
              },
              {
                "name": "涪陵",
                "id": "2"
              },
              {
                "name": "渝中",
                "id": "3"
              },
              {
                "name": "大渡口",
                "id": "4"
              },
              {
                "name": "江北",
                "id": "5"
              },
              {
                "name": "沙坪坝",
                "id": "6"
              },
              {
                "name": "九龙坡",
                "id": "7"
              },
              {
                "name": "南岸",
                "id": "8"
              },
              {
                "name": "北碚",
                "id": "9"
              },
              {
                "name": "两江新区",
                "id": "85"
              },
              {
                "name": "万盛",
                "id": "10"
              },
              {
                "name": "双桥",
                "id": "11"
              },
              {
                "name": "渝北",
                "id": "12"
              },
              {
                "name": "巴南",
                "id": "13"
              },
              {
                "name": "长寿",
                "id": "21"
              },
              {
                "name": "綦江",
                "id": "22"
              },
              {
                "name": "潼南",
                "id": "23"
              },
              {
                "name": "铜梁",
                "id": "24"
              },
              {
                "name": "大足",
                "id": "25"
              },
              {
                "name": "荣昌",
                "id": "26"
              },
              {
                "name": "璧山",
                "id": "27"
              },
              {
                "name": "梁平",
                "id": "28"
              },
              {
                "name": "城口",
                "id": "29"
              },
              {
                "name": "丰都",
                "id": "30"
              },
              {
                "name": "垫江",
                "id": "31"
              },
              {
                "name": "武隆",
                "id": "32"
              },
              {
                "name": "忠县",
                "id": "33"
              },
              {
                "name": "开县",
                "id": "34"
              },
              {
                "name": "云阳",
                "id": "35"
              },
              {
                "name": "奉节",
                "id": "36"
              },
              {
                "name": "巫山",
                "id": "37"
              },
              {
                "name": "巫溪",
                "id": "38"
              },
              {
                "name": "黔江",
                "id": "39"
              },
              {
                "name": "石柱",
                "id": "40"
              },
              {
                "name": "秀山",
                "id": "41"
              },
              {
                "name": "酉阳",
                "id": "42"
              },
              {
                "name": "彭水",
                "id": "43"
              },
              {
                "name": "江津",
                "id": "81"
              },
              {
                "name": "合川",
                "id": "82"
              },
              {
                "name": "永川",
                "id": "83"
              },
              {
                "name": "南川",
                "id": "84"
              }
            ]
          },
          {
            "name": "四川",
            "id": "51",
            "City": [
              {
                "name": "成都",
                "id": "1",
                "Region": [
                  {
                    "name": "锦江区",
                    "id": "4"
                  },
                  {
                    "name": "青羊区",
                    "id": "5"
                  },
                  {
                    "name": "金牛区",
                    "id": "6"
                  },
                  {
                    "name": "武侯区",
                    "id": "7"
                  },
                  {
                    "name": "成华区",
                    "id": "8"
                  },
                  {
                    "name": "龙泉驿区",
                    "id": "12"
                  },
                  {
                    "name": "青白江区",
                    "id": "13"
                  },
                  {
                    "name": "新都区",
                    "id": "14"
                  },
                  {
                    "name": "温江区",
                    "id": "15"
                  },
                  {
                    "name": "金堂县",
                    "id": "21"
                  },
                  {
                    "name": "双流县",
                    "id": "22"
                  },
                  {
                    "name": "郫　县",
                    "id": "24"
                  },
                  {
                    "name": "大邑县",
                    "id": "29"
                  },
                  {
                    "name": "蒲江县",
                    "id": "31"
                  },
                  {
                    "name": "新津县",
                    "id": "32"
                  },
                  {
                    "name": "都江堰市",
                    "id": "81"
                  },
                  {
                    "name": "彭州市",
                    "id": "82"
                  },
                  {
                    "name": "邛崃市",
                    "id": "83"
                  },
                  {
                    "name": "崇州市",
                    "id": "84"
                  }
                ]
              },
              {
                "name": "自贡",
                "id": "3",
                "Region": [
                  {
                    "name": "自流井区",
                    "id": "2"
                  },
                  {
                    "name": "贡井区",
                    "id": "3"
                  },
                  {
                    "name": "大安区",
                    "id": "4"
                  },
                  {
                    "name": "沿滩区",
                    "id": "11"
                  },
                  {
                    "name": "荣　县",
                    "id": "21"
                  },
                  {
                    "name": "富顺县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "攀枝花",
                "id": "4",
                "Region": [
                  {
                    "name": "东　区",
                    "id": "2"
                  },
                  {
                    "name": "西　区",
                    "id": "3"
                  },
                  {
                    "name": "仁和区",
                    "id": "11"
                  },
                  {
                    "name": "米易县",
                    "id": "21"
                  },
                  {
                    "name": "盐边县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "泸州",
                "id": "5",
                "Region": [
                  {
                    "name": "江阳区",
                    "id": "2"
                  },
                  {
                    "name": "纳溪区",
                    "id": "3"
                  },
                  {
                    "name": "龙马潭区",
                    "id": "4"
                  },
                  {
                    "name": "泸　县",
                    "id": "21"
                  },
                  {
                    "name": "合江县",
                    "id": "22"
                  },
                  {
                    "name": "叙永县",
                    "id": "24"
                  },
                  {
                    "name": "古蔺县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "德阳",
                "id": "6",
                "Region": [
                  {
                    "name": "旌阳区",
                    "id": "3"
                  },
                  {
                    "name": "中江县",
                    "id": "23"
                  },
                  {
                    "name": "罗江县",
                    "id": "26"
                  },
                  {
                    "name": "广汉市",
                    "id": "81"
                  },
                  {
                    "name": "什邡市",
                    "id": "82"
                  },
                  {
                    "name": "绵竹市",
                    "id": "83"
                  }
                ]
              },
              {
                "name": "绵阳",
                "id": "7",
                "Region": [
                  {
                    "name": "涪城区",
                    "id": "3"
                  },
                  {
                    "name": "游仙区",
                    "id": "4"
                  },
                  {
                    "name": "三台县",
                    "id": "22"
                  },
                  {
                    "name": "盐亭县",
                    "id": "23"
                  },
                  {
                    "name": "安　县",
                    "id": "24"
                  },
                  {
                    "name": "梓潼县",
                    "id": "25"
                  },
                  {
                    "name": "北川羌族自治县",
                    "id": "26"
                  },
                  {
                    "name": "平武县",
                    "id": "27"
                  },
                  {
                    "name": "江油市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "广元",
                "id": "8",
                "Region": [
                  {
                    "name": "市中区",
                    "id": "2"
                  },
                  {
                    "name": "元坝区",
                    "id": "11"
                  },
                  {
                    "name": "朝天区",
                    "id": "12"
                  },
                  {
                    "name": "旺苍县",
                    "id": "21"
                  },
                  {
                    "name": "青川县",
                    "id": "22"
                  },
                  {
                    "name": "剑阁县",
                    "id": "23"
                  },
                  {
                    "name": "苍溪县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "遂宁",
                "id": "9",
                "Region": [
                  {
                    "name": "船山区",
                    "id": "3"
                  },
                  {
                    "name": "安居区",
                    "id": "4"
                  },
                  {
                    "name": "蓬溪县",
                    "id": "21"
                  },
                  {
                    "name": "射洪县",
                    "id": "22"
                  },
                  {
                    "name": "大英县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "内江",
                "id": "10",
                "Region": [
                  {
                    "name": "市中区",
                    "id": "2"
                  },
                  {
                    "name": "东兴区",
                    "id": "11"
                  },
                  {
                    "name": "威远县",
                    "id": "24"
                  },
                  {
                    "name": "资中县",
                    "id": "25"
                  },
                  {
                    "name": "隆昌县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "乐山",
                "id": "11",
                "Region": [
                  {
                    "name": "市中区",
                    "id": "2"
                  },
                  {
                    "name": "沙湾区",
                    "id": "11"
                  },
                  {
                    "name": "五通桥区",
                    "id": "12"
                  },
                  {
                    "name": "金口河区",
                    "id": "13"
                  },
                  {
                    "name": "犍为县",
                    "id": "23"
                  },
                  {
                    "name": "井研县",
                    "id": "24"
                  },
                  {
                    "name": "夹江县",
                    "id": "26"
                  },
                  {
                    "name": "沐川县",
                    "id": "29"
                  },
                  {
                    "name": "峨边彝族自治县",
                    "id": "32"
                  },
                  {
                    "name": "马边彝族自治县",
                    "id": "33"
                  },
                  {
                    "name": "峨眉山市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "南充",
                "id": "13",
                "Region": [
                  {
                    "name": "顺庆区",
                    "id": "2"
                  },
                  {
                    "name": "高坪区",
                    "id": "3"
                  },
                  {
                    "name": "嘉陵区",
                    "id": "4"
                  },
                  {
                    "name": "南部县",
                    "id": "21"
                  },
                  {
                    "name": "营山县",
                    "id": "22"
                  },
                  {
                    "name": "蓬安县",
                    "id": "23"
                  },
                  {
                    "name": "仪陇县",
                    "id": "24"
                  },
                  {
                    "name": "西充县",
                    "id": "25"
                  },
                  {
                    "name": "阆中市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "眉山",
                "id": "14",
                "Region": [
                  {
                    "name": "东坡区",
                    "id": "2"
                  },
                  {
                    "name": "仁寿县",
                    "id": "21"
                  },
                  {
                    "name": "彭山县",
                    "id": "22"
                  },
                  {
                    "name": "洪雅县",
                    "id": "23"
                  },
                  {
                    "name": "丹棱县",
                    "id": "24"
                  },
                  {
                    "name": "青神县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "宜宾",
                "id": "15",
                "Region": [
                  {
                    "name": "翠屏区",
                    "id": "2"
                  },
                  {
                    "name": "宜宾县",
                    "id": "21"
                  },
                  {
                    "name": "南溪县",
                    "id": "22"
                  },
                  {
                    "name": "江安县",
                    "id": "23"
                  },
                  {
                    "name": "长宁县",
                    "id": "24"
                  },
                  {
                    "name": "高　县",
                    "id": "25"
                  },
                  {
                    "name": "珙　县",
                    "id": "26"
                  },
                  {
                    "name": "筠连县",
                    "id": "27"
                  },
                  {
                    "name": "兴文县",
                    "id": "28"
                  },
                  {
                    "name": "屏山县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "广安",
                "id": "16",
                "Region": [
                  {
                    "name": "广安区",
                    "id": "2"
                  },
                  {
                    "name": "岳池县",
                    "id": "21"
                  },
                  {
                    "name": "武胜县",
                    "id": "22"
                  },
                  {
                    "name": "邻水县",
                    "id": "23"
                  },
                  {
                    "name": "华蓥市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "达州",
                "id": "17",
                "Region": [
                  {
                    "name": "通川区",
                    "id": "2"
                  },
                  {
                    "name": "达　县",
                    "id": "21"
                  },
                  {
                    "name": "宣汉县",
                    "id": "22"
                  },
                  {
                    "name": "开江县",
                    "id": "23"
                  },
                  {
                    "name": "大竹县",
                    "id": "24"
                  },
                  {
                    "name": "渠　县",
                    "id": "25"
                  },
                  {
                    "name": "万源市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "雅安",
                "id": "18",
                "Region": [
                  {
                    "name": "雨城区",
                    "id": "2"
                  },
                  {
                    "name": "名山县",
                    "id": "21"
                  },
                  {
                    "name": "荥经县",
                    "id": "22"
                  },
                  {
                    "name": "汉源县",
                    "id": "23"
                  },
                  {
                    "name": "石棉县",
                    "id": "24"
                  },
                  {
                    "name": "天全县",
                    "id": "25"
                  },
                  {
                    "name": "芦山县",
                    "id": "26"
                  },
                  {
                    "name": "宝兴县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "巴中",
                "id": "19",
                "Region": [
                  {
                    "name": "巴州区",
                    "id": "2"
                  },
                  {
                    "name": "通江县",
                    "id": "21"
                  },
                  {
                    "name": "南江县",
                    "id": "22"
                  },
                  {
                    "name": "平昌县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "资阳",
                "id": "20",
                "Region": [
                  {
                    "name": "雁江区",
                    "id": "2"
                  },
                  {
                    "name": "安岳县",
                    "id": "21"
                  },
                  {
                    "name": "乐至县",
                    "id": "22"
                  },
                  {
                    "name": "简阳市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "阿坝",
                "id": "32",
                "Region": [
                  {
                    "name": "汶川县",
                    "id": "21"
                  },
                  {
                    "name": "理　县",
                    "id": "22"
                  },
                  {
                    "name": "茂　县",
                    "id": "23"
                  },
                  {
                    "name": "松潘县",
                    "id": "24"
                  },
                  {
                    "name": "九寨沟县",
                    "id": "25"
                  },
                  {
                    "name": "金川县",
                    "id": "26"
                  },
                  {
                    "name": "小金县",
                    "id": "27"
                  },
                  {
                    "name": "黑水县",
                    "id": "28"
                  },
                  {
                    "name": "马尔康县",
                    "id": "29"
                  },
                  {
                    "name": "壤塘县",
                    "id": "30"
                  },
                  {
                    "name": "阿坝县",
                    "id": "31"
                  },
                  {
                    "name": "若尔盖县",
                    "id": "32"
                  },
                  {
                    "name": "红原县",
                    "id": "33"
                  }
                ]
              },
              {
                "name": "甘孜",
                "id": "33",
                "Region": [
                  {
                    "name": "康定县",
                    "id": "21"
                  },
                  {
                    "name": "泸定县",
                    "id": "22"
                  },
                  {
                    "name": "丹巴县",
                    "id": "23"
                  },
                  {
                    "name": "九龙县",
                    "id": "24"
                  },
                  {
                    "name": "雅江县",
                    "id": "25"
                  },
                  {
                    "name": "道孚县",
                    "id": "26"
                  },
                  {
                    "name": "炉霍县",
                    "id": "27"
                  },
                  {
                    "name": "甘孜县",
                    "id": "28"
                  },
                  {
                    "name": "新龙县",
                    "id": "29"
                  },
                  {
                    "name": "德格县",
                    "id": "30"
                  },
                  {
                    "name": "白玉县",
                    "id": "31"
                  },
                  {
                    "name": "石渠县",
                    "id": "32"
                  },
                  {
                    "name": "色达县",
                    "id": "33"
                  },
                  {
                    "name": "理塘县",
                    "id": "34"
                  },
                  {
                    "name": "巴塘县",
                    "id": "35"
                  },
                  {
                    "name": "乡城县",
                    "id": "36"
                  },
                  {
                    "name": "稻城县",
                    "id": "37"
                  },
                  {
                    "name": "得荣县",
                    "id": "38"
                  }
                ]
              },
              {
                "name": "凉山",
                "id": "34",
                "Region": [
                  {
                    "name": "西昌市",
                    "id": "1"
                  },
                  {
                    "name": "木里藏族自治县",
                    "id": "22"
                  },
                  {
                    "name": "盐源县",
                    "id": "23"
                  },
                  {
                    "name": "德昌县",
                    "id": "24"
                  },
                  {
                    "name": "会理县",
                    "id": "25"
                  },
                  {
                    "name": "会东县",
                    "id": "26"
                  },
                  {
                    "name": "宁南县",
                    "id": "27"
                  },
                  {
                    "name": "普格县",
                    "id": "28"
                  },
                  {
                    "name": "布拖县",
                    "id": "29"
                  },
                  {
                    "name": "金阳县",
                    "id": "30"
                  },
                  {
                    "name": "昭觉县",
                    "id": "31"
                  },
                  {
                    "name": "喜德县",
                    "id": "32"
                  },
                  {
                    "name": "冕宁县",
                    "id": "33"
                  },
                  {
                    "name": "越西县",
                    "id": "34"
                  },
                  {
                    "name": "甘洛县",
                    "id": "35"
                  },
                  {
                    "name": "美姑县",
                    "id": "36"
                  },
                  {
                    "name": "雷波县",
                    "id": "37"
                  }
                ]
              }
            ]
          },
          {
            "name": "贵州",
            "id": "52",
            "City": [
              {
                "name": "贵阳",
                "id": "1",
                "Region": [
                  {
                    "name": "南明区",
                    "id": "2"
                  },
                  {
                    "name": "云岩区",
                    "id": "3"
                  },
                  {
                    "name": "花溪区",
                    "id": "11"
                  },
                  {
                    "name": "乌当区",
                    "id": "12"
                  },
                  {
                    "name": "白云区",
                    "id": "13"
                  },
                  {
                    "name": "小河区",
                    "id": "14"
                  },
                  {
                    "name": "开阳县",
                    "id": "21"
                  },
                  {
                    "name": "息烽县",
                    "id": "22"
                  },
                  {
                    "name": "修文县",
                    "id": "23"
                  },
                  {
                    "name": "清镇市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "六盘水",
                "id": "2",
                "Region": [
                  {
                    "name": "钟山区",
                    "id": "1"
                  },
                  {
                    "name": "六枝特区",
                    "id": "3"
                  },
                  {
                    "name": "水城县",
                    "id": "21"
                  },
                  {
                    "name": "盘　县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "遵义",
                "id": "3",
                "Region": [
                  {
                    "name": "红花岗区",
                    "id": "2"
                  },
                  {
                    "name": "汇川区",
                    "id": "3"
                  },
                  {
                    "name": "遵义县",
                    "id": "21"
                  },
                  {
                    "name": "桐梓县",
                    "id": "22"
                  },
                  {
                    "name": "绥阳县",
                    "id": "23"
                  },
                  {
                    "name": "正安县",
                    "id": "24"
                  },
                  {
                    "name": "道真仡佬族苗族自治县",
                    "id": "25"
                  },
                  {
                    "name": "务川仡佬族苗族自治县",
                    "id": "26"
                  },
                  {
                    "name": "凤冈县",
                    "id": "27"
                  },
                  {
                    "name": "湄潭县",
                    "id": "28"
                  },
                  {
                    "name": "余庆县",
                    "id": "29"
                  },
                  {
                    "name": "习水县",
                    "id": "30"
                  },
                  {
                    "name": "赤水市",
                    "id": "81"
                  },
                  {
                    "name": "仁怀市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "安顺",
                "id": "4",
                "Region": [
                  {
                    "name": "西秀区",
                    "id": "2"
                  },
                  {
                    "name": "平坝县",
                    "id": "21"
                  },
                  {
                    "name": "普定县",
                    "id": "22"
                  },
                  {
                    "name": "镇宁布依族苗族自治县",
                    "id": "23"
                  },
                  {
                    "name": "关岭布依族苗族自治县",
                    "id": "24"
                  },
                  {
                    "name": "紫云苗族布依族自治县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "铜仁",
                "id": "22",
                "Region": [
                  {
                    "name": "铜仁市",
                    "id": "1"
                  },
                  {
                    "name": "江口县",
                    "id": "22"
                  },
                  {
                    "name": "玉屏侗族自治县",
                    "id": "23"
                  },
                  {
                    "name": "石阡县",
                    "id": "24"
                  },
                  {
                    "name": "思南县",
                    "id": "25"
                  },
                  {
                    "name": "印江土家族苗族自治县",
                    "id": "26"
                  },
                  {
                    "name": "德江县",
                    "id": "27"
                  },
                  {
                    "name": "沿河土家族自治县",
                    "id": "28"
                  },
                  {
                    "name": "松桃苗族自治县",
                    "id": "29"
                  },
                  {
                    "name": "万山特区",
                    "id": "30"
                  }
                ]
              },
              {
                "name": "黔西南",
                "id": "23",
                "Region": [
                  {
                    "name": "兴义市",
                    "id": "1"
                  },
                  {
                    "name": "兴仁县",
                    "id": "22"
                  },
                  {
                    "name": "普安县",
                    "id": "23"
                  },
                  {
                    "name": "晴隆县",
                    "id": "24"
                  },
                  {
                    "name": "贞丰县",
                    "id": "25"
                  },
                  {
                    "name": "望谟县",
                    "id": "26"
                  },
                  {
                    "name": "册亨县",
                    "id": "27"
                  },
                  {
                    "name": "安龙县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "毕节",
                "id": "24",
                "Region": [
                  {
                    "name": "毕节市",
                    "id": "1"
                  },
                  {
                    "name": "大方县",
                    "id": "22"
                  },
                  {
                    "name": "黔西县",
                    "id": "23"
                  },
                  {
                    "name": "金沙县",
                    "id": "24"
                  },
                  {
                    "name": "织金县",
                    "id": "25"
                  },
                  {
                    "name": "纳雍县",
                    "id": "26"
                  },
                  {
                    "name": "威宁彝族回族苗族自治县",
                    "id": "27"
                  },
                  {
                    "name": "赫章县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "黔东南",
                "id": "26",
                "Region": [
                  {
                    "name": "凯里市",
                    "id": "1"
                  },
                  {
                    "name": "黄平县",
                    "id": "22"
                  },
                  {
                    "name": "施秉县",
                    "id": "23"
                  },
                  {
                    "name": "三穗县",
                    "id": "24"
                  },
                  {
                    "name": "镇远县",
                    "id": "25"
                  },
                  {
                    "name": "岑巩县",
                    "id": "26"
                  },
                  {
                    "name": "天柱县",
                    "id": "27"
                  },
                  {
                    "name": "锦屏县",
                    "id": "28"
                  },
                  {
                    "name": "剑河县",
                    "id": "29"
                  },
                  {
                    "name": "台江县",
                    "id": "30"
                  },
                  {
                    "name": "黎平县",
                    "id": "31"
                  },
                  {
                    "name": "榕江县",
                    "id": "32"
                  },
                  {
                    "name": "从江县",
                    "id": "33"
                  },
                  {
                    "name": "雷山县",
                    "id": "34"
                  },
                  {
                    "name": "麻江县",
                    "id": "35"
                  },
                  {
                    "name": "丹寨县",
                    "id": "36"
                  }
                ]
              },
              {
                "name": "黔南",
                "id": "27",
                "Region": [
                  {
                    "name": "都匀市",
                    "id": "1"
                  },
                  {
                    "name": "福泉市",
                    "id": "2"
                  },
                  {
                    "name": "荔波县",
                    "id": "22"
                  },
                  {
                    "name": "贵定县",
                    "id": "23"
                  },
                  {
                    "name": "瓮安县",
                    "id": "25"
                  },
                  {
                    "name": "独山县",
                    "id": "26"
                  },
                  {
                    "name": "平塘县",
                    "id": "27"
                  },
                  {
                    "name": "罗甸县",
                    "id": "28"
                  },
                  {
                    "name": "长顺县",
                    "id": "29"
                  },
                  {
                    "name": "龙里县",
                    "id": "30"
                  },
                  {
                    "name": "惠水县",
                    "id": "31"
                  },
                  {
                    "name": "三都水族自治县",
                    "id": "32"
                  }
                ]
              }
            ]
          },
          {
            "name": "云南",
            "id": "53",
            "City": [
              {
                "name": "昆明",
                "id": "1",
                "Region": [
                  {
                    "name": "五华区",
                    "id": "2"
                  },
                  {
                    "name": "盘龙区",
                    "id": "3"
                  },
                  {
                    "name": "官渡区",
                    "id": "11"
                  },
                  {
                    "name": "西山区",
                    "id": "12"
                  },
                  {
                    "name": "东川区",
                    "id": "13"
                  },
                  {
                    "name": "呈贡县",
                    "id": "21"
                  },
                  {
                    "name": "晋宁县",
                    "id": "22"
                  },
                  {
                    "name": "富民县",
                    "id": "24"
                  },
                  {
                    "name": "宜良县",
                    "id": "25"
                  },
                  {
                    "name": "石林彝族自治县",
                    "id": "26"
                  },
                  {
                    "name": "嵩明县",
                    "id": "27"
                  },
                  {
                    "name": "禄劝彝族苗族自治县",
                    "id": "28"
                  },
                  {
                    "name": "寻甸回族彝族自治县",
                    "id": "29"
                  },
                  {
                    "name": "安宁市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "曲靖",
                "id": "3",
                "Region": [
                  {
                    "name": "麒麟区",
                    "id": "2"
                  },
                  {
                    "name": "马龙县",
                    "id": "21"
                  },
                  {
                    "name": "陆良县",
                    "id": "22"
                  },
                  {
                    "name": "师宗县",
                    "id": "23"
                  },
                  {
                    "name": "罗平县",
                    "id": "24"
                  },
                  {
                    "name": "富源县",
                    "id": "25"
                  },
                  {
                    "name": "会泽县",
                    "id": "26"
                  },
                  {
                    "name": "沾益县",
                    "id": "28"
                  },
                  {
                    "name": "宣威市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "玉溪",
                "id": "4",
                "Region": [
                  {
                    "name": "红塔区",
                    "id": "2"
                  },
                  {
                    "name": "江川县",
                    "id": "21"
                  },
                  {
                    "name": "澄江县",
                    "id": "22"
                  },
                  {
                    "name": "通海县",
                    "id": "23"
                  },
                  {
                    "name": "华宁县",
                    "id": "24"
                  },
                  {
                    "name": "易门县",
                    "id": "25"
                  },
                  {
                    "name": "峨山彝族自治县",
                    "id": "26"
                  },
                  {
                    "name": "新平彝族傣族自治县",
                    "id": "27"
                  },
                  {
                    "name": "元江哈尼族彝族傣族自治县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "保山",
                "id": "5",
                "Region": [
                  {
                    "name": "隆阳区",
                    "id": "2"
                  },
                  {
                    "name": "施甸县",
                    "id": "21"
                  },
                  {
                    "name": "腾冲县",
                    "id": "22"
                  },
                  {
                    "name": "龙陵县",
                    "id": "23"
                  },
                  {
                    "name": "昌宁县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "昭通",
                "id": "6",
                "Region": [
                  {
                    "name": "昭阳区",
                    "id": "2"
                  },
                  {
                    "name": "鲁甸县",
                    "id": "21"
                  },
                  {
                    "name": "巧家县",
                    "id": "22"
                  },
                  {
                    "name": "盐津县",
                    "id": "23"
                  },
                  {
                    "name": "大关县",
                    "id": "24"
                  },
                  {
                    "name": "永善县",
                    "id": "25"
                  },
                  {
                    "name": "绥江县",
                    "id": "26"
                  },
                  {
                    "name": "镇雄县",
                    "id": "27"
                  },
                  {
                    "name": "彝良县",
                    "id": "28"
                  },
                  {
                    "name": "威信县",
                    "id": "29"
                  },
                  {
                    "name": "水富县",
                    "id": "30"
                  }
                ]
              },
              {
                "name": "丽江",
                "id": "7",
                "Region": [
                  {
                    "name": "古城区",
                    "id": "2"
                  },
                  {
                    "name": "玉龙纳西族自治县",
                    "id": "21"
                  },
                  {
                    "name": "永胜县",
                    "id": "22"
                  },
                  {
                    "name": "华坪县",
                    "id": "23"
                  },
                  {
                    "name": "宁蒗彝族自治县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "普洱",
                "id": "8",
                "Region": [
                  {
                    "name": "思茅区",
                    "id": "2"
                  },
                  {
                    "name": "宁洱哈尼族彝族自治县",
                    "id": "21"
                  },
                  {
                    "name": "墨江哈尼族自治县",
                    "id": "22"
                  },
                  {
                    "name": "景东彝族自治县",
                    "id": "23"
                  },
                  {
                    "name": "景谷傣族彝族自治县",
                    "id": "24"
                  },
                  {
                    "name": "镇沅彝族哈尼族拉祜族自治县",
                    "id": "25"
                  },
                  {
                    "name": "江城哈尼族彝族自治县",
                    "id": "26"
                  },
                  {
                    "name": "孟连傣族拉祜族佤族自治县",
                    "id": "27"
                  },
                  {
                    "name": "澜沧拉祜族自治县",
                    "id": "28"
                  },
                  {
                    "name": "西盟佤族自治县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "临沧",
                "id": "9",
                "Region": [
                  {
                    "name": "临翔区",
                    "id": "2"
                  },
                  {
                    "name": "凤庆县",
                    "id": "21"
                  },
                  {
                    "name": "云　县",
                    "id": "22"
                  },
                  {
                    "name": "永德县",
                    "id": "23"
                  },
                  {
                    "name": "镇康县",
                    "id": "24"
                  },
                  {
                    "name": "双江拉祜族佤族布朗族傣族自治县",
                    "id": "25"
                  },
                  {
                    "name": "耿马傣族佤族自治县",
                    "id": "26"
                  },
                  {
                    "name": "沧源佤族自治县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "楚雄",
                "id": "23",
                "Region": [
                  {
                    "name": "楚雄市",
                    "id": "1"
                  },
                  {
                    "name": "双柏县",
                    "id": "22"
                  },
                  {
                    "name": "牟定县",
                    "id": "23"
                  },
                  {
                    "name": "南华县",
                    "id": "24"
                  },
                  {
                    "name": "姚安县",
                    "id": "25"
                  },
                  {
                    "name": "大姚县",
                    "id": "26"
                  },
                  {
                    "name": "永仁县",
                    "id": "27"
                  },
                  {
                    "name": "元谋县",
                    "id": "28"
                  },
                  {
                    "name": "武定县",
                    "id": "29"
                  },
                  {
                    "name": "禄丰县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "红河",
                "id": "25",
                "Region": [
                  {
                    "name": "个旧市",
                    "id": "1"
                  },
                  {
                    "name": "开远市",
                    "id": "2"
                  },
                  {
                    "name": "蒙自县",
                    "id": "22"
                  },
                  {
                    "name": "屏边苗族自治县",
                    "id": "23"
                  },
                  {
                    "name": "建水县",
                    "id": "24"
                  },
                  {
                    "name": "石屏县",
                    "id": "25"
                  },
                  {
                    "name": "弥勒县",
                    "id": "26"
                  },
                  {
                    "name": "泸西县",
                    "id": "27"
                  },
                  {
                    "name": "元阳县",
                    "id": "28"
                  },
                  {
                    "name": "红河县",
                    "id": "29"
                  },
                  {
                    "name": "金平苗族瑶族傣族自治县",
                    "id": "30"
                  },
                  {
                    "name": "绿春县",
                    "id": "31"
                  },
                  {
                    "name": "河口瑶族自治县",
                    "id": "32"
                  }
                ]
              },
              {
                "name": "文山",
                "id": "26",
                "Region": [
                  {
                    "name": "文山县",
                    "id": "21"
                  },
                  {
                    "name": "砚山县",
                    "id": "22"
                  },
                  {
                    "name": "西畴县",
                    "id": "23"
                  },
                  {
                    "name": "麻栗坡县",
                    "id": "24"
                  },
                  {
                    "name": "马关县",
                    "id": "25"
                  },
                  {
                    "name": "丘北县",
                    "id": "26"
                  },
                  {
                    "name": "广南县",
                    "id": "27"
                  },
                  {
                    "name": "富宁县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "西双版纳",
                "id": "28",
                "Region": [
                  {
                    "name": "景洪市",
                    "id": "1"
                  },
                  {
                    "name": "勐海县",
                    "id": "22"
                  },
                  {
                    "name": "勐腊县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "大理",
                "id": "29",
                "Region": [
                  {
                    "name": "大理市",
                    "id": "1"
                  },
                  {
                    "name": "漾濞彝族自治县",
                    "id": "22"
                  },
                  {
                    "name": "祥云县",
                    "id": "23"
                  },
                  {
                    "name": "宾川县",
                    "id": "24"
                  },
                  {
                    "name": "弥渡县",
                    "id": "25"
                  },
                  {
                    "name": "南涧彝族自治县",
                    "id": "26"
                  },
                  {
                    "name": "巍山彝族回族自治县",
                    "id": "27"
                  },
                  {
                    "name": "永平县",
                    "id": "28"
                  },
                  {
                    "name": "云龙县",
                    "id": "29"
                  },
                  {
                    "name": "洱源县",
                    "id": "30"
                  },
                  {
                    "name": "剑川县",
                    "id": "31"
                  },
                  {
                    "name": "鹤庆县",
                    "id": "32"
                  }
                ]
              },
              {
                "name": "德宏",
                "id": "31",
                "Region": [
                  {
                    "name": "瑞丽市",
                    "id": "2"
                  },
                  {
                    "name": "潞西市",
                    "id": "3"
                  },
                  {
                    "name": "梁河县",
                    "id": "22"
                  },
                  {
                    "name": "盈江县",
                    "id": "23"
                  },
                  {
                    "name": "陇川县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "怒江",
                "id": "33",
                "Region": [
                  {
                    "name": "泸水县",
                    "id": "21"
                  },
                  {
                    "name": "福贡县",
                    "id": "23"
                  },
                  {
                    "name": "贡山独龙族怒族自治县",
                    "id": "24"
                  },
                  {
                    "name": "兰坪白族普米族自治县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "迪庆",
                "id": "34",
                "Region": [
                  {
                    "name": "香格里拉县",
                    "id": "21"
                  },
                  {
                    "name": "德钦县",
                    "id": "22"
                  },
                  {
                    "name": "维西傈僳族自治县",
                    "id": "23"
                  }
                ]
              }
            ]
          },
          {
            "name": "西藏",
            "id": "54",
            "City": [
              {
                "name": "拉萨",
                "id": "1",
                "Region": [
                  {
                    "name": "城关区",
                    "id": "2"
                  },
                  {
                    "name": "林周县",
                    "id": "21"
                  },
                  {
                    "name": "当雄县",
                    "id": "22"
                  },
                  {
                    "name": "尼木县",
                    "id": "23"
                  },
                  {
                    "name": "曲水县",
                    "id": "24"
                  },
                  {
                    "name": "堆龙德庆县",
                    "id": "25"
                  },
                  {
                    "name": "达孜县",
                    "id": "26"
                  },
                  {
                    "name": "墨竹工卡县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "昌都",
                "id": "21",
                "Region": [
                  {
                    "name": "昌都县",
                    "id": "21"
                  },
                  {
                    "name": "江达县",
                    "id": "22"
                  },
                  {
                    "name": "贡觉县",
                    "id": "23"
                  },
                  {
                    "name": "类乌齐县",
                    "id": "24"
                  },
                  {
                    "name": "丁青县",
                    "id": "25"
                  },
                  {
                    "name": "察雅县",
                    "id": "26"
                  },
                  {
                    "name": "八宿县",
                    "id": "27"
                  },
                  {
                    "name": "左贡县",
                    "id": "28"
                  },
                  {
                    "name": "芒康县",
                    "id": "29"
                  },
                  {
                    "name": "洛隆县",
                    "id": "32"
                  },
                  {
                    "name": "边坝县",
                    "id": "33"
                  }
                ]
              },
              {
                "name": "山南",
                "id": "22",
                "Region": [
                  {
                    "name": "乃东县",
                    "id": "21"
                  },
                  {
                    "name": "扎囊县",
                    "id": "22"
                  },
                  {
                    "name": "贡嘎县",
                    "id": "23"
                  },
                  {
                    "name": "桑日县",
                    "id": "24"
                  },
                  {
                    "name": "琼结县",
                    "id": "25"
                  },
                  {
                    "name": "曲松县",
                    "id": "26"
                  },
                  {
                    "name": "措美县",
                    "id": "27"
                  },
                  {
                    "name": "洛扎县",
                    "id": "28"
                  },
                  {
                    "name": "加查县",
                    "id": "29"
                  },
                  {
                    "name": "隆子县",
                    "id": "31"
                  },
                  {
                    "name": "错那县",
                    "id": "32"
                  },
                  {
                    "name": "浪卡子县",
                    "id": "33"
                  }
                ]
              },
              {
                "name": "日喀则",
                "id": "23",
                "Region": [
                  {
                    "name": "日喀则市",
                    "id": "1"
                  },
                  {
                    "name": "南木林县",
                    "id": "22"
                  },
                  {
                    "name": "江孜县",
                    "id": "23"
                  },
                  {
                    "name": "定日县",
                    "id": "24"
                  },
                  {
                    "name": "萨迦县",
                    "id": "25"
                  },
                  {
                    "name": "拉孜县",
                    "id": "26"
                  },
                  {
                    "name": "昂仁县",
                    "id": "27"
                  },
                  {
                    "name": "谢通门县",
                    "id": "28"
                  },
                  {
                    "name": "白朗县",
                    "id": "29"
                  },
                  {
                    "name": "仁布县",
                    "id": "30"
                  },
                  {
                    "name": "康马县",
                    "id": "31"
                  },
                  {
                    "name": "定结县",
                    "id": "32"
                  },
                  {
                    "name": "仲巴县",
                    "id": "33"
                  },
                  {
                    "name": "亚东县",
                    "id": "34"
                  },
                  {
                    "name": "吉隆县",
                    "id": "35"
                  },
                  {
                    "name": "聂拉木县",
                    "id": "36"
                  },
                  {
                    "name": "萨嘎县",
                    "id": "37"
                  },
                  {
                    "name": "岗巴县",
                    "id": "38"
                  }
                ]
              },
              {
                "name": "那曲",
                "id": "24",
                "Region": [
                  {
                    "name": "那曲县",
                    "id": "21"
                  },
                  {
                    "name": "嘉黎县",
                    "id": "22"
                  },
                  {
                    "name": "比如县",
                    "id": "23"
                  },
                  {
                    "name": "聂荣县",
                    "id": "24"
                  },
                  {
                    "name": "安多县",
                    "id": "25"
                  },
                  {
                    "name": "申扎县",
                    "id": "26"
                  },
                  {
                    "name": "索　县",
                    "id": "27"
                  },
                  {
                    "name": "班戈县",
                    "id": "28"
                  },
                  {
                    "name": "巴青县",
                    "id": "29"
                  },
                  {
                    "name": "尼玛县",
                    "id": "30"
                  }
                ]
              },
              {
                "name": "阿里",
                "id": "25",
                "Region": [
                  {
                    "name": "普兰县",
                    "id": "21"
                  },
                  {
                    "name": "札达县",
                    "id": "22"
                  },
                  {
                    "name": "噶尔县",
                    "id": "23"
                  },
                  {
                    "name": "日土县",
                    "id": "24"
                  },
                  {
                    "name": "革吉县",
                    "id": "25"
                  },
                  {
                    "name": "改则县",
                    "id": "26"
                  },
                  {
                    "name": "措勤县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "林芝",
                "id": "26",
                "Region": [
                  {
                    "name": "林芝县",
                    "id": "21"
                  },
                  {
                    "name": "工布江达县",
                    "id": "22"
                  },
                  {
                    "name": "米林县",
                    "id": "23"
                  },
                  {
                    "name": "墨脱县",
                    "id": "24"
                  },
                  {
                    "name": "波密县",
                    "id": "25"
                  },
                  {
                    "name": "察隅县",
                    "id": "26"
                  },
                  {
                    "name": "朗　县",
                    "id": "27"
                  }
                ]
              }
            ]
          },
          {
            "name": "陕西",
            "id": "61",
            "City": [
              {
                "name": "西安",
                "id": "1",
                "Region": [
                  {
                    "name": "新城区",
                    "id": "2"
                  },
                  {
                    "name": "碑林区",
                    "id": "3"
                  },
                  {
                    "name": "莲湖区",
                    "id": "4"
                  },
                  {
                    "name": "灞桥区",
                    "id": "11"
                  },
                  {
                    "name": "未央区",
                    "id": "12"
                  },
                  {
                    "name": "雁塔区",
                    "id": "13"
                  },
                  {
                    "name": "阎良区",
                    "id": "14"
                  },
                  {
                    "name": "临潼区",
                    "id": "15"
                  },
                  {
                    "name": "长安区",
                    "id": "16"
                  },
                  {
                    "name": "蓝田县",
                    "id": "22"
                  },
                  {
                    "name": "周至县",
                    "id": "24"
                  },
                  {
                    "name": "户　县",
                    "id": "25"
                  },
                  {
                    "name": "高陵县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "铜川",
                "id": "2",
                "Region": [
                  {
                    "name": "王益区",
                    "id": "2"
                  },
                  {
                    "name": "印台区",
                    "id": "3"
                  },
                  {
                    "name": "耀州区",
                    "id": "4"
                  },
                  {
                    "name": "宜君县",
                    "id": "22"
                  }
                ]
              },
              {
                "name": "宝鸡",
                "id": "3",
                "Region": [
                  {
                    "name": "渭滨区",
                    "id": "2"
                  },
                  {
                    "name": "金台区",
                    "id": "3"
                  },
                  {
                    "name": "陈仓区",
                    "id": "4"
                  },
                  {
                    "name": "凤翔县",
                    "id": "22"
                  },
                  {
                    "name": "岐山县",
                    "id": "23"
                  },
                  {
                    "name": "扶风县",
                    "id": "24"
                  },
                  {
                    "name": "眉　县",
                    "id": "26"
                  },
                  {
                    "name": "陇　县",
                    "id": "27"
                  },
                  {
                    "name": "千阳县",
                    "id": "28"
                  },
                  {
                    "name": "麟游县",
                    "id": "29"
                  },
                  {
                    "name": "凤　县",
                    "id": "30"
                  },
                  {
                    "name": "太白县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "咸阳",
                "id": "4",
                "Region": [
                  {
                    "name": "秦都区",
                    "id": "2"
                  },
                  {
                    "name": "杨凌区",
                    "id": "3"
                  },
                  {
                    "name": "渭城区",
                    "id": "4"
                  },
                  {
                    "name": "三原县",
                    "id": "22"
                  },
                  {
                    "name": "泾阳县",
                    "id": "23"
                  },
                  {
                    "name": "乾　县",
                    "id": "24"
                  },
                  {
                    "name": "礼泉县",
                    "id": "25"
                  },
                  {
                    "name": "永寿县",
                    "id": "26"
                  },
                  {
                    "name": "彬　县",
                    "id": "27"
                  },
                  {
                    "name": "长武县",
                    "id": "28"
                  },
                  {
                    "name": "旬邑县",
                    "id": "29"
                  },
                  {
                    "name": "淳化县",
                    "id": "30"
                  },
                  {
                    "name": "武功县",
                    "id": "31"
                  },
                  {
                    "name": "兴平市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "渭南",
                "id": "5",
                "Region": [
                  {
                    "name": "临渭区",
                    "id": "2"
                  },
                  {
                    "name": "华　县",
                    "id": "21"
                  },
                  {
                    "name": "潼关县",
                    "id": "22"
                  },
                  {
                    "name": "大荔县",
                    "id": "23"
                  },
                  {
                    "name": "合阳县",
                    "id": "24"
                  },
                  {
                    "name": "澄城县",
                    "id": "25"
                  },
                  {
                    "name": "蒲城县",
                    "id": "26"
                  },
                  {
                    "name": "白水县",
                    "id": "27"
                  },
                  {
                    "name": "富平县",
                    "id": "28"
                  },
                  {
                    "name": "韩城市",
                    "id": "81"
                  },
                  {
                    "name": "华阴市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "延安",
                "id": "6",
                "Region": [
                  {
                    "name": "宝塔区",
                    "id": "2"
                  },
                  {
                    "name": "延长县",
                    "id": "21"
                  },
                  {
                    "name": "延川县",
                    "id": "22"
                  },
                  {
                    "name": "子长县",
                    "id": "23"
                  },
                  {
                    "name": "安塞县",
                    "id": "24"
                  },
                  {
                    "name": "志丹县",
                    "id": "25"
                  },
                  {
                    "name": "吴起县",
                    "id": "26"
                  },
                  {
                    "name": "甘泉县",
                    "id": "27"
                  },
                  {
                    "name": "富　县",
                    "id": "28"
                  },
                  {
                    "name": "洛川县",
                    "id": "29"
                  },
                  {
                    "name": "宜川县",
                    "id": "30"
                  },
                  {
                    "name": "黄龙县",
                    "id": "31"
                  },
                  {
                    "name": "黄陵县",
                    "id": "32"
                  }
                ]
              },
              {
                "name": "汉中",
                "id": "7",
                "Region": [
                  {
                    "name": "汉台区",
                    "id": "2"
                  },
                  {
                    "name": "南郑县",
                    "id": "21"
                  },
                  {
                    "name": "城固县",
                    "id": "22"
                  },
                  {
                    "name": "洋　县",
                    "id": "23"
                  },
                  {
                    "name": "西乡县",
                    "id": "24"
                  },
                  {
                    "name": "勉　县",
                    "id": "25"
                  },
                  {
                    "name": "宁强县",
                    "id": "26"
                  },
                  {
                    "name": "略阳县",
                    "id": "27"
                  },
                  {
                    "name": "镇巴县",
                    "id": "28"
                  },
                  {
                    "name": "留坝县",
                    "id": "29"
                  },
                  {
                    "name": "佛坪县",
                    "id": "30"
                  }
                ]
              },
              {
                "name": "榆林",
                "id": "8",
                "Region": [
                  {
                    "name": "榆阳区",
                    "id": "2"
                  },
                  {
                    "name": "神木县",
                    "id": "21"
                  },
                  {
                    "name": "府谷县",
                    "id": "22"
                  },
                  {
                    "name": "横山县",
                    "id": "23"
                  },
                  {
                    "name": "靖边县",
                    "id": "24"
                  },
                  {
                    "name": "定边县",
                    "id": "25"
                  },
                  {
                    "name": "绥德县",
                    "id": "26"
                  },
                  {
                    "name": "米脂县",
                    "id": "27"
                  },
                  {
                    "name": "佳　县",
                    "id": "28"
                  },
                  {
                    "name": "吴堡县",
                    "id": "29"
                  },
                  {
                    "name": "清涧县",
                    "id": "30"
                  },
                  {
                    "name": "子洲县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "安康",
                "id": "9",
                "Region": [
                  {
                    "name": "汉滨区",
                    "id": "2"
                  },
                  {
                    "name": "汉阴县",
                    "id": "21"
                  },
                  {
                    "name": "石泉县",
                    "id": "22"
                  },
                  {
                    "name": "宁陕县",
                    "id": "23"
                  },
                  {
                    "name": "紫阳县",
                    "id": "24"
                  },
                  {
                    "name": "岚皋县",
                    "id": "25"
                  },
                  {
                    "name": "平利县",
                    "id": "26"
                  },
                  {
                    "name": "镇坪县",
                    "id": "27"
                  },
                  {
                    "name": "旬阳县",
                    "id": "28"
                  },
                  {
                    "name": "白河县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "商洛",
                "id": "10",
                "Region": [
                  {
                    "name": "商州区",
                    "id": "2"
                  },
                  {
                    "name": "洛南县",
                    "id": "21"
                  },
                  {
                    "name": "丹凤县",
                    "id": "22"
                  },
                  {
                    "name": "商南县",
                    "id": "23"
                  },
                  {
                    "name": "山阳县",
                    "id": "24"
                  },
                  {
                    "name": "镇安县",
                    "id": "25"
                  },
                  {
                    "name": "柞水县",
                    "id": "26"
                  }
                ]
              }
            ]
          },
          {
            "name": "甘肃",
            "id": "62",
            "City": [
              {
                "name": "兰州市",
                "id": "1",
                "Region": [
                  {
                    "name": "城关区",
                    "id": "2"
                  },
                  {
                    "name": "七里河区",
                    "id": "3"
                  },
                  {
                    "name": "西固区",
                    "id": "4"
                  },
                  {
                    "name": "安宁区",
                    "id": "5"
                  },
                  {
                    "name": "红古区",
                    "id": "11"
                  },
                  {
                    "name": "永登县",
                    "id": "21"
                  },
                  {
                    "name": "皋兰县",
                    "id": "22"
                  },
                  {
                    "name": "榆中县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "嘉峪关",
                "id": "2",
                "Region": {
                  "name": "嘉峪关市",
                  "id": "0"
                }
              },
              {
                "name": "金昌",
                "id": "3",
                "Region": [
                  {
                    "name": "金川区",
                    "id": "2"
                  },
                  {
                    "name": "永昌县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "白银",
                "id": "4",
                "Region": [
                  {
                    "name": "白银区",
                    "id": "2"
                  },
                  {
                    "name": "平川区",
                    "id": "3"
                  },
                  {
                    "name": "靖远县",
                    "id": "21"
                  },
                  {
                    "name": "会宁县",
                    "id": "22"
                  },
                  {
                    "name": "景泰县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "天水",
                "id": "5",
                "Region": [
                  {
                    "name": "秦州区",
                    "id": "2"
                  },
                  {
                    "name": "麦积区",
                    "id": "3"
                  },
                  {
                    "name": "清水县",
                    "id": "21"
                  },
                  {
                    "name": "秦安县",
                    "id": "22"
                  },
                  {
                    "name": "甘谷县",
                    "id": "23"
                  },
                  {
                    "name": "武山县",
                    "id": "24"
                  },
                  {
                    "name": "张家川回族自治县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "武威",
                "id": "6",
                "Region": [
                  {
                    "name": "凉州区",
                    "id": "2"
                  },
                  {
                    "name": "民勤县",
                    "id": "21"
                  },
                  {
                    "name": "古浪县",
                    "id": "22"
                  },
                  {
                    "name": "天祝藏族自治县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "张掖",
                "id": "7",
                "Region": [
                  {
                    "name": "甘州区",
                    "id": "2"
                  },
                  {
                    "name": "肃南裕固族自治县",
                    "id": "21"
                  },
                  {
                    "name": "民乐县",
                    "id": "22"
                  },
                  {
                    "name": "临泽县",
                    "id": "23"
                  },
                  {
                    "name": "高台县",
                    "id": "24"
                  },
                  {
                    "name": "山丹县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "平凉",
                "id": "8",
                "Region": [
                  {
                    "name": "崆峒区",
                    "id": "2"
                  },
                  {
                    "name": "泾川县",
                    "id": "21"
                  },
                  {
                    "name": "灵台县",
                    "id": "22"
                  },
                  {
                    "name": "崇信县",
                    "id": "23"
                  },
                  {
                    "name": "华亭县",
                    "id": "24"
                  },
                  {
                    "name": "庄浪县",
                    "id": "25"
                  },
                  {
                    "name": "静宁县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "酒泉",
                "id": "9",
                "Region": [
                  {
                    "name": "肃州区",
                    "id": "2"
                  },
                  {
                    "name": "金塔县",
                    "id": "21"
                  },
                  {
                    "name": "瓜州县",
                    "id": "22"
                  },
                  {
                    "name": "肃北蒙古族自治县",
                    "id": "23"
                  },
                  {
                    "name": "阿克塞哈萨克族自治县",
                    "id": "24"
                  },
                  {
                    "name": "玉门市",
                    "id": "81"
                  },
                  {
                    "name": "敦煌市",
                    "id": "82"
                  }
                ]
              },
              {
                "name": "庆阳",
                "id": "10",
                "Region": [
                  {
                    "name": "西峰区",
                    "id": "2"
                  },
                  {
                    "name": "庆城县",
                    "id": "21"
                  },
                  {
                    "name": "环　县",
                    "id": "22"
                  },
                  {
                    "name": "华池县",
                    "id": "23"
                  },
                  {
                    "name": "合水县",
                    "id": "24"
                  },
                  {
                    "name": "正宁县",
                    "id": "25"
                  },
                  {
                    "name": "宁　县",
                    "id": "26"
                  },
                  {
                    "name": "镇原县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "定西",
                "id": "11",
                "Region": [
                  {
                    "name": "安定区",
                    "id": "2"
                  },
                  {
                    "name": "通渭县",
                    "id": "21"
                  },
                  {
                    "name": "陇西县",
                    "id": "22"
                  },
                  {
                    "name": "渭源县",
                    "id": "23"
                  },
                  {
                    "name": "临洮县",
                    "id": "24"
                  },
                  {
                    "name": "漳　县",
                    "id": "25"
                  },
                  {
                    "name": "岷　县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "陇南",
                "id": "12",
                "Region": [
                  {
                    "name": "武都区",
                    "id": "2"
                  },
                  {
                    "name": "成　县",
                    "id": "21"
                  },
                  {
                    "name": "文　县",
                    "id": "22"
                  },
                  {
                    "name": "宕昌县",
                    "id": "23"
                  },
                  {
                    "name": "康　县",
                    "id": "24"
                  },
                  {
                    "name": "西和县",
                    "id": "25"
                  },
                  {
                    "name": "礼　县",
                    "id": "26"
                  },
                  {
                    "name": "徽　县",
                    "id": "27"
                  },
                  {
                    "name": "两当县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "临夏",
                "id": "29",
                "Region": [
                  {
                    "name": "临夏市",
                    "id": "1"
                  },
                  {
                    "name": "临夏县",
                    "id": "21"
                  },
                  {
                    "name": "康乐县",
                    "id": "22"
                  },
                  {
                    "name": "永靖县",
                    "id": "23"
                  },
                  {
                    "name": "广河县",
                    "id": "24"
                  },
                  {
                    "name": "和政县",
                    "id": "25"
                  },
                  {
                    "name": "东乡族自治县",
                    "id": "26"
                  },
                  {
                    "name": "积石山保安族东乡族撒拉族自治县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "甘南",
                "id": "30",
                "Region": [
                  {
                    "name": "合作市",
                    "id": "1"
                  },
                  {
                    "name": "临潭县",
                    "id": "21"
                  },
                  {
                    "name": "卓尼县",
                    "id": "22"
                  },
                  {
                    "name": "舟曲县",
                    "id": "23"
                  },
                  {
                    "name": "迭部县",
                    "id": "24"
                  },
                  {
                    "name": "玛曲县",
                    "id": "25"
                  },
                  {
                    "name": "碌曲县",
                    "id": "26"
                  },
                  {
                    "name": "夏河县",
                    "id": "27"
                  }
                ]
              }
            ]
          },
          {
            "name": "青海",
            "id": "63",
            "City": [
              {
                "name": "西宁",
                "id": "1",
                "Region": [
                  {
                    "name": "城东区",
                    "id": "2"
                  },
                  {
                    "name": "城中区",
                    "id": "3"
                  },
                  {
                    "name": "城西区",
                    "id": "4"
                  },
                  {
                    "name": "城北区",
                    "id": "5"
                  },
                  {
                    "name": "大通回族土族自治县",
                    "id": "21"
                  },
                  {
                    "name": "湟中县",
                    "id": "22"
                  },
                  {
                    "name": "湟源县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "海东",
                "id": "21",
                "Region": [
                  {
                    "name": "平安县",
                    "id": "21"
                  },
                  {
                    "name": "民和回族土族自治县",
                    "id": "22"
                  },
                  {
                    "name": "乐都县",
                    "id": "23"
                  },
                  {
                    "name": "互助土族自治县",
                    "id": "26"
                  },
                  {
                    "name": "化隆回族自治县",
                    "id": "27"
                  },
                  {
                    "name": "循化撒拉族自治县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "海北",
                "id": "22",
                "Region": [
                  {
                    "name": "门源回族自治县",
                    "id": "21"
                  },
                  {
                    "name": "祁连县",
                    "id": "22"
                  },
                  {
                    "name": "海晏县",
                    "id": "23"
                  },
                  {
                    "name": "刚察县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "黄南",
                "id": "23",
                "Region": [
                  {
                    "name": "同仁县",
                    "id": "21"
                  },
                  {
                    "name": "尖扎县",
                    "id": "22"
                  },
                  {
                    "name": "泽库县",
                    "id": "23"
                  },
                  {
                    "name": "河南蒙古族自治县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "海南",
                "id": "25",
                "Region": [
                  {
                    "name": "共和县",
                    "id": "21"
                  },
                  {
                    "name": "同德县",
                    "id": "22"
                  },
                  {
                    "name": "贵德县",
                    "id": "23"
                  },
                  {
                    "name": "兴海县",
                    "id": "24"
                  },
                  {
                    "name": "贵南县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "果洛",
                "id": "26",
                "Region": [
                  {
                    "name": "玛沁县",
                    "id": "21"
                  },
                  {
                    "name": "班玛县",
                    "id": "22"
                  },
                  {
                    "name": "甘德县",
                    "id": "23"
                  },
                  {
                    "name": "达日县",
                    "id": "24"
                  },
                  {
                    "name": "久治县",
                    "id": "25"
                  },
                  {
                    "name": "玛多县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "玉树",
                "id": "27",
                "Region": [
                  {
                    "name": "玉树县",
                    "id": "21"
                  },
                  {
                    "name": "杂多县",
                    "id": "22"
                  },
                  {
                    "name": "称多县",
                    "id": "23"
                  },
                  {
                    "name": "治多县",
                    "id": "24"
                  },
                  {
                    "name": "囊谦县",
                    "id": "25"
                  },
                  {
                    "name": "曲麻莱县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "海西",
                "id": "28",
                "Region": [
                  {
                    "name": "格尔木市",
                    "id": "1"
                  },
                  {
                    "name": "德令哈市",
                    "id": "2"
                  },
                  {
                    "name": "乌兰县",
                    "id": "21"
                  },
                  {
                    "name": "都兰县",
                    "id": "22"
                  },
                  {
                    "name": "天峻县",
                    "id": "23"
                  }
                ]
              }
            ]
          },
          {
            "name": "宁夏",
            "id": "64",
            "City": [
              {
                "name": "银川",
                "id": "1",
                "Region": [
                  {
                    "name": "兴庆区",
                    "id": "4"
                  },
                  {
                    "name": "西夏区",
                    "id": "5"
                  },
                  {
                    "name": "金凤区",
                    "id": "6"
                  },
                  {
                    "name": "永宁县",
                    "id": "21"
                  },
                  {
                    "name": "贺兰县",
                    "id": "22"
                  },
                  {
                    "name": "灵武市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "石嘴山",
                "id": "2",
                "Region": [
                  {
                    "name": "大武口区",
                    "id": "2"
                  },
                  {
                    "name": "惠农区",
                    "id": "5"
                  },
                  {
                    "name": "平罗县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "吴忠",
                "id": "3",
                "Region": [
                  {
                    "name": "利通区",
                    "id": "2"
                  },
                  {
                    "name": "红寺堡区",
                    "id": "3"
                  },
                  {
                    "name": "盐池县",
                    "id": "23"
                  },
                  {
                    "name": "同心县",
                    "id": "24"
                  },
                  {
                    "name": "青铜峡市",
                    "id": "81"
                  }
                ]
              },
              {
                "name": "固原",
                "id": "4",
                "Region": [
                  {
                    "name": "原州区",
                    "id": "2"
                  },
                  {
                    "name": "西吉县",
                    "id": "22"
                  },
                  {
                    "name": "隆德县",
                    "id": "23"
                  },
                  {
                    "name": "泾源县",
                    "id": "24"
                  },
                  {
                    "name": "彭阳县",
                    "id": "25"
                  }
                ]
              },
              {
                "name": "中卫",
                "id": "5",
                "Region": [
                  {
                    "name": "沙坡头区",
                    "id": "2"
                  },
                  {
                    "name": "中宁县",
                    "id": "21"
                  },
                  {
                    "name": "海原县",
                    "id": "22"
                  }
                ]
              }
            ]
          },
          {
            "name": "新疆",
            "id": "65",
            "City": [
              {
                "name": "乌鲁木齐",
                "id": "1",
                "Region": [
                  {
                    "name": "天山区",
                    "id": "2"
                  },
                  {
                    "name": "沙依巴克区",
                    "id": "3"
                  },
                  {
                    "name": "新市区",
                    "id": "4"
                  },
                  {
                    "name": "水磨沟区",
                    "id": "5"
                  },
                  {
                    "name": "头屯河区",
                    "id": "6"
                  },
                  {
                    "name": "达坂城区",
                    "id": "7"
                  },
                  {
                    "name": "米东区",
                    "id": "9"
                  },
                  {
                    "name": "乌鲁木齐县",
                    "id": "21"
                  }
                ]
              },
              {
                "name": "克拉玛依",
                "id": "2",
                "Region": [
                  {
                    "name": "独山子区",
                    "id": "2"
                  },
                  {
                    "name": "克拉玛依区",
                    "id": "3"
                  },
                  {
                    "name": "白碱滩区",
                    "id": "4"
                  },
                  {
                    "name": "乌尔禾区",
                    "id": "5"
                  }
                ]
              },
              {
                "name": "吐鲁番",
                "id": "21",
                "Region": [
                  {
                    "name": "吐鲁番市",
                    "id": "1"
                  },
                  {
                    "name": "鄯善县",
                    "id": "22"
                  },
                  {
                    "name": "托克逊县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "哈密",
                "id": "22",
                "Region": [
                  {
                    "name": "哈密市",
                    "id": "1"
                  },
                  {
                    "name": "巴里坤哈萨克自治县",
                    "id": "22"
                  },
                  {
                    "name": "伊吾县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "昌吉",
                "id": "23",
                "Region": [
                  {
                    "name": "昌吉市",
                    "id": "1"
                  },
                  {
                    "name": "阜康市",
                    "id": "2"
                  },
                  {
                    "name": "呼图壁县",
                    "id": "23"
                  },
                  {
                    "name": "玛纳斯县",
                    "id": "24"
                  },
                  {
                    "name": "奇台县",
                    "id": "25"
                  },
                  {
                    "name": "吉木萨尔县",
                    "id": "27"
                  },
                  {
                    "name": "木垒哈萨克自治县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "博尔塔拉",
                "id": "27",
                "Region": [
                  {
                    "name": "博乐市",
                    "id": "1"
                  },
                  {
                    "name": "精河县",
                    "id": "22"
                  },
                  {
                    "name": "温泉县",
                    "id": "23"
                  }
                ]
              },
              {
                "name": "巴音郭楞",
                "id": "28",
                "Region": [
                  {
                    "name": "库尔勒市",
                    "id": "1"
                  },
                  {
                    "name": "轮台县",
                    "id": "22"
                  },
                  {
                    "name": "尉犁县",
                    "id": "23"
                  },
                  {
                    "name": "若羌县",
                    "id": "24"
                  },
                  {
                    "name": "且末县",
                    "id": "25"
                  },
                  {
                    "name": "焉耆回族自治县",
                    "id": "26"
                  },
                  {
                    "name": "和静县",
                    "id": "27"
                  },
                  {
                    "name": "和硕县",
                    "id": "28"
                  },
                  {
                    "name": "博湖县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "阿克苏",
                "id": "29",
                "Region": [
                  {
                    "name": "阿克苏市",
                    "id": "1"
                  },
                  {
                    "name": "温宿县",
                    "id": "22"
                  },
                  {
                    "name": "库车县",
                    "id": "23"
                  },
                  {
                    "name": "沙雅县",
                    "id": "24"
                  },
                  {
                    "name": "新和县",
                    "id": "25"
                  },
                  {
                    "name": "拜城县",
                    "id": "26"
                  },
                  {
                    "name": "乌什县",
                    "id": "27"
                  },
                  {
                    "name": "阿瓦提县",
                    "id": "28"
                  },
                  {
                    "name": "柯坪县",
                    "id": "29"
                  }
                ]
              },
              {
                "name": "克孜勒苏",
                "id": "30",
                "Region": [
                  {
                    "name": "阿图什市",
                    "id": "1"
                  },
                  {
                    "name": "阿克陶县",
                    "id": "22"
                  },
                  {
                    "name": "阿合奇县",
                    "id": "23"
                  },
                  {
                    "name": "乌恰县",
                    "id": "24"
                  }
                ]
              },
              {
                "name": "喀什",
                "id": "31",
                "Region": [
                  {
                    "name": "喀什市",
                    "id": "1"
                  },
                  {
                    "name": "疏附县",
                    "id": "21"
                  },
                  {
                    "name": "疏勒县",
                    "id": "22"
                  },
                  {
                    "name": "英吉沙县",
                    "id": "23"
                  },
                  {
                    "name": "泽普县",
                    "id": "24"
                  },
                  {
                    "name": "莎车县",
                    "id": "25"
                  },
                  {
                    "name": "叶城县",
                    "id": "26"
                  },
                  {
                    "name": "麦盖提县",
                    "id": "27"
                  },
                  {
                    "name": "岳普湖县",
                    "id": "28"
                  },
                  {
                    "name": "伽师县",
                    "id": "29"
                  },
                  {
                    "name": "巴楚县",
                    "id": "30"
                  },
                  {
                    "name": "塔什库尔干塔吉克自治县",
                    "id": "31"
                  }
                ]
              },
              {
                "name": "和田",
                "id": "32",
                "Region": [
                  {
                    "name": "和田市",
                    "id": "1"
                  },
                  {
                    "name": "和田县",
                    "id": "21"
                  },
                  {
                    "name": "墨玉县",
                    "id": "22"
                  },
                  {
                    "name": "皮山县",
                    "id": "23"
                  },
                  {
                    "name": "洛浦县",
                    "id": "24"
                  },
                  {
                    "name": "策勒县",
                    "id": "25"
                  },
                  {
                    "name": "于田县",
                    "id": "26"
                  },
                  {
                    "name": "民丰县",
                    "id": "27"
                  }
                ]
              },
              {
                "name": "伊犁",
                "id": "40",
                "Region": [
                  {
                    "name": "伊宁市",
                    "id": "2"
                  },
                  {
                    "name": "奎屯市",
                    "id": "3"
                  },
                  {
                    "name": "伊宁县",
                    "id": "21"
                  },
                  {
                    "name": "察布查尔锡伯自治县",
                    "id": "22"
                  },
                  {
                    "name": "霍城县",
                    "id": "23"
                  },
                  {
                    "name": "巩留县",
                    "id": "24"
                  },
                  {
                    "name": "新源县",
                    "id": "25"
                  },
                  {
                    "name": "昭苏县",
                    "id": "26"
                  },
                  {
                    "name": "特克斯县",
                    "id": "27"
                  },
                  {
                    "name": "尼勒克县",
                    "id": "28"
                  }
                ]
              },
              {
                "name": "塔城",
                "id": "42",
                "Region": [
                  {
                    "name": "塔城市",
                    "id": "1"
                  },
                  {
                    "name": "乌苏市",
                    "id": "2"
                  },
                  {
                    "name": "额敏县",
                    "id": "21"
                  },
                  {
                    "name": "沙湾县",
                    "id": "23"
                  },
                  {
                    "name": "托里县",
                    "id": "24"
                  },
                  {
                    "name": "裕民县",
                    "id": "25"
                  },
                  {
                    "name": "和布克赛尔蒙古自治县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "阿勒泰",
                "id": "43",
                "Region": [
                  {
                    "name": "阿勒泰市",
                    "id": "1"
                  },
                  {
                    "name": "布尔津县",
                    "id": "21"
                  },
                  {
                    "name": "富蕴县",
                    "id": "22"
                  },
                  {
                    "name": "福海县",
                    "id": "23"
                  },
                  {
                    "name": "哈巴河县",
                    "id": "24"
                  },
                  {
                    "name": "青河县",
                    "id": "25"
                  },
                  {
                    "name": "吉木乃县",
                    "id": "26"
                  }
                ]
              },
              {
                "name": "石河子",
                "id": "91"
              },
              {
                "name": "阿拉尔",
                "id": "92"
              },
              {
                "name": "图木舒克",
                "id": "93"
              },
              {
                "name": "五家渠",
                "id": "94"
              },
              {
                "name": "北屯",
                "id": "95"
              }
            ]
          },
          {
            "name": "台湾",
            "id": "71",
            "City": [
              {
                "name": "台北市",
                "id": "1"
              },
              {
                "name": "高雄市",
                "id": "2"
              },
              {
                "name": "基隆市",
                "id": "3"
              },
              {
                "name": "台中市",
                "id": "4"
              },
              {
                "name": "台南市",
                "id": "5"
              },
              {
                "name": "新竹市",
                "id": "6"
              },
              {
                "name": "嘉义市",
                "id": "7"
              },
              {
                "name": "台北县",
                "id": "8"
              },
              {
                "name": "宜兰县",
                "id": "9"
              },
              {
                "name": "桃园县",
                "id": "10"
              },
              {
                "name": "新竹县",
                "id": "11"
              },
              {
                "name": "苗栗县",
                "id": "12"
              },
              {
                "name": "台中县",
                "id": "13"
              },
              {
                "name": "彰化县",
                "id": "14"
              },
              {
                "name": "南投县",
                "id": "15"
              },
              {
                "name": "云林县",
                "id": "16"
              },
              {
                "name": "嘉义县",
                "id": "17"
              },
              {
                "name": "台南县",
                "id": "18"
              },
              {
                "name": "高雄县",
                "id": "19"
              },
              {
                "name": "屏东县",
                "id": "20"
              },
              {
                "name": "台东县",
                "id": "22"
              },
              {
                "name": "花莲县",
                "id": "23"
              },
              {
                "name": "澎湖县",
                "id": "21"
              }
            ]
          },
          {
            "name": "香港",
            "id": "81",
            "City": [
              {
                "name": "中西区",
                "id": "HCW"
              },
              {
                "name": "东区",
                "id": "HEA"
              },
              {
                "name": "九龙城区",
                "id": "KKC"
              },
              {
                "name": "观塘区",
                "id": "KKT"
              },
              {
                "name": "南区",
                "id": "HSO"
              },
              {
                "name": "深水埗区",
                "id": "KSS"
              },
              {
                "name": "黄大仙区",
                "id": "KWT"
              },
              {
                "name": "湾仔区",
                "id": "HWC"
              },
              {
                "name": "油尖旺区",
                "id": "KYT"
              },
              {
                "name": "离岛区",
                "id": "NIS"
              },
              {
                "name": "葵青区",
                "id": "NKT"
              },
              {
                "name": "北区",
                "id": "NNO"
              },
              {
                "name": "西贡区",
                "id": "NSK"
              },
              {
                "name": "沙田区",
                "id": "NST"
              },
              {
                "name": "屯门区",
                "id": "NTM"
              },
              {
                "name": "大埔区",
                "id": "NTP"
              },
              {
                "name": "荃湾区",
                "id": "NTW"
              },
              {
                "name": "元朗区",
                "id": "NYL"
              }
            ]
          },
          {
            "name": "澳门",
            "id": "82",
            "City": [
              {
                "name": "花地玛堂区",
                "id": "OLF"
              },
              {
                "name": "圣安多尼堂区",
                "id": "ANT"
              },
              {
                "name": "大堂区",
                "id": "CAT"
              },
              {
                "name": "望德堂区",
                "id": "LAW"
              },
              {
                "name": "风顺堂区",
                "id": "LAZ"
              },
              {
                "name": "氹仔",
                "id": "TPA"
              },
              {
                "name": "路环",
                "id": "CLN"
              }
            ]
          }
        ]
      },
      {
        "name": "阿尔巴尼亚",
        "id": "ALB",
        "State": {
          "City": [
            {
              "name": "爱尔巴桑",
              "id": "EL"
            },
            {
              "name": "迪勃拉",
              "id": "DI"
            },
            {
              "name": "地拉那",
              "id": "TR"
            },
            {
              "name": "都拉斯",
              "id": "DR"
            },
            {
              "name": "发罗拉",
              "id": "VL"
            },
            {
              "name": "费里",
              "id": "FR"
            },
            {
              "name": "吉诺卡斯特",
              "id": "GJ"
            },
            {
              "name": "科尔察",
              "id": "KO"
            },
            {
              "name": "库克斯",
              "id": "KU"
            },
            {
              "name": "莱什",
              "id": "LE"
            },
            {
              "name": "培拉特",
              "id": "BR"
            },
            {
              "name": "斯库台",
              "id": "SH"
            }
          ]
        }
      },
      {
        "name": "阿尔及利亚",
        "id": "DZA",
        "State": {
          "City": [
            {
              "name": "阿德拉尔",
              "id": "ADR"
            },
            {
              "name": "阿尔及尔",
              "id": "ALG"
            },
            {
              "name": "艾因·德夫拉",
              "id": "ADE"
            },
            {
              "name": "艾因·蒂姆尚特",
              "id": "ATE"
            },
            {
              "name": "安纳巴",
              "id": "AAE"
            },
            {
              "name": "奥兰",
              "id": "ORA"
            },
            {
              "name": "巴特纳",
              "id": "BAT"
            },
            {
              "name": "贝贾亚",
              "id": "BJA"
            },
            {
              "name": "贝沙尔",
              "id": "BEC"
            },
            {
              "name": "贝伊德",
              "id": "EBA"
            },
            {
              "name": "比斯克拉",
              "id": "BIS"
            },
            {
              "name": "布尔吉·布阿雷里吉",
              "id": "BOR"
            },
            {
              "name": "布利达",
              "id": "BLI"
            },
            {
              "name": "布迈德斯",
              "id": "BOU"
            },
            {
              "name": "布依拉",
              "id": "BOA"
            },
            {
              "name": "蒂巴扎",
              "id": "TIP"
            },
            {
              "name": "蒂斯姆西勒特",
              "id": "TIS"
            },
            {
              "name": "盖尔达耶",
              "id": "GHA"
            },
            {
              "name": "盖尔马",
              "id": "GUE"
            },
            {
              "name": "罕西拉",
              "id": "KHE"
            },
            {
              "name": "赫利赞",
              "id": "REL"
            },
            {
              "name": "吉杰尔",
              "id": "JIJ"
            },
            {
              "name": "杰勒法",
              "id": "DJE"
            },
            {
              "name": "君士坦丁",
              "id": "CZL"
            },
            {
              "name": "拉格瓦特",
              "id": "LAG"
            },
            {
              "name": "马斯卡拉",
              "id": "MUA"
            },
            {
              "name": "麦迪亚",
              "id": "MED"
            },
            {
              "name": "密拉",
              "id": "MIL"
            },
            {
              "name": "莫斯塔加纳姆",
              "id": "MOS"
            },
            {
              "name": "姆西拉",
              "id": "MSI"
            },
            {
              "name": "纳阿马",
              "id": "NAA"
            },
            {
              "name": "塞蒂夫",
              "id": "SET"
            },
            {
              "name": "赛伊达",
              "id": "SAI"
            },
            {
              "name": "斯基克达",
              "id": "SKI"
            },
            {
              "name": "苏克·阿赫拉斯",
              "id": "SAH"
            },
            {
              "name": "塔里夫",
              "id": "ETA"
            },
            {
              "name": "塔曼拉塞特",
              "id": "TAM"
            },
            {
              "name": "特贝萨",
              "id": "TEB"
            },
            {
              "name": "特莱姆森",
              "id": "TLE"
            },
            {
              "name": "提济乌祖",
              "id": "IOU"
            },
            {
              "name": "提亚雷特",
              "id": "TIA"
            },
            {
              "name": "廷杜夫",
              "id": "TIN"
            },
            {
              "name": "瓦德",
              "id": "EOU"
            },
            {
              "name": "瓦尔格拉",
              "id": "OUA"
            },
            {
              "name": "乌姆布阿基",
              "id": "OEB"
            },
            {
              "name": "西迪贝勒阿贝斯",
              "id": "SBA"
            },
            {
              "name": "谢里夫",
              "id": "CHL"
            },
            {
              "name": "伊利齐",
              "id": "ILL"
            }
          ]
        }
      },
      {
        "name": "阿富汗",
        "id": "AFG",
        "State": {
          "City": [
            {
              "name": "赫拉特",
              "id": "HEA"
            },
            {
              "name": "喀布尔",
              "id": "KBL"
            },
            {
              "name": "坎大哈",
              "id": "KDH"
            },
            {
              "name": "马扎里沙里夫",
              "id": "MZR"
            }
          ]
        }
      },
      {
        "name": "阿根廷",
        "id": "ARG",
        "State": {
          "City": [
            {
              "name": "巴拉那",
              "id": "PRA"
            },
            {
              "name": "别德马",
              "id": "VDM"
            },
            {
              "name": "波萨达斯",
              "id": "PSS"
            },
            {
              "name": "布兰卡港",
              "id": "BHI"
            },
            {
              "name": "布宜诺斯艾利斯",
              "id": "BUE"
            },
            {
              "name": "福莫萨",
              "id": "FMA"
            },
            {
              "name": "胡胡伊",
              "id": "JUJ"
            },
            {
              "name": "卡塔马卡",
              "id": "CTC"
            },
            {
              "name": "科尔多瓦",
              "id": "COR"
            },
            {
              "name": "科连特斯",
              "id": "CNQ"
            },
            {
              "name": "克劳斯城",
              "id": "VLK"
            },
            {
              "name": "肯考迪娅",
              "id": "COC"
            },
            {
              "name": "拉里奥哈",
              "id": "IRJ"
            },
            {
              "name": "拉普拉塔",
              "id": "LPG"
            },
            {
              "name": "雷西斯滕匹亚",
              "id": "RES"
            },
            {
              "name": "里奥加耶戈斯",
              "id": "RGL"
            },
            {
              "name": "里奥夸尔托",
              "id": "RCU"
            },
            {
              "name": "里瓦达维亚海军准将城",
              "id": "CRD"
            },
            {
              "name": "罗萨里奥",
              "id": "ROS"
            },
            {
              "name": "罗森",
              "id": "RWO"
            },
            {
              "name": "马德普拉塔",
              "id": "MDQ"
            },
            {
              "name": "门多萨",
              "id": "MDZ"
            },
            {
              "name": "内乌肯",
              "id": "NQN"
            },
            {
              "name": "萨尔塔",
              "id": "SLA"
            },
            {
              "name": "圣地亚哥德尔埃斯特罗",
              "id": "SDE"
            },
            {
              "name": "圣菲",
              "id": "SFN"
            },
            {
              "name": "圣胡安",
              "id": "UAQ"
            },
            {
              "name": "圣拉斐尔",
              "id": "AFA"
            },
            {
              "name": "圣路易斯",
              "id": "LUQ"
            },
            {
              "name": "圣罗莎",
              "id": "RSA"
            },
            {
              "name": "圣米格尔德图库曼",
              "id": "SMC"
            },
            {
              "name": "圣尼古拉斯",
              "id": "SNS"
            },
            {
              "name": "特雷利乌",
              "id": "REL"
            },
            {
              "name": "乌斯怀亚",
              "id": "USH"
            }
          ]
        }
      },
      {
        "name": "阿拉伯联合酋长国",
        "id": "ARE",
        "State": {
          "City": [
            {
              "name": "阿布扎比",
              "id": "AZ"
            },
            {
              "name": "艾因",
              "id": "AL"
            },
            {
              "name": "迪拜",
              "id": "DU"
            },
            {
              "name": "沙迦",
              "id": "SH"
            }
          ]
        }
      },
      {
        "name": "阿鲁巴",
        "id": "ABW"
      },
      {
        "name": "阿曼",
        "id": "OMN",
        "State": {
          "City": [
            {
              "name": "巴提奈地区",
              "id": "BA"
            },
            {
              "name": "达希莱地区",
              "id": "ZA"
            },
            {
              "name": "东部地区",
              "id": "SH"
            },
            {
              "name": "马斯喀特省",
              "id": "MA"
            },
            {
              "name": "穆桑达姆省",
              "id": "MU"
            },
            {
              "name": "内地地区",
              "id": "DA"
            },
            {
              "name": "中部地区",
              "id": "WU"
            },
            {
              "name": "佐法尔省",
              "id": "ZU"
            }
          ]
        }
      },
      {
        "name": "阿塞拜疆",
        "id": "AZE",
        "State": {
          "City": [
            {
              "name": "阿布歇隆",
              "id": "ABS"
            },
            {
              "name": "哈奇马斯",
              "id": "XAC"
            },
            {
              "name": "卡尔巴卡尔",
              "id": "KAL"
            },
            {
              "name": "卡扎赫",
              "id": "QAZ"
            },
            {
              "name": "连科兰",
              "id": "LAN"
            },
            {
              "name": "密尔卡拉巴赫",
              "id": "MQA"
            },
            {
              "name": "穆甘萨连",
              "id": "MSA"
            },
            {
              "name": "纳戈尔诺－卡拉巴赫",
              "id": "NQA"
            },
            {
              "name": "纳希切万",
              "id": "NX"
            },
            {
              "name": "普利亚拉克斯",
              "id": "PRI"
            },
            {
              "name": "舍基",
              "id": "SA"
            },
            {
              "name": "苏姆盖特",
              "id": "SMC"
            },
            {
              "name": "锡尔万",
              "id": "SIR"
            },
            {
              "name": "占贾",
              "id": "GA"
            }
          ]
        }
      },
      {
        "name": "阿森松岛",
        "id": "ASC"
      },
      {
        "name": "埃及",
        "id": "EGY",
        "State": {
          "City": [
            {
              "name": "阿斯旺",
              "id": "ASW"
            },
            {
              "name": "古尔代盖",
              "id": "GBY"
            },
            {
              "name": "开罗",
              "id": "CAI"
            },
            {
              "name": "苏布拉开马",
              "id": "SKH"
            },
            {
              "name": "亚历山大",
              "id": "ALY"
            }
          ]
        }
      },
      {
        "name": "埃塞俄比亚",
        "id": "ETH",
        "State": {
          "City": [
            {
              "name": "阿法尔",
              "id": "AF"
            },
            {
              "name": "阿姆哈拉",
              "id": "AH"
            },
            {
              "name": "奥罗米亚",
              "id": "OR"
            },
            {
              "name": "宾香古尔",
              "id": "BG"
            },
            {
              "name": "德雷达瓦",
              "id": "DD"
            },
            {
              "name": "甘贝拉各族",
              "id": "GB"
            },
            {
              "name": "哈勒里民族",
              "id": "HR"
            },
            {
              "name": "南方各族",
              "id": "SN"
            },
            {
              "name": "索马里",
              "id": "SM"
            },
            {
              "name": "提格雷",
              "id": "TG"
            },
            {
              "name": "亚的斯亚贝巴",
              "id": "AA"
            }
          ]
        }
      },
      {
        "name": "爱尔兰",
        "id": "IRL",
        "State": {
          "City": [
            {
              "name": "奥法利",
              "id": "OF"
            },
            {
              "name": "蒂珀雷里",
              "id": "TP"
            },
            {
              "name": "都柏林",
              "id": "DB"
            },
            {
              "name": "多内加尔",
              "id": "DG"
            },
            {
              "name": "戈尔韦",
              "id": "GW"
            },
            {
              "name": "基尔代尔",
              "id": "KD"
            },
            {
              "name": "基尔肯尼",
              "id": "KK"
            },
            {
              "name": "卡范",
              "id": "CV"
            },
            {
              "name": "卡洛",
              "id": "CW"
            },
            {
              "name": "凯里",
              "id": "KR"
            },
            {
              "name": "科克",
              "id": "CK"
            },
            {
              "name": "克莱尔",
              "id": "CL"
            },
            {
              "name": "朗福德",
              "id": "LF"
            },
            {
              "name": "劳斯",
              "id": "LT"
            },
            {
              "name": "崂斯",
              "id": "LA"
            },
            {
              "name": "利默里克",
              "id": "LM"
            },
            {
              "name": "利特里姆",
              "id": "LR"
            },
            {
              "name": "罗斯康芒",
              "id": "RC"
            },
            {
              "name": "梅奥",
              "id": "MY"
            },
            {
              "name": "米斯",
              "id": "MT"
            },
            {
              "name": "莫内根",
              "id": "MG"
            },
            {
              "name": "斯莱戈",
              "id": "SL"
            },
            {
              "name": "威克洛",
              "id": "WK"
            },
            {
              "name": "韦克斯福德",
              "id": "WX"
            },
            {
              "name": "沃特福德",
              "id": "WF"
            },
            {
              "name": "西米斯",
              "id": "WM"
            }
          ]
        }
      },
      {
        "name": "爱沙尼亚",
        "id": "EST",
        "State": {
          "City": [
            {
              "name": "贝尔瓦",
              "id": "65"
            },
            {
              "name": "哈留",
              "id": "37"
            },
            {
              "name": "拉普拉",
              "id": "70"
            },
            {
              "name": "里亚内",
              "id": "57"
            },
            {
              "name": "帕尔努",
              "id": "67"
            },
            {
              "name": "萨雷",
              "id": "74"
            },
            {
              "name": "塔尔图",
              "id": "78"
            },
            {
              "name": "瓦尔加",
              "id": "82"
            },
            {
              "name": "维良地",
              "id": "84"
            },
            {
              "name": "维鲁",
              "id": "59"
            },
            {
              "name": "沃鲁",
              "id": "86"
            },
            {
              "name": "希尤",
              "id": "39"
            },
            {
              "name": "耶尔韦",
              "id": "51"
            },
            {
              "name": "耶盖瓦",
              "id": "49"
            },
            {
              "name": "依达－维鲁",
              "id": "44"
            }
          ]
        }
      },
      {
        "name": "安道尔",
        "id": "AND",
        "State": {
          "City": [
            {
              "name": "安道尔城",
              "id": "7"
            },
            {
              "name": "奥尔迪诺",
              "id": "5"
            },
            {
              "name": "恩坎普",
              "id": "3"
            },
            {
              "name": "卡尼略",
              "id": "2"
            },
            {
              "name": "莱塞斯卡尔德－恩戈尔达",
              "id": "8"
            },
            {
              "name": "马萨纳",
              "id": "4"
            },
            {
              "name": "圣胡利娅－德洛里亚",
              "id": "6"
            }
          ]
        }
      },
      {
        "name": "安哥拉",
        "id": "AGO",
        "State": {
          "City": [
            {
              "name": "北宽扎",
              "id": "CNO"
            },
            {
              "name": "北隆达",
              "id": "LNO"
            },
            {
              "name": "本戈",
              "id": "BGO"
            },
            {
              "name": "本格拉",
              "id": "BGU"
            },
            {
              "name": "比耶",
              "id": "BIE"
            },
            {
              "name": "卡宾达",
              "id": "CAB"
            },
            {
              "name": "库内内",
              "id": "CNN"
            },
            {
              "name": "宽多库邦戈",
              "id": "CCU"
            },
            {
              "name": "罗安达",
              "id": "LUA"
            },
            {
              "name": "马兰热",
              "id": "MAL"
            },
            {
              "name": "莫希科",
              "id": "MOX"
            },
            {
              "name": "纳米贝",
              "id": "NAM"
            },
            {
              "name": "南宽扎",
              "id": "CUS"
            },
            {
              "name": "南隆达",
              "id": "LSU"
            },
            {
              "name": "万博",
              "id": "HUA"
            },
            {
              "name": "威拉",
              "id": "HUI"
            },
            {
              "name": "威热",
              "id": "UIG"
            },
            {
              "name": "扎伊尔",
              "id": "ZAI"
            }
          ]
        }
      },
      {
        "name": "安圭拉",
        "id": "AIA"
      },
      {
        "name": "安提瓜岛和巴布达",
        "id": "ATG"
      },
      {
        "name": "澳大利亚",
        "id": "AUS",
        "State": [
          {
            "name": "北部地区",
            "id": "NT",
            "City": [
              {
                "name": "北帕默斯顿",
                "id": "PAL"
              },
              {
                "name": "达尔文",
                "id": "DRW"
              }
            ]
          },
          {
            "name": "堪培拉",
            "id": "ACT",
            "City": {
              "name": "堪培拉",
              "id": "CBR"
            }
          },
          {
            "name": "昆士兰",
            "id": "QLD",
            "City": [
              {
                "name": "布里斯班",
                "id": "BNE"
              },
              {
                "name": "黄金海岸",
                "id": "OOL"
              },
              {
                "name": "凯恩斯",
                "id": "CNS"
              },
              {
                "name": "日光海岸",
                "id": "CUD"
              },
              {
                "name": "汤斯维尔",
                "id": "TSV"
              },
              {
                "name": "图文巴",
                "id": "TWB"
              }
            ]
          },
          {
            "name": "南澳大利亚",
            "id": "SA",
            "City": [
              {
                "name": "阿德莱德",
                "id": "ADL"
              },
              {
                "name": "奥古斯塔港",
                "id": "PUG"
              },
              {
                "name": "甘比亚山",
                "id": "MGB"
              },
              {
                "name": "怀阿拉",
                "id": "WAY"
              },
              {
                "name": "林肯港",
                "id": "PLO"
              },
              {
                "name": "默里布里奇",
                "id": "MYB"
              },
              {
                "name": "皮里港",
                "id": "PPI"
              },
              {
                "name": "维克托港",
                "id": "VHA"
              }
            ]
          },
          {
            "name": "塔斯马尼亚",
            "id": "TAS",
            "City": [
              {
                "name": "伯尼港",
                "id": "BWT"
              },
              {
                "name": "德文波特",
                "id": "DPO"
              },
              {
                "name": "霍巴特",
                "id": "HBA"
              },
              {
                "name": "朗塞斯顿",
                "id": "LST"
              }
            ]
          },
          {
            "name": "维多利亚",
            "id": "VIC",
            "City": [
              {
                "name": "吉朗",
                "id": "GEX"
              },
              {
                "name": "墨尔本",
                "id": "MEL"
              }
            ]
          },
          {
            "name": "西澳大利亚",
            "id": "WA",
            "City": [
              {
                "name": "奥尔巴尼",
                "id": "ALH"
              },
              {
                "name": "班伯里",
                "id": "BUY"
              },
              {
                "name": "弗里曼特尔港",
                "id": "FRE"
              },
              {
                "name": "杰拉尔顿",
                "id": "GET"
              },
              {
                "name": "卡尔古利",
                "id": "KGI"
              },
              {
                "name": "曼哲拉",
                "id": "MDU"
              },
              {
                "name": "珀斯",
                "id": "PER"
              }
            ]
          },
          {
            "name": "新南威尔士",
            "id": "NSW",
            "City": [
              {
                "name": "纽卡斯尔",
                "id": "NTL"
              },
              {
                "name": "伍伦贡",
                "id": "WOL"
              },
              {
                "name": "悉尼",
                "id": "HBS"
              }
            ]
          }
        ]
      },
      {
        "name": "奥地利",
        "id": "AUT",
        "State": {
          "City": [
            {
              "name": "布尔根兰",
              "id": "BUR"
            },
            {
              "name": "蒂罗尔",
              "id": "TYR"
            },
            {
              "name": "福拉尔贝格",
              "id": "VOR"
            },
            {
              "name": "克恩顿",
              "id": "CAT"
            },
            {
              "name": "萨尔茨堡",
              "id": "SZG"
            },
            {
              "name": "上奥地利",
              "id": "UAU"
            },
            {
              "name": "施蒂利亚",
              "id": "STY"
            },
            {
              "name": "维也纳",
              "id": "VDD"
            },
            {
              "name": "下奥地利",
              "id": "LAU"
            }
          ]
        }
      },
      {
        "name": "奥兰群岛",
        "id": "ALA"
      },
      {
        "name": "巴巴多斯岛",
        "id": "BRB"
      },
      {
        "name": "巴布亚新几内亚",
        "id": "PNG",
        "State": {
          "City": [
            {
              "name": "北部",
              "id": "NO"
            },
            {
              "name": "布干维尔",
              "id": "BV"
            },
            {
              "name": "东部高地",
              "id": "EH"
            },
            {
              "name": "东塞皮克",
              "id": "ES"
            },
            {
              "name": "东新不列颠",
              "id": "EB"
            },
            {
              "name": "恩加",
              "id": "EN"
            },
            {
              "name": "海湾",
              "id": "GU"
            },
            {
              "name": "马当",
              "id": "MD"
            },
            {
              "name": "马努斯",
              "id": "MN"
            },
            {
              "name": "米尔恩湾",
              "id": "MB"
            },
            {
              "name": "莫尔兹比港",
              "id": "NC"
            },
            {
              "name": "莫罗贝",
              "id": "MR"
            },
            {
              "name": "南部高地",
              "id": "SH"
            },
            {
              "name": "钦布",
              "id": "SI"
            },
            {
              "name": "桑道恩",
              "id": "SA"
            },
            {
              "name": "西部",
              "id": "WE"
            },
            {
              "name": "西部高地",
              "id": "WH"
            },
            {
              "name": "西新不列颠",
              "id": "WB"
            },
            {
              "name": "新爱尔兰",
              "id": "NI"
            }
          ]
        }
      },
      {
        "name": "巴哈马",
        "id": "BHS"
      },
      {
        "name": "巴基斯坦",
        "id": "PAK",
        "State": {
          "City": [
            {
              "name": "白沙瓦",
              "id": "PEW"
            },
            {
              "name": "费萨拉巴德",
              "id": "LYP"
            },
            {
              "name": "故吉软瓦拉",
              "id": "GUJ"
            },
            {
              "name": "海德拉巴",
              "id": "HDD"
            },
            {
              "name": "卡拉奇",
              "id": "KCT"
            },
            {
              "name": "拉合尔",
              "id": "LHE"
            },
            {
              "name": "拉瓦尔品第",
              "id": "RWP"
            },
            {
              "name": "木尔坦",
              "id": "MUX"
            },
            {
              "name": "伊斯兰堡",
              "id": "ISB"
            }
          ]
        }
      },
      {
        "name": "巴拉圭",
        "id": "PRY",
        "State": {
          "City": [
            {
              "name": "阿曼拜",
              "id": "AM"
            },
            {
              "name": "阿耶斯总统省",
              "id": "PH"
            },
            {
              "name": "巴拉瓜里",
              "id": "PA"
            },
            {
              "name": "博克龙",
              "id": "BO"
            },
            {
              "name": "瓜伊拉",
              "id": "GU"
            },
            {
              "name": "卡瓜苏",
              "id": "CG"
            },
            {
              "name": "卡嫩迪尤",
              "id": "CN"
            },
            {
              "name": "卡萨帕",
              "id": "CZ"
            },
            {
              "name": "康塞普西翁",
              "id": "CC"
            },
            {
              "name": "科迪勒拉",
              "id": "CD"
            },
            {
              "name": "米西奥内斯",
              "id": "MI"
            },
            {
              "name": "涅恩布库",
              "id": "NE"
            },
            {
              "name": "上巴拉圭",
              "id": "AG"
            },
            {
              "name": "上巴拉那",
              "id": "AN"
            },
            {
              "name": "圣佩德罗",
              "id": "SP"
            },
            {
              "name": "亚松森特别区",
              "id": "AS"
            },
            {
              "name": "伊塔普亚",
              "id": "IT"
            },
            {
              "name": "中央",
              "id": "CE"
            }
          ]
        }
      },
      {
        "name": "巴勒斯坦",
        "id": "PSE",
        "State": {
          "City": [
            {
              "name": "加沙地带",
              "id": "GZ"
            },
            {
              "name": "西岸",
              "id": "WE"
            }
          ]
        }
      },
      {
        "name": "巴林",
        "id": "BHR",
        "State": {
          "City": [
            {
              "name": "北部",
              "id": "5"
            },
            {
              "name": "哈德",
              "id": "1"
            },
            {
              "name": "哈马德",
              "id": "12"
            },
            {
              "name": "里法",
              "id": "9"
            },
            {
              "name": "麦纳麦",
              "id": "3"
            },
            {
              "name": "穆哈拉格",
              "id": "2"
            },
            {
              "name": "西部",
              "id": "10"
            },
            {
              "name": "伊萨城",
              "id": "8"
            },
            {
              "name": "中部",
              "id": "7"
            }
          ]
        }
      },
      {
        "name": "巴拿马",
        "id": "PAN"
      },
      {
        "name": "巴西",
        "id": "BRA",
        "State": {
          "City": [
            {
              "name": "阿克里",
              "id": "AC"
            },
            {
              "name": "阿拉戈斯",
              "id": "AL"
            },
            {
              "name": "阿马帕",
              "id": "AP"
            },
            {
              "name": "巴拉那",
              "id": "PR"
            },
            {
              "name": "巴西利亚",
              "id": "BSB"
            },
            {
              "name": "巴伊亚",
              "id": "BA"
            },
            {
              "name": "北里奥格兰德",
              "id": "RN"
            },
            {
              "name": "伯南布哥",
              "id": "PE"
            },
            {
              "name": "戈亚斯",
              "id": "GO"
            },
            {
              "name": "朗多尼亚",
              "id": "RO"
            },
            {
              "name": "里约热内卢",
              "id": "RJ"
            },
            {
              "name": "罗赖马",
              "id": "RR"
            },
            {
              "name": "马拉尼昂",
              "id": "MA"
            },
            {
              "name": "马托格罗索",
              "id": "MT"
            },
            {
              "name": "米纳斯吉拉斯",
              "id": "MG"
            },
            {
              "name": "南里奥格兰德",
              "id": "RS"
            },
            {
              "name": "南马托格罗索",
              "id": "MS"
            },
            {
              "name": "帕拉",
              "id": "PA"
            },
            {
              "name": "帕拉伊巴",
              "id": "PB"
            },
            {
              "name": "皮奥伊",
              "id": "PI"
            },
            {
              "name": "塞阿拉",
              "id": "CE"
            },
            {
              "name": "塞尔希培",
              "id": "SE"
            },
            {
              "name": "圣埃斯皮里图",
              "id": "ES"
            },
            {
              "name": "圣保罗",
              "id": "SP"
            },
            {
              "name": "圣卡塔琳娜",
              "id": "SC"
            },
            {
              "name": "托坎廷斯",
              "id": "TO"
            },
            {
              "name": "亚马孙",
              "id": "AM"
            }
          ]
        }
      },
      {
        "name": "白俄罗斯",
        "id": "BLR",
        "State": {
          "City": [
            {
              "name": "布列斯特",
              "id": "BR"
            },
            {
              "name": "戈梅利",
              "id": "HO"
            },
            {
              "name": "格罗德诺",
              "id": "HR"
            },
            {
              "name": "明斯克市",
              "id": "MI"
            },
            {
              "name": "莫吉廖夫",
              "id": "MA"
            },
            {
              "name": "维捷布斯克",
              "id": "VI"
            }
          ]
        }
      },
      {
        "name": "百慕大",
        "id": "BMU"
      },
      {
        "name": "保加利亚",
        "id": "BGR",
        "State": {
          "City": [
            {
              "name": "布尔加斯",
              "id": "BOJ"
            },
            {
              "name": "卡斯科伏",
              "id": "KHO"
            },
            {
              "name": "鲁塞",
              "id": "ROU"
            },
            {
              "name": "洛维奇",
              "id": "LVP"
            },
            {
              "name": "蒙塔纳",
              "id": "OZA"
            },
            {
              "name": "普罗夫迪夫",
              "id": "PDV"
            },
            {
              "name": "索非亚",
              "id": "SOF"
            },
            {
              "name": "索非亚市",
              "id": "GSO"
            },
            {
              "name": "瓦尔纳",
              "id": "VAR"
            }
          ]
        }
      },
      {
        "name": "北马里亚纳群岛",
        "id": "MNP"
      },
      {
        "name": "贝宁",
        "id": "BEN",
        "State": {
          "City": [
            {
              "name": "阿黎博里",
              "id": "AL"
            },
            {
              "name": "阿塔科拉",
              "id": "AK"
            },
            {
              "name": "滨海",
              "id": "LI"
            },
            {
              "name": "波希康市",
              "id": "BOH"
            },
            {
              "name": "博尔古",
              "id": "BO"
            },
            {
              "name": "大西洋",
              "id": "AQ"
            },
            {
              "name": "高原",
              "id": "PL"
            },
            {
              "name": "库福",
              "id": "KO"
            },
            {
              "name": "莫诺",
              "id": "MO"
            },
            {
              "name": "丘陵",
              "id": "CO"
            },
            {
              "name": "韦梅",
              "id": "OU"
            },
            {
              "name": "峡谷",
              "id": "DO"
            },
            {
              "name": "祖",
              "id": "ZO"
            }
          ]
        }
      },
      {
        "name": "比利时",
        "id": "BEL",
        "State": {
          "City": [
            {
              "name": "埃诺",
              "id": "WHT"
            },
            {
              "name": "安特卫普",
              "id": "VAN"
            },
            {
              "name": "布拉班特瓦隆",
              "id": "WBR"
            },
            {
              "name": "布鲁塞尔",
              "id": "BRU"
            },
            {
              "name": "东佛兰德",
              "id": "VOV"
            },
            {
              "name": "佛兰芒布拉班特",
              "id": "VBR"
            },
            {
              "name": "列日",
              "id": "WLG"
            },
            {
              "name": "林堡",
              "id": "VLI"
            },
            {
              "name": "卢森堡",
              "id": "WLX"
            },
            {
              "name": "那慕尔",
              "id": "WNA"
            },
            {
              "name": "西佛兰德",
              "id": "VWV"
            }
          ]
        }
      },
      {
        "name": "冰岛",
        "id": "ISL"
      },
      {
        "name": "波多黎各",
        "id": "PRI"
      },
      {
        "name": "波兰",
        "id": "POL",
        "State": {
          "City": [
            {
              "name": "埃尔布隆格",
              "id": "ELB"
            },
            {
              "name": "奥尔什丁",
              "id": "OLS"
            },
            {
              "name": "奥斯特罗文卡",
              "id": "OSS"
            },
            {
              "name": "比得哥什",
              "id": "BZG"
            },
            {
              "name": "彼得库夫",
              "id": "PIO"
            },
            {
              "name": "比托姆",
              "id": "BYT"
            },
            {
              "name": "比亚瓦波德拉斯卡",
              "id": "BAP"
            },
            {
              "name": "比亚维斯托克",
              "id": "BIA"
            },
            {
              "name": "波莱",
              "id": "OPO"
            },
            {
              "name": "波兹南",
              "id": "POZ"
            },
            {
              "name": "达布罗瓦戈尼察",
              "id": "DAB"
            },
            {
              "name": "大波兰地区戈茹夫",
              "id": "GOW"
            },
            {
              "name": "弗罗茨瓦夫",
              "id": "WRO"
            },
            {
              "name": "弗沃茨瓦韦克",
              "id": "WLO"
            },
            {
              "name": "格但斯克",
              "id": "GDN"
            },
            {
              "name": "格丁尼亚",
              "id": "GDY"
            },
            {
              "name": "格利维采",
              "id": "GWC"
            },
            {
              "name": "格鲁琼兹",
              "id": "GRU"
            },
            {
              "name": "海乌姆",
              "id": "CHO"
            },
            {
              "name": "华沙",
              "id": "WAW"
            },
            {
              "name": "霍茹夫",
              "id": "CHZ"
            },
            {
              "name": "卡利什",
              "id": "KAL"
            },
            {
              "name": "卡托维兹",
              "id": "KTW"
            },
            {
              "name": "凯尔采",
              "id": "KLC"
            },
            {
              "name": "科宁",
              "id": "KON"
            },
            {
              "name": "科沙林",
              "id": "OSZ"
            },
            {
              "name": "克拉科夫",
              "id": "KRK"
            },
            {
              "name": "克罗斯诺",
              "id": "KRO"
            },
            {
              "name": "拉多姆",
              "id": "RDM"
            },
            {
              "name": "莱格尼察",
              "id": "LEG"
            },
            {
              "name": "莱什诺",
              "id": "LEZ"
            },
            {
              "name": "卢布林",
              "id": "LUL"
            },
            {
              "name": "鲁达",
              "id": "RDS"
            },
            {
              "name": "罗兹",
              "id": "LOD"
            },
            {
              "name": "绿山城",
              "id": "IEG"
            },
            {
              "name": "米什洛维采",
              "id": "MYL"
            },
            {
              "name": "皮瓦",
              "id": "PIL"
            },
            {
              "name": "普热梅希尔",
              "id": "PRZ"
            },
            {
              "name": "普沃茨克",
              "id": "PLO"
            },
            {
              "name": "切哈努夫",
              "id": "CIE"
            },
            {
              "name": "热舒夫",
              "id": "RZE"
            },
            {
              "name": "什切青",
              "id": "SZZ"
            },
            {
              "name": "斯凯尔涅维采",
              "id": "SKI"
            },
            {
              "name": "斯武普斯克",
              "id": "SLP"
            },
            {
              "name": "苏瓦乌基",
              "id": "SWL"
            },
            {
              "name": "索波特",
              "id": "SOP"
            },
            {
              "name": "索斯诺维茨",
              "id": "SWC"
            },
            {
              "name": "塔尔努夫",
              "id": "TAR"
            },
            {
              "name": "塔尔诺布热格",
              "id": "QEP"
            },
            {
              "name": "特切",
              "id": "TYY"
            },
            {
              "name": "托伦",
              "id": "TOR"
            },
            {
              "name": "瓦乌布日赫",
              "id": "WZH"
            },
            {
              "name": "沃姆扎",
              "id": "QOY"
            },
            {
              "name": "希米亚诺维采",
              "id": "SOW"
            },
            {
              "name": "希维诺乌伊希切",
              "id": "SWI"
            },
            {
              "name": "希维托赫洛维采",
              "id": "SWT"
            },
            {
              "name": "谢德尔采",
              "id": "SDC"
            },
            {
              "name": "谢拉兹",
              "id": "SIR"
            },
            {
              "name": "新松奇",
              "id": "NOW"
            },
            {
              "name": "雅沃兹诺",
              "id": "JAW"
            },
            {
              "name": "耶莱尼亚古拉",
              "id": "JEG"
            },
            {
              "name": "扎布热",
              "id": "ZAB"
            },
            {
              "name": "扎莫希奇",
              "id": "ZAM"
            }
          ]
        }
      },
      {
        "name": "玻利维亚",
        "id": "BOL",
        "State": {
          "City": [
            {
              "name": "奥尔托",
              "id": "ALT"
            },
            {
              "name": "奥鲁罗",
              "id": "ORU"
            },
            {
              "name": "贝尼",
              "id": "BEN"
            },
            {
              "name": "波多西",
              "id": "POI"
            },
            {
              "name": "基拉科洛",
              "id": "QUI"
            },
            {
              "name": "科恰班巴",
              "id": "CBB"
            },
            {
              "name": "拉巴斯",
              "id": "LPB"
            },
            {
              "name": "潘多",
              "id": "PAN"
            },
            {
              "name": "丘基萨卡",
              "id": "CHU"
            },
            {
              "name": "萨卡巴",
              "id": "SAC"
            },
            {
              "name": "圣克鲁斯",
              "id": "SRZ"
            },
            {
              "name": "塔里哈",
              "id": "TJA"
            }
          ]
        }
      },
      {
        "name": "波斯尼亚和黑塞哥维那",
        "id": "BIH",
        "State": {
          "City": [
            {
              "name": "波萨维纳",
              "id": "FPO"
            },
            {
              "name": "波斯尼亚－波德里涅",
              "id": "FBP"
            },
            {
              "name": "多米斯拉夫格勒",
              "id": "FTO"
            },
            {
              "name": "黑塞哥维那－涅雷特瓦",
              "id": "FHN"
            },
            {
              "name": "萨拉热窝",
              "id": "FSA"
            },
            {
              "name": "图兹拉－波德里涅",
              "id": "FTU"
            },
            {
              "name": "乌纳－萨纳",
              "id": "FUS"
            },
            {
              "name": "西波斯尼亚",
              "id": "FHB"
            },
            {
              "name": "西黑塞哥维那",
              "id": "FZH"
            },
            {
              "name": "泽尼察－多博伊",
              "id": "FZE"
            },
            {
              "name": "中波斯尼亚",
              "id": "FSB"
            }
          ]
        }
      },
      {
        "name": "博茨瓦纳",
        "id": "BWA"
      },
      {
        "name": "伯利兹",
        "id": "BLZ",
        "State": {
          "City": [
            {
              "name": "伯利兹",
              "id": "BZ"
            },
            {
              "name": "橘园",
              "id": "OW"
            },
            {
              "name": "卡约",
              "id": "CY"
            },
            {
              "name": "科罗萨尔",
              "id": "CR"
            },
            {
              "name": "斯坦港",
              "id": "SC"
            },
            {
              "name": "托莱多",
              "id": "TO"
            }
          ]
        }
      },
      {
        "name": "不丹",
        "id": "BTN"
      },
      {
        "name": "布基纳法索",
        "id": "BFA",
        "State": {
          "City": [
            {
              "name": "巴雷",
              "id": "BAL"
            },
            {
              "name": "巴姆",
              "id": "BAM"
            },
            {
              "name": "巴瓦",
              "id": "BAN"
            },
            {
              "name": "巴泽加",
              "id": "BAZ"
            },
            {
              "name": "波尼",
              "id": "PON"
            },
            {
              "name": "布尔古",
              "id": "BLG"
            },
            {
              "name": "布尔基恩德",
              "id": "BOK"
            },
            {
              "name": "布古里巴",
              "id": "BOR"
            },
            {
              "name": "冈祖尔古",
              "id": "GAN"
            },
            {
              "name": "古尔马",
              "id": "GOU"
            },
            {
              "name": "济罗",
              "id": "ZIR"
            },
            {
              "name": "卡焦戈",
              "id": "KAD"
            },
            {
              "name": "凯内杜古",
              "id": "KEN"
            },
            {
              "name": "科蒙加里",
              "id": "KOO"
            },
            {
              "name": "科莫埃",
              "id": "COM"
            },
            {
              "name": "孔皮恩加",
              "id": "KOP"
            },
            {
              "name": "孔西",
              "id": "KOS"
            },
            {
              "name": "库尔佩罗戈",
              "id": "KOL"
            },
            {
              "name": "库尔维奥戈",
              "id": "KOW"
            },
            {
              "name": "库里滕加",
              "id": "KOT"
            },
            {
              "name": "雷拉巴",
              "id": "LER"
            },
            {
              "name": "罗卢姆",
              "id": "LOR"
            },
            {
              "name": "穆翁",
              "id": "MOU"
            },
            {
              "name": "纳门滕加",
              "id": "NAM"
            },
            {
              "name": "纳乌里",
              "id": "NAH"
            },
            {
              "name": "纳亚拉",
              "id": "NAY"
            },
            {
              "name": "尼亚尼亚",
              "id": "GNA"
            },
            {
              "name": "努姆比埃尔",
              "id": "NOU"
            },
            {
              "name": "帕索雷",
              "id": "PAS"
            },
            {
              "name": "塞诺",
              "id": "SEN"
            },
            {
              "name": "桑吉",
              "id": "SAG"
            },
            {
              "name": "桑马滕加",
              "id": "SAM"
            },
            {
              "name": "苏鲁",
              "id": "SOR"
            },
            {
              "name": "苏姆",
              "id": "SOM"
            },
            {
              "name": "塔波阿",
              "id": "TAP"
            },
            {
              "name": "图伊",
              "id": "TUY"
            },
            {
              "name": "乌埃",
              "id": "HOU"
            },
            {
              "name": "乌布里滕加",
              "id": "OUB"
            },
            {
              "name": "乌达兰",
              "id": "OUD"
            },
            {
              "name": "锡西里",
              "id": "SIS"
            },
            {
              "name": "亚加",
              "id": "YAG"
            },
            {
              "name": "亚滕加",
              "id": "YAT"
            },
            {
              "name": "伊奥巴",
              "id": "IOA"
            },
            {
              "name": "宗德韦奥戈",
              "id": "ZOW"
            },
            {
              "name": "宗多马",
              "id": "ZOD"
            }
          ]
        }
      },
      {
        "name": "布隆迪",
        "id": "BDI",
        "State": {
          "City": [
            {
              "name": "布班扎",
              "id": "BB"
            },
            {
              "name": "布鲁里",
              "id": "BR"
            },
            {
              "name": "布琼布拉城市",
              "id": "BM"
            },
            {
              "name": "布琼布拉乡村",
              "id": "BU"
            },
            {
              "name": "恩戈齐",
              "id": "NG"
            },
            {
              "name": "基龙多",
              "id": "KI"
            },
            {
              "name": "基特加",
              "id": "GI"
            },
            {
              "name": "卡鲁济",
              "id": "KR"
            },
            {
              "name": "卡扬扎",
              "id": "KY"
            },
            {
              "name": "坎库佐",
              "id": "CA"
            },
            {
              "name": "鲁塔纳",
              "id": "RT"
            },
            {
              "name": "鲁伊吉",
              "id": "RY"
            },
            {
              "name": "马坎巴",
              "id": "MA"
            },
            {
              "name": "穆拉姆维亚",
              "id": "MU"
            },
            {
              "name": "穆瓦洛",
              "id": "MW"
            },
            {
              "name": "穆因加",
              "id": "MY"
            },
            {
              "name": "锡比托凯",
              "id": "CI"
            }
          ]
        }
      },
      {
        "name": "布韦岛",
        "id": "BVT"
      },
      {
        "name": "朝鲜",
        "id": "PRK",
        "State": {
          "City": [
            {
              "name": "海州",
              "id": "HAE"
            },
            {
              "name": "惠山",
              "id": "HYE"
            },
            {
              "name": "江界",
              "id": "KAN"
            },
            {
              "name": "开城",
              "id": "KSN"
            },
            {
              "name": "罗先",
              "id": "NAS"
            },
            {
              "name": "南浦",
              "id": "NAM"
            },
            {
              "name": "平壤",
              "id": "FNJ"
            },
            {
              "name": "清津",
              "id": "CHO"
            },
            {
              "name": "沙里院",
              "id": "SAR"
            },
            {
              "name": "咸兴",
              "id": "HAM"
            },
            {
              "name": "新义州",
              "id": "SII"
            },
            {
              "name": "元山",
              "id": "WON"
            }
          ]
        }
      },
      {
        "name": "丹麦",
        "id": "DNK",
        "State": {
          "City": [
            {
              "name": "奥胡斯",
              "id": "AR"
            },
            {
              "name": "北日德兰",
              "id": "VSV"
            },
            {
              "name": "博恩霍尔姆",
              "id": "BO"
            },
            {
              "name": "菲特烈堡",
              "id": "FRE"
            },
            {
              "name": "菲茵",
              "id": "FY"
            },
            {
              "name": "哥本哈根",
              "id": "CPH"
            },
            {
              "name": "里伯",
              "id": "RIB"
            },
            {
              "name": "灵克宾",
              "id": "RKG"
            },
            {
              "name": "罗斯基勒",
              "id": "RKE"
            },
            {
              "name": "南日德兰",
              "id": "VBI"
            },
            {
              "name": "斯多斯特姆",
              "id": "ST"
            },
            {
              "name": "维堡",
              "id": "VIB"
            },
            {
              "name": "维厄勒",
              "id": "VEJ"
            },
            {
              "name": "西希兰",
              "id": "VS"
            }
          ]
        }
      },
      {
        "name": "德国",
        "id": "DEU",
        "State": {
          "City": [
            {
              "name": "阿恩斯贝格",
              "id": "ARN"
            },
            {
              "name": "爱尔福特",
              "id": "ERF"
            },
            {
              "name": "安斯巴格",
              "id": "ANS"
            },
            {
              "name": "奥格斯堡",
              "id": "AGB"
            },
            {
              "name": "柏林",
              "id": "BE"
            },
            {
              "name": "拜伊罗特",
              "id": "BYU"
            },
            {
              "name": "比勒费尔德",
              "id": "BFE"
            },
            {
              "name": "波茨坦",
              "id": "POT"
            },
            {
              "name": "波鸿",
              "id": "BOM"
            },
            {
              "name": "不来梅",
              "id": "HB"
            },
            {
              "name": "不伦瑞克",
              "id": "BRW"
            },
            {
              "name": "达姆施塔特",
              "id": "DAR"
            },
            {
              "name": "代特莫尔特",
              "id": "DET"
            },
            {
              "name": "德累斯顿",
              "id": "DRS"
            },
            {
              "name": "德绍",
              "id": "DES"
            },
            {
              "name": "杜塞尔多夫",
              "id": "DUS"
            },
            {
              "name": "法兰克福",
              "id": "FFO"
            },
            {
              "name": "弗赖堡",
              "id": "FBG"
            },
            {
              "name": "哈雷",
              "id": "HAE"
            },
            {
              "name": "汉堡",
              "id": "HH"
            },
            {
              "name": "汉诺威",
              "id": "HAJ"
            },
            {
              "name": "基尔",
              "id": "KEL"
            },
            {
              "name": "吉森",
              "id": "GBN"
            },
            {
              "name": "卡尔斯鲁厄",
              "id": "KAE"
            },
            {
              "name": "卡塞尔",
              "id": "KAS"
            },
            {
              "name": "开姆尼斯",
              "id": "CHE"
            },
            {
              "name": "科布伦次",
              "id": "KOB"
            },
            {
              "name": "科隆",
              "id": "CGN"
            },
            {
              "name": "莱比锡",
              "id": "LEJ"
            },
            {
              "name": "兰茨胡特",
              "id": "LDH"
            },
            {
              "name": "吕讷堡",
              "id": "LBG"
            },
            {
              "name": "马格德堡",
              "id": "MAG"
            },
            {
              "name": "曼海姆",
              "id": "MHG"
            },
            {
              "name": "美因兹",
              "id": "MAI"
            },
            {
              "name": "明斯特",
              "id": "MUN"
            },
            {
              "name": "慕尼黑",
              "id": "MUC"
            },
            {
              "name": "纽伦堡",
              "id": "NUE"
            },
            {
              "name": "什未林",
              "id": "SWH"
            },
            {
              "name": "斯图加特",
              "id": "STR"
            },
            {
              "name": "特里尔",
              "id": "TRI"
            },
            {
              "name": "威斯巴登",
              "id": "WIB"
            },
            {
              "name": "维尔茨堡",
              "id": "WUG"
            }
          ]
        }
      },
      {
        "name": "东帝汶",
        "id": "TLS",
        "State": {
          "City": [
            {
              "name": "阿伊莱乌",
              "id": "AL"
            },
            {
              "name": "阿伊纳罗",
              "id": "AN"
            },
            {
              "name": "埃尔梅拉",
              "id": "ER"
            },
            {
              "name": "安贝诺",
              "id": "AM"
            },
            {
              "name": "包考",
              "id": "BA"
            },
            {
              "name": "博博纳罗",
              "id": "BO"
            },
            {
              "name": "帝力",
              "id": "DI"
            },
            {
              "name": "科瓦利马",
              "id": "KO"
            },
            {
              "name": "劳滕",
              "id": "LA"
            },
            {
              "name": "利基卡",
              "id": "LI"
            },
            {
              "name": "马纳图托",
              "id": "MT"
            },
            {
              "name": "马努法伊",
              "id": "MF"
            },
            {
              "name": "维克克",
              "id": "VI"
            }
          ]
        }
      },
      {
        "name": "多哥",
        "id": "TGO",
        "State": {
          "City": [
            {
              "name": "滨海区",
              "id": "M"
            },
            {
              "name": "草原区",
              "id": "S"
            },
            {
              "name": "高原区",
              "id": "P"
            },
            {
              "name": "卡拉区",
              "id": "K"
            },
            {
              "name": "中部区",
              "id": "C"
            }
          ]
        }
      },
      {
        "name": "多米尼加",
        "id": "DMA"
      },
      {
        "name": "多米尼加共和国",
        "id": "DOM"
      },
      {
        "name": "俄罗斯",
        "id": "RUS",
        "State": {
          "City": [
            {
              "name": "阿巴坎",
              "id": "ABA"
            },
            {
              "name": "阿尔汉格尔斯克",
              "id": "ARK"
            },
            {
              "name": "阿金斯科耶",
              "id": "AGI"
            },
            {
              "name": "阿纳德尔",
              "id": "DYR"
            },
            {
              "name": "阿斯特拉罕",
              "id": "AST"
            },
            {
              "name": "埃利斯塔",
              "id": "ESL"
            },
            {
              "name": "奥廖尔",
              "id": "ORL"
            },
            {
              "name": "奥伦堡",
              "id": "ORE"
            },
            {
              "name": "巴尔瑙尔",
              "id": "BAX"
            },
            {
              "name": "奔萨",
              "id": "PNZ"
            },
            {
              "name": "彼得罗巴甫洛夫斯克",
              "id": "PKC"
            },
            {
              "name": "彼得罗扎沃茨克",
              "id": "PES"
            },
            {
              "name": "彼尔姆",
              "id": "PER"
            },
            {
              "name": "比罗比詹",
              "id": "BBZ"
            },
            {
              "name": "别尔哥罗德",
              "id": "BEL"
            },
            {
              "name": "伯力",
              "id": "COK"
            },
            {
              "name": "布拉戈维申斯克",
              "id": "BQS"
            },
            {
              "name": "布良斯克",
              "id": "BRY"
            },
            {
              "name": "车里雅宾斯克",
              "id": "CHE"
            },
            {
              "name": "赤塔",
              "id": "CHI"
            },
            {
              "name": "顿河畔罗斯托夫",
              "id": "ROS"
            },
            {
              "name": "鄂木斯克",
              "id": "OMS"
            },
            {
              "name": "伏尔加格勒",
              "id": "VOG"
            },
            {
              "name": "弗拉基米尔",
              "id": "VMR"
            },
            {
              "name": "弗拉季高加索",
              "id": "VLA"
            },
            {
              "name": "戈尔诺－阿尔泰斯克",
              "id": "GOA"
            },
            {
              "name": "格罗兹尼",
              "id": "GRV"
            },
            {
              "name": "海参崴",
              "id": "VVO"
            },
            {
              "name": "汉特－曼西斯克",
              "id": "KHM"
            },
            {
              "name": "基洛夫",
              "id": "KIR"
            },
            {
              "name": "加里宁格勒",
              "id": "KGD"
            },
            {
              "name": "喀山",
              "id": "KZN"
            },
            {
              "name": "卡卢加",
              "id": "KLF"
            },
            {
              "name": "科斯特罗马",
              "id": "KOS"
            },
            {
              "name": "克拉斯诺达尔",
              "id": "KRR"
            },
            {
              "name": "克拉斯诺亚尔斯克",
              "id": "KYA"
            },
            {
              "name": "克麦罗沃",
              "id": "KEM"
            },
            {
              "name": "克孜勒",
              "id": "KYZ"
            },
            {
              "name": "库德姆卡尔",
              "id": "KUD"
            },
            {
              "name": "库尔干",
              "id": "KRO"
            },
            {
              "name": "库尔斯克",
              "id": "URS"
            },
            {
              "name": "利佩茨克",
              "id": "LIP"
            },
            {
              "name": "梁赞",
              "id": "RYA"
            },
            {
              "name": "马哈奇卡拉",
              "id": "MCX"
            },
            {
              "name": "马加丹",
              "id": "MAG"
            },
            {
              "name": "马加斯",
              "id": "IN"
            },
            {
              "name": "迈科普",
              "id": "MAY"
            },
            {
              "name": "摩尔曼斯克",
              "id": "MMK"
            },
            {
              "name": "莫斯科",
              "id": "MOW"
            },
            {
              "name": "纳尔奇克",
              "id": "NAL"
            },
            {
              "name": "纳里扬马尔",
              "id": "NNM"
            },
            {
              "name": "南萨哈林斯克",
              "id": "JSA"
            },
            {
              "name": "诺夫哥罗德",
              "id": "VUS"
            },
            {
              "name": "帕拉纳",
              "id": "PAL"
            },
            {
              "name": "普斯科夫",
              "id": "PSK"
            },
            {
              "name": "切博克萨雷",
              "id": "CSY"
            },
            {
              "name": "切尔克斯克",
              "id": "CKS"
            },
            {
              "name": "秋明",
              "id": "TYU"
            },
            {
              "name": "萨拉托夫",
              "id": "SAR"
            },
            {
              "name": "萨兰斯克",
              "id": "SKX"
            },
            {
              "name": "萨列哈尔德",
              "id": "SLY"
            },
            {
              "name": "萨马拉",
              "id": "SAM"
            },
            {
              "name": "瑟克特夫卡尔",
              "id": "SCW"
            },
            {
              "name": "圣彼得堡",
              "id": "SPE"
            },
            {
              "name": "斯摩棱斯克",
              "id": "LNX"
            },
            {
              "name": "斯塔夫罗波尔",
              "id": "STA"
            },
            {
              "name": "坦波夫",
              "id": "TAM"
            },
            {
              "name": "特维尔",
              "id": "TVE"
            },
            {
              "name": "图拉",
              "id": "TUL"
            },
            {
              "name": "托木斯克",
              "id": "TOM"
            },
            {
              "name": "沃罗涅什",
              "id": "VOR"
            },
            {
              "name": "沃洛格达",
              "id": "VLG"
            },
            {
              "name": "乌法",
              "id": "UFA"
            },
            {
              "name": "乌兰乌德",
              "id": "UUD"
            },
            {
              "name": "乌里扬诺夫斯克",
              "id": "ULY"
            },
            {
              "name": "乌斯季奥尔登斯基",
              "id": "UOB"
            },
            {
              "name": "下诺夫哥罗德",
              "id": "GOJ"
            },
            {
              "name": "新西伯利亚",
              "id": "NVS"
            },
            {
              "name": "雅库茨克",
              "id": "JAK"
            },
            {
              "name": "雅罗斯拉夫尔",
              "id": "JAR"
            },
            {
              "name": "叶卡捷林堡",
              "id": "JEK"
            },
            {
              "name": "伊尔库茨克",
              "id": "IKT"
            },
            {
              "name": "伊热夫斯克",
              "id": "IJK"
            },
            {
              "name": "伊万诺沃",
              "id": "IVO"
            },
            {
              "name": "约什卡尔奥拉",
              "id": "YOL"
            }
          ]
        }
      },
      {
        "name": "厄瓜多尔",
        "id": "ECU",
        "State": {
          "City": [
            {
              "name": "阿苏艾",
              "id": "A"
            },
            {
              "name": "埃尔奥罗",
              "id": "O"
            },
            {
              "name": "埃斯梅拉尔达斯",
              "id": "E"
            },
            {
              "name": "玻利瓦尔",
              "id": "B"
            },
            {
              "name": "瓜亚斯",
              "id": "G"
            },
            {
              "name": "加拉帕戈斯",
              "id": "W"
            },
            {
              "name": "卡尔奇",
              "id": "C"
            },
            {
              "name": "卡尼亚尔",
              "id": "F"
            },
            {
              "name": "科托帕希",
              "id": "X"
            },
            {
              "name": "洛哈",
              "id": "L"
            },
            {
              "name": "洛斯里奥斯",
              "id": "R"
            },
            {
              "name": "马纳比",
              "id": "M"
            },
            {
              "name": "莫罗纳－圣地亚哥",
              "id": "S"
            },
            {
              "name": "纳波，奥雷利亚纳",
              "id": "D"
            },
            {
              "name": "帕斯塔萨",
              "id": "Y"
            },
            {
              "name": "皮钦查",
              "id": "P"
            },
            {
              "name": "钦博拉索",
              "id": "H"
            },
            {
              "name": "萨莫拉－钦奇佩",
              "id": "Z"
            },
            {
              "name": "苏昆毕奥斯",
              "id": "U"
            },
            {
              "name": "通古拉瓦",
              "id": "T"
            },
            {
              "name": "因巴布拉",
              "id": "I"
            }
          ]
        }
      },
      {
        "name": "厄立特里亚",
        "id": "ERI",
        "State": {
          "City": [
            {
              "name": "安塞巴",
              "id": "KE"
            },
            {
              "name": "北红海",
              "id": "SK"
            },
            {
              "name": "加什·巴尔卡",
              "id": "BR"
            },
            {
              "name": "南部",
              "id": "DE"
            },
            {
              "name": "南红海",
              "id": "DK"
            },
            {
              "name": "中部",
              "id": "MA"
            }
          ]
        }
      },
      {
        "name": "法国",
        "id": "FRA",
        "State": {
          "City": [
            {
              "name": "阿尔勒",
              "id": "ARL"
            },
            {
              "name": "阿雅克修",
              "id": "AJA"
            },
            {
              "name": "艾克斯",
              "id": "QXB"
            },
            {
              "name": "奥尔良",
              "id": "ORR"
            },
            {
              "name": "巴黎",
              "id": "PAR"
            },
            {
              "name": "贝桑松",
              "id": "BSN"
            },
            {
              "name": "第戎",
              "id": "DIJ"
            },
            {
              "name": "弗雷瑞斯",
              "id": "FRJ"
            },
            {
              "name": "卡昂",
              "id": "CFR"
            },
            {
              "name": "雷恩",
              "id": "RNS"
            },
            {
              "name": "里昂",
              "id": "LIO"
            },
            {
              "name": "里尔",
              "id": "LLE"
            },
            {
              "name": "利摩日",
              "id": "LIG"
            },
            {
              "name": "鲁昂",
              "id": "URO"
            },
            {
              "name": "马赛",
              "id": "MRS"
            },
            {
              "name": "梅斯",
              "id": "MZM"
            },
            {
              "name": "蒙彼利埃",
              "id": "MPL"
            },
            {
              "name": "南特",
              "id": "NTE"
            },
            {
              "name": "尼斯",
              "id": "NCE"
            },
            {
              "name": "沙隆",
              "id": "CSM"
            },
            {
              "name": "图卢兹",
              "id": "TLS"
            },
            {
              "name": "瓦朗斯",
              "id": "VAA"
            },
            {
              "name": "亚眠",
              "id": "AMI"
            }
          ]
        }
      },
      {
        "name": "法罗群岛",
        "id": "FRO"
      },
      {
        "name": "法属波利尼西亚",
        "id": "PYF"
      },
      {
        "name": "法属圭亚那",
        "id": "GUF"
      },
      {
        "name": "法属南部领地",
        "id": "ATF"
      },
      {
        "name": "梵蒂冈",
        "id": "VAT"
      },
      {
        "name": "菲律宾",
        "id": "PHL",
        "State": {
          "City": [
            {
              "name": "达沃",
              "id": "DOR"
            },
            {
              "name": "卡卢坎",
              "id": "CAO"
            },
            {
              "name": "马尼拉",
              "id": "MNL"
            },
            {
              "name": "宿务",
              "id": "CEB"
            }
          ]
        }
      },
      {
        "name": "斐济",
        "id": "FJI"
      },
      {
        "name": "芬兰",
        "id": "FIN",
        "State": {
          "City": [
            {
              "name": "埃斯波",
              "id": "ESP"
            },
            {
              "name": "奥卢",
              "id": "OLU"
            },
            {
              "name": "波里",
              "id": "POR"
            },
            {
              "name": "博尔沃",
              "id": "PRV"
            },
            {
              "name": "海门林纳",
              "id": "HMY"
            },
            {
              "name": "赫尔辛基",
              "id": "HEL"
            },
            {
              "name": "卡亚尼",
              "id": "KAJ"
            },
            {
              "name": "科科拉",
              "id": "KOK"
            },
            {
              "name": "科特卡",
              "id": "KTK"
            },
            {
              "name": "库奥皮奥",
              "id": "KUO"
            },
            {
              "name": "拉赫蒂",
              "id": "LHI"
            },
            {
              "name": "拉彭兰塔",
              "id": "LPP"
            },
            {
              "name": "罗瓦涅米",
              "id": "RVN"
            },
            {
              "name": "玛丽港",
              "id": "MHQ"
            },
            {
              "name": "米凯利",
              "id": "MIK"
            },
            {
              "name": "坦佩雷",
              "id": "TMP"
            },
            {
              "name": "图尔库",
              "id": "TKU"
            },
            {
              "name": "瓦萨",
              "id": "VAA"
            },
            {
              "name": "万塔",
              "id": "VAT"
            },
            {
              "name": "约恩苏",
              "id": "JOE"
            }
          ]
        }
      },
      {
        "name": "佛得角",
        "id": "CPV",
        "State": {
          "City": [
            {
              "name": "保尔",
              "id": "PA"
            },
            {
              "name": "波多诺伏",
              "id": "PN"
            },
            {
              "name": "博阿维斯塔岛",
              "id": "BV"
            },
            {
              "name": "布拉瓦岛",
              "id": "BR"
            },
            {
              "name": "大里贝拉",
              "id": "RG"
            },
            {
              "name": "福古岛",
              "id": "FO"
            },
            {
              "name": "马尤岛",
              "id": "MA"
            },
            {
              "name": "莫斯特罗",
              "id": "MO"
            },
            {
              "name": "普拉亚",
              "id": "PR"
            },
            {
              "name": "萨尔岛",
              "id": "SL"
            },
            {
              "name": "圣安唐岛",
              "id": "SA"
            },
            {
              "name": "圣地亚哥岛",
              "id": "IA"
            },
            {
              "name": "圣多明戈",
              "id": "SD"
            },
            {
              "name": "圣菲利普",
              "id": "SF"
            },
            {
              "name": "圣卡塔琳娜",
              "id": "CA"
            },
            {
              "name": "圣克鲁斯",
              "id": "CR"
            },
            {
              "name": "圣米戈尔",
              "id": "SM"
            },
            {
              "name": "圣尼古拉岛",
              "id": "SN"
            },
            {
              "name": "圣维森特岛",
              "id": "SV"
            },
            {
              "name": "塔拉法尔",
              "id": "TA"
            }
          ]
        }
      },
      {
        "name": "弗兰克群岛",
        "id": "FLK"
      },
      {
        "name": "冈比亚",
        "id": "GMB"
      },
      {
        "name": "刚果",
        "id": "COG"
      },
      {
        "name": "刚果民主共和国",
        "id": "COD"
      },
      {
        "name": "哥伦比亚",
        "id": "COL",
        "State": {
          "City": [
            {
              "name": "阿劳卡",
              "id": "ARA"
            },
            {
              "name": "安提奥基亚",
              "id": "ANT"
            },
            {
              "name": "北桑坦德",
              "id": "NDS"
            },
            {
              "name": "波哥大首都区",
              "id": "BDC"
            },
            {
              "name": "博利瓦尔",
              "id": "BOL"
            },
            {
              "name": "博亚卡",
              "id": "BOY"
            },
            {
              "name": "大西洋",
              "id": "ATL"
            },
            {
              "name": "瓜维亚雷",
              "id": "GVR"
            },
            {
              "name": "瓜希拉",
              "id": "GJR"
            },
            {
              "name": "瓜伊尼亚",
              "id": "GNA"
            },
            {
              "name": "金迪奥",
              "id": "QUI"
            },
            {
              "name": "卡尔达斯",
              "id": "CAL"
            },
            {
              "name": "卡克塔",
              "id": "CAQ"
            },
            {
              "name": "卡萨纳雷",
              "id": "CAS"
            },
            {
              "name": "考卡",
              "id": "CAU"
            },
            {
              "name": "考卡山谷",
              "id": "VDC"
            },
            {
              "name": "科尔多巴",
              "id": "COR"
            },
            {
              "name": "昆迪纳马卡",
              "id": "CAM"
            },
            {
              "name": "利萨拉尔达",
              "id": "RIS"
            },
            {
              "name": "马格达雷那",
              "id": "MAG"
            },
            {
              "name": "梅塔",
              "id": "MET"
            },
            {
              "name": "纳里尼奥",
              "id": "NAR"
            },
            {
              "name": "普图马约",
              "id": "PUT"
            },
            {
              "name": "乔科",
              "id": "CHO"
            },
            {
              "name": "塞萨尔",
              "id": "CES"
            },
            {
              "name": "桑坦德",
              "id": "SAN"
            },
            {
              "name": "圣安德烈斯普罗维登西亚",
              "id": "SAP"
            },
            {
              "name": "苏克雷",
              "id": "SUC"
            },
            {
              "name": "托利马",
              "id": "TOL"
            },
            {
              "name": "维查达",
              "id": "VIC"
            },
            {
              "name": "沃佩斯",
              "id": "VAU"
            },
            {
              "name": "乌伊拉",
              "id": "HUI"
            },
            {
              "name": "亚马孙",
              "id": "AMZ"
            }
          ]
        }
      },
      {
        "name": "哥斯达黎加",
        "id": "CRI",
        "State": {
          "City": [
            {
              "name": "阿拉胡埃拉",
              "id": "A"
            },
            {
              "name": "埃雷迪亚",
              "id": "H"
            },
            {
              "name": "瓜纳卡斯特",
              "id": "G"
            },
            {
              "name": "卡塔戈",
              "id": "C"
            },
            {
              "name": "利蒙",
              "id": "L"
            },
            {
              "name": "蓬塔雷纳斯",
              "id": "P"
            },
            {
              "name": "圣何塞",
              "id": "SJ"
            }
          ]
        }
      },
      {
        "name": "格恩西岛",
        "id": "GGY"
      },
      {
        "name": "格林纳达",
        "id": "GRD"
      },
      {
        "name": "格陵兰",
        "id": "GRL"
      },
      {
        "name": "古巴",
        "id": "CUB",
        "State": {
          "City": [
            {
              "name": "奥尔金",
              "id": "11"
            },
            {
              "name": "比那尔德里奥",
              "id": "1"
            },
            {
              "name": "比亚克拉拉",
              "id": "5"
            },
            {
              "name": "格拉玛",
              "id": "12"
            },
            {
              "name": "关塔那摩",
              "id": "14"
            },
            {
              "name": "哈瓦那",
              "id": "2"
            },
            {
              "name": "哈瓦那城",
              "id": "3"
            },
            {
              "name": "卡马圭",
              "id": "9"
            },
            {
              "name": "拉斯图纳斯",
              "id": "10"
            },
            {
              "name": "马坦萨斯",
              "id": "4"
            },
            {
              "name": "马亚里",
              "id": "MAY"
            },
            {
              "name": "曼萨尼罗",
              "id": "MZO"
            },
            {
              "name": "青年岛特区",
              "id": "99"
            },
            {
              "name": "圣地亚哥",
              "id": "13"
            },
            {
              "name": "圣斯皮里图斯",
              "id": "7"
            },
            {
              "name": "西恩富戈斯",
              "id": "6"
            },
            {
              "name": "谢戈德阿维拉",
              "id": "8"
            }
          ]
        }
      },
      {
        "name": "瓜德罗普",
        "id": "GLP"
      },
      {
        "name": "关岛",
        "id": "GUM"
      },
      {
        "name": "圭亚那",
        "id": "GUY",
        "State": {
          "City": [
            {
              "name": "埃塞奎博群岛西德梅拉拉",
              "id": "EW"
            },
            {
              "name": "巴里马瓦伊尼",
              "id": "BW"
            },
            {
              "name": "波默伦苏佩纳姆",
              "id": "PM"
            },
            {
              "name": "波塔罗锡帕鲁尼",
              "id": "PI"
            },
            {
              "name": "德梅拉拉马海卡",
              "id": "DM"
            },
            {
              "name": "东伯比斯科兰太因",
              "id": "EC"
            },
            {
              "name": "库尤尼马扎鲁尼",
              "id": "CM"
            },
            {
              "name": "马海卡伯比斯",
              "id": "MB"
            },
            {
              "name": "上德梅拉拉伯比斯",
              "id": "UD"
            },
            {
              "name": "上塔库图上埃塞奎博",
              "id": "UT"
            }
          ]
        }
      },
      {
        "name": "哈萨克斯坦",
        "id": "KAZ",
        "State": {
          "City": [
            {
              "name": "阿尔卡累克",
              "id": "AYK"
            },
            {
              "name": "阿克莫拉",
              "id": "AKM"
            },
            {
              "name": "阿克苏",
              "id": "AKS"
            },
            {
              "name": "阿克托别",
              "id": "AKT"
            },
            {
              "name": "阿拉木图",
              "id": "ALA"
            },
            {
              "name": "阿雷斯",
              "id": "ARY"
            },
            {
              "name": "阿斯塔纳市",
              "id": "AST"
            },
            {
              "name": "阿特劳",
              "id": "ATY"
            },
            {
              "name": "埃基巴斯图兹",
              "id": "EKB"
            },
            {
              "name": "巴尔喀什",
              "id": "BXH"
            },
            {
              "name": "巴甫洛达尔",
              "id": "PAV"
            },
            {
              "name": "北哈萨克斯坦",
              "id": "SEV"
            },
            {
              "name": "东哈萨克斯坦",
              "id": "VOS"
            },
            {
              "name": "济良诺夫斯克",
              "id": "ZYR"
            },
            {
              "name": "江布尔",
              "id": "DMB"
            },
            {
              "name": "杰兹卡兹甘",
              "id": "DZH"
            },
            {
              "name": "卡拉干达",
              "id": "KAR"
            },
            {
              "name": "卡拉扎尔",
              "id": "KZO"
            },
            {
              "name": "卡普恰盖",
              "id": "KAP"
            },
            {
              "name": "科斯塔奈",
              "id": "KST"
            },
            {
              "name": "克孜勒奥尔达",
              "id": "KZY"
            },
            {
              "name": "肯套",
              "id": "KEN"
            },
            {
              "name": "库尔恰托夫",
              "id": "KUR"
            },
            {
              "name": "利萨科夫斯克",
              "id": "LKK"
            },
            {
              "name": "列宁诺戈尔斯克",
              "id": "LEN"
            },
            {
              "name": "鲁德内",
              "id": "RUD"
            },
            {
              "name": "曼格斯套",
              "id": "MAN"
            },
            {
              "name": "南哈萨克斯坦",
              "id": "KGT"
            },
            {
              "name": "萨兰",
              "id": "SAR"
            },
            {
              "name": "塞梅伊",
              "id": "SEM"
            },
            {
              "name": "沙赫京斯克",
              "id": "SAK"
            },
            {
              "name": "斯捷普诺戈尔斯克",
              "id": "STE"
            },
            {
              "name": "铁克利",
              "id": "TEK"
            },
            {
              "name": "铁米尔套",
              "id": "TEM"
            },
            {
              "name": "突厥斯坦",
              "id": "TUR"
            },
            {
              "name": "西哈萨克斯坦",
              "id": "ZAP"
            },
            {
              "name": "扎纳奥津",
              "id": "ZHA"
            }
          ]
        }
      },
      {
        "name": "海地",
        "id": "HTI"
      },
      {
        "name": "韩国",
        "id": "KOR",
        "State": [
          {
            "name": "大邱",
            "id": "27",
            "City": [
              {
                "name": "达城郡",
                "id": "DSG"
              },
              {
                "name": "大邱",
                "id": "TAE"
              },
              {
                "name": "寿城区",
                "id": "SUS"
              }
            ]
          },
          {
            "name": "大田",
            "id": "30"
          },
          {
            "name": "釜山",
            "id": "26"
          },
          {
            "name": "光州",
            "id": "29"
          },
          {
            "name": "济州特别自治道",
            "id": "41"
          },
          {
            "name": "江原道",
            "id": "42",
            "City": [
              {
                "name": "春川市",
                "id": "CHC"
              },
              {
                "name": "东海市",
                "id": "TGH"
              },
              {
                "name": "高城郡",
                "id": "GSG"
              },
              {
                "name": "横城郡",
                "id": "HSG"
              },
              {
                "name": "洪川郡",
                "id": "HCN"
              },
              {
                "name": "华川郡",
                "id": "HCH"
              },
              {
                "name": "江陵市",
                "id": "KAG"
              },
              {
                "name": "旌善郡",
                "id": "JSE"
              },
              {
                "name": "麟蹄郡",
                "id": "IJE"
              },
              {
                "name": "宁越郡",
                "id": "YWL"
              },
              {
                "name": "平昌郡",
                "id": "POG"
              },
              {
                "name": "三陟市",
                "id": "SUK"
              },
              {
                "name": "束草市",
                "id": "SHO"
              },
              {
                "name": "太白市",
                "id": "TBK"
              },
              {
                "name": "铁原郡",
                "id": "CWN"
              },
              {
                "name": "襄阳郡",
                "id": "YNY"
              },
              {
                "name": "杨口郡",
                "id": "YGU"
              },
              {
                "name": "原州市",
                "id": "WJU"
              }
            ]
          },
          {
            "name": "京畿道",
            "id": "49",
            "City": [
              {
                "name": "安城市",
                "id": "ASG"
              },
              {
                "name": "安山市",
                "id": "ASN"
              },
              {
                "name": "安养市",
                "id": "ANY"
              },
              {
                "name": "抱川市",
                "id": "POC"
              },
              {
                "name": "城南市",
                "id": "SEO"
              },
              {
                "name": "东豆川市",
                "id": "DDC"
              },
              {
                "name": "富川市",
                "id": "BCN"
              },
              {
                "name": "高阳市",
                "id": "GYG"
              },
              {
                "name": "光明市",
                "id": "GMG"
              },
              {
                "name": "广州市",
                "id": "KWU"
              },
              {
                "name": "果川市",
                "id": "GCN"
              },
              {
                "name": "河南市",
                "id": "HNM"
              },
              {
                "name": "华城市",
                "id": "HCH"
              },
              {
                "name": "加平郡",
                "id": "GPG"
              },
              {
                "name": "金浦市",
                "id": "GMP"
              },
              {
                "name": "九里市",
                "id": "GRI"
              },
              {
                "name": "军浦市",
                "id": "GUN"
              },
              {
                "name": "骊州郡",
                "id": "YJU"
              },
              {
                "name": "利川市",
                "id": "ICE"
              },
              {
                "name": "涟川郡",
                "id": "YCN"
              },
              {
                "name": "龙仁市",
                "id": "YNG"
              },
              {
                "name": "南杨州市",
                "id": "NYU"
              },
              {
                "name": "平泽市",
                "id": "PTK"
              },
              {
                "name": "坡州市",
                "id": "PJU"
              },
              {
                "name": "始兴市",
                "id": "SHE"
              },
              {
                "name": "水原市",
                "id": "SUO"
              },
              {
                "name": "乌山市",
                "id": "OSN"
              },
              {
                "name": "扬平郡",
                "id": "YPG"
              },
              {
                "name": "杨州市",
                "id": "YYU"
              },
              {
                "name": "仪旺市",
                "id": "UWN"
              },
              {
                "name": "议政府市",
                "id": "UIJ"
              }
            ]
          },
          {
            "name": "庆尚北道",
            "id": "43",
            "City": [
              {
                "name": "安东市",
                "id": "ADG"
              },
              {
                "name": "奉化郡",
                "id": "BHA"
              },
              {
                "name": "高灵郡",
                "id": "GRG"
              },
              {
                "name": "龟尾市",
                "id": "KUM"
              },
              {
                "name": "金泉市",
                "id": "KMC"
              },
              {
                "name": "军威郡",
                "id": "GWI"
              },
              {
                "name": "醴泉郡",
                "id": "YEC"
              },
              {
                "name": "浦项市",
                "id": "KPO"
              },
              {
                "name": "漆谷郡",
                "id": "CGK"
              },
              {
                "name": "淸道郡",
                "id": "CDO"
              },
              {
                "name": "靑松郡",
                "id": "CSG"
              },
              {
                "name": "庆山市",
                "id": "GYS"
              },
              {
                "name": "庆州市",
                "id": "GJU"
              },
              {
                "name": "荣州市",
                "id": "YEJ"
              },
              {
                "name": "尙州市",
                "id": "SJU"
              },
              {
                "name": "蔚珍郡",
                "id": "UJN"
              },
              {
                "name": "闻庆市",
                "id": "MGG"
              },
              {
                "name": "星州郡",
                "id": "SEJ"
              },
              {
                "name": "义城郡",
                "id": "USG"
              },
              {
                "name": "英阳郡",
                "id": "YYG"
              },
              {
                "name": "盈德郡",
                "id": "YDK"
              },
              {
                "name": "永川市",
                "id": "YCH"
              },
              {
                "name": "郁陵郡",
                "id": "ULG"
              }
            ]
          },
          {
            "name": "庆尚南道",
            "id": "44",
            "City": [
              {
                "name": "昌宁郡",
                "id": "CNG"
              },
              {
                "name": "昌原市",
                "id": "CHW"
              },
              {
                "name": "固城郡",
                "id": "GSO"
              },
              {
                "name": "河东郡",
                "id": "HDG"
              },
              {
                "name": "金海市",
                "id": "KMH"
              },
              {
                "name": "晋州市",
                "id": "HIN"
              },
              {
                "name": "居昌郡",
                "id": "GCH"
              },
              {
                "name": "巨济市",
                "id": "KJE"
              },
              {
                "name": "梁山市",
                "id": "YSN"
              },
              {
                "name": "马山市",
                "id": "MAS"
              },
              {
                "name": "密阳市",
                "id": "MIR"
              },
              {
                "name": "南海郡",
                "id": "NHE"
              },
              {
                "name": "山淸郡",
                "id": "SCH"
              },
              {
                "name": "泗川市",
                "id": "SAH"
              },
              {
                "name": "统营市",
                "id": "TYG"
              },
              {
                "name": "陜川郡",
                "id": "HCE"
              },
              {
                "name": "咸安郡",
                "id": "HAN"
              },
              {
                "name": "咸阳郡",
                "id": "HYG"
              },
              {
                "name": "宜宁郡",
                "id": "URG"
              },
              {
                "name": "鎭海市",
                "id": "CHF"
              }
            ]
          },
          {
            "name": "全罗北道",
            "id": "47",
            "City": [
              {
                "name": "淳昌郡",
                "id": "SCG"
              },
              {
                "name": "扶安郡",
                "id": "PUS"
              },
              {
                "name": "高敞郡",
                "id": "GCG"
              },
              {
                "name": "金堤市",
                "id": "GJE"
              },
              {
                "name": "井邑市",
                "id": "JEO"
              },
              {
                "name": "茂朱郡",
                "id": "MJU"
              },
              {
                "name": "南原市",
                "id": "NWN"
              },
              {
                "name": "全州市",
                "id": "JNJ"
              },
              {
                "name": "群山市",
                "id": "KUV"
              },
              {
                "name": "任实郡",
                "id": "ISL"
              },
              {
                "name": "完州郡",
                "id": "WAJ"
              },
              {
                "name": "益山市",
                "id": "IKS"
              },
              {
                "name": "长水郡",
                "id": "JSU"
              },
              {
                "name": "鎭安郡",
                "id": "JAN"
              }
            ]
          },
          {
            "name": "全罗南道",
            "id": "48",
            "City": [
              {
                "name": "宝城郡",
                "id": "BSG"
              },
              {
                "name": "高兴郡",
                "id": "GHG"
              },
              {
                "name": "谷城郡",
                "id": "GSE"
              },
              {
                "name": "莞岛郡",
                "id": "WND"
              },
              {
                "name": "光阳市",
                "id": "KAN"
              },
              {
                "name": "海南郡",
                "id": "HAE"
              },
              {
                "name": "和顺郡",
                "id": "HSN"
              },
              {
                "name": "康津郡",
                "id": "GJN"
              },
              {
                "name": "丽水市",
                "id": "YOS"
              },
              {
                "name": "灵光郡",
                "id": "YGG"
              },
              {
                "name": "灵岩郡",
                "id": "YAM"
              },
              {
                "name": "罗州市",
                "id": "NJU"
              },
              {
                "name": "木浦市",
                "id": "MOK"
              },
              {
                "name": "求礼郡",
                "id": "GRE"
              },
              {
                "name": "顺天市",
                "id": "SYS"
              },
              {
                "name": "潭阳郡",
                "id": "DYA"
              },
              {
                "name": "务安郡",
                "id": "MAN"
              },
              {
                "name": "咸平郡",
                "id": "HPG"
              },
              {
                "name": "新安郡",
                "id": "SAN"
              },
              {
                "name": "长城郡",
                "id": "JSN"
              },
              {
                "name": "长兴郡",
                "id": "JHG"
              },
              {
                "name": "珍岛郡",
                "id": "JDO"
              }
            ]
          },
          {
            "name": "仁川",
            "id": "28"
          },
          {
            "name": "首尔",
            "id": "11"
          },
          {
            "name": "蔚山",
            "id": "31"
          },
          {
            "name": "忠清北道",
            "id": "45",
            "City": [
              {
                "name": "报恩郡",
                "id": "BEN"
              },
              {
                "name": "曾坪郡",
                "id": "JYG"
              },
              {
                "name": "丹阳郡",
                "id": "DYG"
              },
              {
                "name": "堤川市",
                "id": "JCH"
              },
              {
                "name": "槐山郡",
                "id": "GSN"
              },
              {
                "name": "淸原郡",
                "id": "CWO"
              },
              {
                "name": "淸州市",
                "id": "CJJ"
              },
              {
                "name": "沃川郡",
                "id": "OCN"
              },
              {
                "name": "阴城郡",
                "id": "ESG"
              },
              {
                "name": "永同郡",
                "id": "YDG"
              },
              {
                "name": "鎭川郡",
                "id": "JCN"
              },
              {
                "name": "忠州市",
                "id": "CHU"
              }
            ]
          },
          {
            "name": "忠清南道",
            "id": "46",
            "City": [
              {
                "name": "保宁市",
                "id": "BOR"
              },
              {
                "name": "扶余郡",
                "id": "BYO"
              },
              {
                "name": "公州市",
                "id": "GOJ"
              },
              {
                "name": "洪城郡",
                "id": "HSE"
              },
              {
                "name": "鸡龙市",
                "id": "GYE"
              },
              {
                "name": "锦山郡",
                "id": "GSA"
              },
              {
                "name": "礼山郡",
                "id": "YOS"
              },
              {
                "name": "论山市",
                "id": "NSN"
              },
              {
                "name": "青阳郡",
                "id": "CYG"
              },
              {
                "name": "瑞山市",
                "id": "SSA"
              },
              {
                "name": "舒川郡",
                "id": "SCE"
              },
              {
                "name": "泰安郡",
                "id": "TAN"
              },
              {
                "name": "唐津郡",
                "id": "TJI"
              },
              {
                "name": "天安市",
                "id": "CHO"
              },
              {
                "name": "牙山市",
                "id": "ASA"
              },
              {
                "name": "燕岐郡",
                "id": "YGI"
              }
            ]
          }
        ]
      },
      {
        "name": "荷兰",
        "id": "NLD",
        "State": {
          "City": [
            {
              "name": "阿尔梅勒",
              "id": "AER"
            },
            {
              "name": "阿默斯福特",
              "id": "AME"
            },
            {
              "name": "阿姆斯特丹",
              "id": "AMS"
            },
            {
              "name": "阿纳姆",
              "id": "ARN"
            },
            {
              "name": "阿珀尔多伦",
              "id": "APE"
            },
            {
              "name": "阿森",
              "id": "ASS"
            },
            {
              "name": "埃德",
              "id": "EDE"
            },
            {
              "name": "埃门",
              "id": "EMM"
            },
            {
              "name": "埃因霍芬",
              "id": "EIN"
            },
            {
              "name": "布雷达",
              "id": "BRD"
            },
            {
              "name": "蒂尔堡",
              "id": "TLB"
            },
            {
              "name": "多德雷赫特",
              "id": "DOR"
            },
            {
              "name": "恩斯赫德",
              "id": "ENS"
            },
            {
              "name": "格罗宁根",
              "id": "GRQ"
            },
            {
              "name": "哈勒姆",
              "id": "HRA"
            },
            {
              "name": "海牙",
              "id": "HAG"
            },
            {
              "name": "霍夫多尔普",
              "id": "HFD"
            },
            {
              "name": "莱顿",
              "id": "LID"
            },
            {
              "name": "莱利斯塔德",
              "id": "LEY"
            },
            {
              "name": "鹿特丹",
              "id": "RTM"
            },
            {
              "name": "吕伐登",
              "id": "LWR"
            },
            {
              "name": "马斯特里赫特",
              "id": "MST"
            },
            {
              "name": "米德尔堡",
              "id": "MDL"
            },
            {
              "name": "奈梅亨",
              "id": "NIJ"
            },
            {
              "name": "斯海尔托亨博思",
              "id": "HTB"
            },
            {
              "name": "乌得勒支",
              "id": "UTC"
            },
            {
              "name": "兹沃勒",
              "id": "ZWO"
            },
            {
              "name": "佐特尔梅",
              "id": "ZTM"
            }
          ]
        }
      },
      {
        "name": "荷属安地列斯",
        "id": "ANT"
      },
      {
        "name": "赫德和麦克唐纳群岛",
        "id": "HMD"
      },
      {
        "name": "洪都拉斯",
        "id": "HND",
        "State": {
          "City": [
            {
              "name": "阿特兰蒂达",
              "id": "AT"
            },
            {
              "name": "埃尔帕拉伊索",
              "id": "PA"
            },
            {
              "name": "奥科特佩克",
              "id": "OC"
            },
            {
              "name": "奥兰乔",
              "id": "OL"
            },
            {
              "name": "弗朗西斯科莫拉桑",
              "id": "FM"
            },
            {
              "name": "格拉西亚斯阿迪奥斯",
              "id": "GD"
            },
            {
              "name": "海湾群岛",
              "id": "IB"
            },
            {
              "name": "科尔特斯",
              "id": "CR"
            },
            {
              "name": "科隆",
              "id": "CL"
            },
            {
              "name": "科马亚瓜",
              "id": "CM"
            },
            {
              "name": "科潘",
              "id": "CP"
            },
            {
              "name": "拉巴斯",
              "id": "PZ"
            },
            {
              "name": "伦皮拉",
              "id": "LE"
            },
            {
              "name": "乔卢特卡",
              "id": "CH"
            },
            {
              "name": "乔罗马",
              "id": "CHO"
            },
            {
              "name": "山谷",
              "id": "VA"
            },
            {
              "name": "圣巴巴拉",
              "id": "SB"
            },
            {
              "name": "因蒂布卡",
              "id": "IN"
            },
            {
              "name": "约罗",
              "id": "YO"
            }
          ]
        }
      },
      {
        "name": "基里巴斯",
        "id": "KIR",
        "State": {
          "City": [
            {
              "name": "菲尼克斯群岛",
              "id": "PHO"
            },
            {
              "name": "吉尔伯特群岛",
              "id": "GIL"
            },
            {
              "name": "莱恩群岛",
              "id": "LIN"
            }
          ]
        }
      },
      {
        "name": "吉布提",
        "id": "DJI",
        "State": {
          "City": [
            {
              "name": "阿里萨比赫区",
              "id": "S"
            },
            {
              "name": "奥博克区",
              "id": "O"
            },
            {
              "name": "迪基勒区",
              "id": "K"
            },
            {
              "name": "塔朱拉区",
              "id": "T"
            }
          ]
        }
      },
      {
        "name": "吉尔吉斯斯坦",
        "id": "KGZ",
        "State": {
          "City": [
            {
              "name": "奥什",
              "id": "O"
            },
            {
              "name": "巴特肯",
              "id": "B"
            },
            {
              "name": "比什凯克市",
              "id": "GB"
            },
            {
              "name": "楚河",
              "id": "C"
            },
            {
              "name": "贾拉拉巴德",
              "id": "J"
            },
            {
              "name": "卡拉巴尔塔",
              "id": "KBA"
            },
            {
              "name": "卡拉库尔",
              "id": "KKO"
            },
            {
              "name": "坎特",
              "id": "KAN"
            },
            {
              "name": "科克扬加克",
              "id": "KJ"
            },
            {
              "name": "迈利赛",
              "id": "MS"
            },
            {
              "name": "纳伦",
              "id": "N"
            },
            {
              "name": "苏卢克图",
              "id": "SU"
            },
            {
              "name": "塔拉斯",
              "id": "T"
            },
            {
              "name": "塔什库梅尔",
              "id": "TK"
            },
            {
              "name": "乌兹根",
              "id": "UG"
            },
            {
              "name": "伊塞克湖",
              "id": "Y"
            }
          ]
        }
      },
      {
        "name": "几内亚",
        "id": "GIN",
        "State": {
          "City": [
            {
              "name": "博凯",
              "id": "BOK"
            },
            {
              "name": "恩泽雷科雷",
              "id": "NZR"
            },
            {
              "name": "法拉纳",
              "id": "FRN"
            },
            {
              "name": "金迪亚",
              "id": "KND"
            },
            {
              "name": "康康",
              "id": "KNK"
            },
            {
              "name": "科纳克里",
              "id": "CNK"
            },
            {
              "name": "拉贝",
              "id": "LAB"
            },
            {
              "name": "玛木",
              "id": "MAM"
            }
          ]
        }
      },
      {
        "name": "几内亚比绍",
        "id": "GNB"
      },
      {
        "name": "加拿大",
        "id": "CAN",
        "State": {
          "City": [
            {
              "name": "阿伯茨福",
              "id": "ABB"
            },
            {
              "name": "埃德蒙顿",
              "id": "EDM"
            },
            {
              "name": "奥沙瓦",
              "id": "OSH"
            },
            {
              "name": "巴里",
              "id": "BAR"
            },
            {
              "name": "布列塔尼角",
              "id": "CBR"
            },
            {
              "name": "多伦多",
              "id": "TOR"
            },
            {
              "name": "弗雷德里顿",
              "id": "FRE"
            },
            {
              "name": "圭尔夫",
              "id": "GLP"
            },
            {
              "name": "哈利法克斯",
              "id": "HAL"
            },
            {
              "name": "哈密尔顿",
              "id": "HAM"
            },
            {
              "name": "怀特霍斯",
              "id": "YXY"
            },
            {
              "name": "基劳纳",
              "id": "KWL"
            },
            {
              "name": "基奇纳",
              "id": "BRP"
            },
            {
              "name": "金斯敦",
              "id": "KGN"
            },
            {
              "name": "卡里加里",
              "id": "CAL"
            },
            {
              "name": "魁北克",
              "id": "QUE"
            },
            {
              "name": "里贾纳",
              "id": "REG"
            },
            {
              "name": "伦敦",
              "id": "LOD"
            },
            {
              "name": "蒙特利尔",
              "id": "MTR"
            },
            {
              "name": "萨德伯里",
              "id": "SUD"
            },
            {
              "name": "萨斯卡通",
              "id": "SAK"
            },
            {
              "name": "三河城",
              "id": "TRR"
            },
            {
              "name": "桑德贝",
              "id": "THU"
            },
            {
              "name": "舍布鲁克",
              "id": "SBE"
            },
            {
              "name": "圣卡塔琳娜",
              "id": "SCA"
            },
            {
              "name": "圣约翰斯",
              "id": "SJB"
            },
            {
              "name": "维多利亚",
              "id": "VIC"
            },
            {
              "name": "温哥华",
              "id": "VAN"
            },
            {
              "name": "温尼伯",
              "id": "WNP"
            },
            {
              "name": "温莎",
              "id": "WDR"
            },
            {
              "name": "渥太华",
              "id": "OTT"
            },
            {
              "name": "夏洛特敦",
              "id": "CHA"
            },
            {
              "name": "耶洛奈夫",
              "id": "YZF"
            },
            {
              "name": "伊魁特",
              "id": "IQL"
            }
          ]
        }
      },
      {
        "name": "加纳",
        "id": "GHA",
        "State": {
          "City": [
            {
              "name": "阿散蒂",
              "id": "AS"
            },
            {
              "name": "奥布阿西",
              "id": "OBU"
            },
            {
              "name": "北部",
              "id": "NO"
            },
            {
              "name": "布朗阿哈福",
              "id": "BA"
            },
            {
              "name": "大阿克拉",
              "id": "GA"
            },
            {
              "name": "东部",
              "id": "EA"
            },
            {
              "name": "上东部",
              "id": "UE"
            },
            {
              "name": "上西部",
              "id": "UW"
            },
            {
              "name": "沃尔特",
              "id": "VO"
            },
            {
              "name": "西部",
              "id": "WE"
            },
            {
              "name": "中部",
              "id": "CE"
            }
          ]
        }
      },
      {
        "name": "加蓬",
        "id": "GAB",
        "State": {
          "City": [
            {
              "name": "奥果韦洛洛",
              "id": "OL"
            },
            {
              "name": "奥果韦伊温多",
              "id": "OI"
            },
            {
              "name": "滨海奥果韦",
              "id": "OM"
            },
            {
              "name": "恩古涅",
              "id": "NG"
            },
            {
              "name": "河口",
              "id": "ES"
            },
            {
              "name": "尼扬加",
              "id": "NY"
            },
            {
              "name": "上奥果韦",
              "id": "HO"
            },
            {
              "name": "沃勒恩特姆",
              "id": "WN"
            },
            {
              "name": "中奥果韦",
              "id": "MO"
            }
          ]
        }
      },
      {
        "name": "柬埔寨",
        "id": "KHM",
        "State": {
          "City": [
            {
              "name": "奥多棉吉",
              "id": "OC"
            },
            {
              "name": "白马市",
              "id": "KB"
            },
            {
              "name": "柏威夏",
              "id": "PR"
            },
            {
              "name": "拜林市",
              "id": "PL"
            },
            {
              "name": "班迭棉吉",
              "id": "BM"
            },
            {
              "name": "磅清扬",
              "id": "KZC"
            },
            {
              "name": "磅士卑",
              "id": "KO"
            },
            {
              "name": "磅同",
              "id": "KZK"
            },
            {
              "name": "磅湛",
              "id": "KM"
            },
            {
              "name": "波罗勉",
              "id": "PG"
            },
            {
              "name": "茶胶",
              "id": "TK"
            },
            {
              "name": "柴桢",
              "id": "SVR"
            },
            {
              "name": "干丹",
              "id": "KL"
            },
            {
              "name": "戈公",
              "id": "KKZ"
            },
            {
              "name": "贡布",
              "id": "KMT"
            },
            {
              "name": "金边市",
              "id": "PNH"
            },
            {
              "name": "桔井",
              "id": "KH"
            },
            {
              "name": "腊塔纳基里",
              "id": "RBE"
            },
            {
              "name": "马德望",
              "id": "BA"
            },
            {
              "name": "蒙多基里",
              "id": "MWV"
            },
            {
              "name": "菩萨",
              "id": "PO"
            },
            {
              "name": "上丁",
              "id": "TNX"
            },
            {
              "name": "西哈努克市",
              "id": "KA"
            },
            {
              "name": "暹粒",
              "id": "REP"
            }
          ]
        }
      },
      {
        "name": "捷克共和国",
        "id": "CZE",
        "State": {
          "City": [
            {
              "name": "奥洛穆茨",
              "id": "OL"
            },
            {
              "name": "比尔森",
              "id": "PL"
            },
            {
              "name": "布拉格直辖市",
              "id": "PR"
            },
            {
              "name": "赫拉德茨克拉洛韦",
              "id": "KR"
            },
            {
              "name": "卡罗维发利",
              "id": "KA"
            },
            {
              "name": "利贝雷克",
              "id": "LI"
            },
            {
              "name": "摩拉维亚西里西亚",
              "id": "MO"
            },
            {
              "name": "南摩拉维亚",
              "id": "JC"
            },
            {
              "name": "帕尔杜比采",
              "id": "PA"
            },
            {
              "name": "维索基纳",
              "id": "VY"
            },
            {
              "name": "乌斯季",
              "id": "US"
            },
            {
              "name": "中捷克",
              "id": "ST"
            },
            {
              "name": "兹林",
              "id": "ZL"
            }
          ]
        }
      },
      {
        "name": "津巴布韦",
        "id": "ZWE",
        "State": {
          "City": [
            {
              "name": "北马塔贝莱兰",
              "id": "MN"
            },
            {
              "name": "布拉瓦约",
              "id": "BU"
            },
            {
              "name": "东马绍纳兰",
              "id": "ME"
            },
            {
              "name": "哈拉雷",
              "id": "HA"
            },
            {
              "name": "马尼卡兰",
              "id": "ML"
            },
            {
              "name": "马斯温戈",
              "id": "MV"
            },
            {
              "name": "南马塔贝莱兰",
              "id": "MS"
            },
            {
              "name": "西马绍纳兰",
              "id": "MW"
            },
            {
              "name": "中部",
              "id": "MD"
            },
            {
              "name": "中马绍纳兰",
              "id": "MC"
            }
          ]
        }
      },
      {
        "name": "喀麦隆",
        "id": "CMR",
        "State": {
          "City": [
            {
              "name": "阿达马瓦",
              "id": "ADA"
            },
            {
              "name": "北部",
              "id": "NOR"
            },
            {
              "name": "北端",
              "id": "EXN"
            },
            {
              "name": "滨海",
              "id": "LIT"
            },
            {
              "name": "东部",
              "id": "EST"
            },
            {
              "name": "南部",
              "id": "SUD"
            },
            {
              "name": "西北",
              "id": "NOT"
            },
            {
              "name": "西部",
              "id": "OUE"
            },
            {
              "name": "西南",
              "id": "SOU"
            },
            {
              "name": "中央",
              "id": "CEN"
            }
          ]
        }
      },
      {
        "name": "卡塔尔",
        "id": "QAT",
        "State": {
          "City": [
            {
              "name": "北部",
              "id": "MS"
            },
            {
              "name": "多哈",
              "id": "DW"
            },
            {
              "name": "古韦里耶",
              "id": "GW"
            },
            {
              "name": "豪尔",
              "id": "KR"
            },
            {
              "name": "杰里扬拜特奈",
              "id": "JB"
            },
            {
              "name": "赖扬",
              "id": "RN"
            },
            {
              "name": "沃克拉",
              "id": "WK"
            },
            {
              "name": "乌姆锡拉勒",
              "id": "UL"
            },
            {
              "name": "朱迈利耶",
              "id": "JM"
            }
          ]
        }
      },
      {
        "name": "开曼群岛",
        "id": "CYM"
      },
      {
        "name": "科科斯群岛",
        "id": "CCK"
      },
      {
        "name": "科摩罗",
        "id": "COM"
      },
      {
        "name": "科特迪瓦",
        "id": "CIV",
        "State": {
          "City": [
            {
              "name": "阿涅比",
              "id": "AG"
            },
            {
              "name": "巴芬",
              "id": "BF"
            },
            {
              "name": "邦达马河谷",
              "id": "VB"
            },
            {
              "name": "登盖莱",
              "id": "DE"
            },
            {
              "name": "恩济－科莫埃",
              "id": "NC"
            },
            {
              "name": "弗罗马格尔",
              "id": "FR"
            },
            {
              "name": "湖泊",
              "id": "LC"
            },
            {
              "name": "马拉韦",
              "id": "MR"
            },
            {
              "name": "南邦达马",
              "id": "SB"
            },
            {
              "name": "南科莫埃",
              "id": "SC"
            },
            {
              "name": "萨桑德拉",
              "id": "HT"
            },
            {
              "name": "萨瓦纳",
              "id": "SV"
            },
            {
              "name": "山地",
              "id": "DH"
            },
            {
              "name": "沃罗杜古",
              "id": "WR"
            },
            {
              "name": "下萨桑德拉",
              "id": "BS"
            },
            {
              "name": "泻湖",
              "id": "LG"
            },
            {
              "name": "赞赞",
              "id": "ZA"
            },
            {
              "name": "中卡瓦利",
              "id": "MV"
            },
            {
              "name": "中科莫埃",
              "id": "MC"
            }
          ]
        }
      },
      {
        "name": "科威特",
        "id": "KWT"
      },
      {
        "name": "克罗地亚",
        "id": "HRV",
        "State": {
          "City": [
            {
              "name": "奥西耶克巴拉尼亚",
              "id": "14"
            },
            {
              "name": "别洛瓦尔比洛戈拉",
              "id": "7"
            },
            {
              "name": "滨海和山区",
              "id": "8"
            },
            {
              "name": "波热加斯拉沃尼亚",
              "id": "11"
            },
            {
              "name": "布罗德波萨维纳",
              "id": "12"
            },
            {
              "name": "杜布罗夫斯克内雷特瓦",
              "id": "19"
            },
            {
              "name": "卡尔洛瓦茨",
              "id": "4"
            },
            {
              "name": "科普里夫尼察克里热夫齐",
              "id": "6"
            },
            {
              "name": "克拉皮纳扎戈列",
              "id": "2"
            },
            {
              "name": "利卡塞尼",
              "id": "9"
            },
            {
              "name": "梅吉穆列",
              "id": "20"
            },
            {
              "name": "萨格勒布",
              "id": "1"
            },
            {
              "name": "萨格勒布市",
              "id": "21"
            },
            {
              "name": "斯普利特达尔马提亚",
              "id": "17"
            },
            {
              "name": "瓦拉日丁",
              "id": "5"
            },
            {
              "name": "维罗维蒂察波德拉维纳",
              "id": "10"
            },
            {
              "name": "武科瓦尔斯里耶姆",
              "id": "16"
            },
            {
              "name": "希贝尼克克宁",
              "id": "15"
            },
            {
              "name": "锡萨克莫斯拉维纳",
              "id": "3"
            },
            {
              "name": "伊斯特拉",
              "id": "18"
            },
            {
              "name": "扎达尔",
              "id": "13"
            }
          ]
        }
      },
      {
        "name": "肯尼亚",
        "id": "KEN",
        "State": {
          "City": [
            {
              "name": "埃尔格约马拉奎特",
              "id": "EMA"
            },
            {
              "name": "巴林戈",
              "id": "BAR"
            },
            {
              "name": "邦戈马",
              "id": "BUN"
            },
            {
              "name": "博美特",
              "id": "BOM"
            },
            {
              "name": "布希亚",
              "id": "BUS"
            },
            {
              "name": "恩布",
              "id": "EMB"
            },
            {
              "name": "霍马湾",
              "id": "HOB"
            },
            {
              "name": "基安布",
              "id": "KIA"
            },
            {
              "name": "基里菲",
              "id": "KIL"
            },
            {
              "name": "基里尼亚加",
              "id": "KIR"
            },
            {
              "name": "基苏木",
              "id": "KIS"
            },
            {
              "name": "基图伊",
              "id": "KIT"
            },
            {
              "name": "基西",
              "id": "KII"
            },
            {
              "name": "加里萨",
              "id": "GAS"
            },
            {
              "name": "卡卡梅加",
              "id": "KAK"
            },
            {
              "name": "卡耶亚多",
              "id": "KAJ"
            },
            {
              "name": "凯里乔",
              "id": "KEY"
            },
            {
              "name": "夸勒",
              "id": "KWA"
            },
            {
              "name": "拉木",
              "id": "LAU"
            },
            {
              "name": "莱基皮亚",
              "id": "LAI"
            },
            {
              "name": "马查科斯",
              "id": "MAC"
            },
            {
              "name": "马瓜尼",
              "id": "MAK"
            },
            {
              "name": "马萨布布",
              "id": "RBT"
            },
            {
              "name": "曼德拉",
              "id": "MAN"
            },
            {
              "name": "梅鲁",
              "id": "MER"
            },
            {
              "name": "蒙巴萨",
              "id": "MOM"
            },
            {
              "name": "米戈利",
              "id": "MIG"
            },
            {
              "name": "穆兰卡",
              "id": "MUR"
            },
            {
              "name": "纳库鲁",
              "id": "NUU"
            },
            {
              "name": "纳罗克",
              "id": "NAR"
            },
            {
              "name": "南迪",
              "id": "NAN"
            },
            {
              "name": "内罗毕",
              "id": "NA"
            },
            {
              "name": "尼蒂",
              "id": "NIT"
            },
            {
              "name": "尼亚米拉",
              "id": "NYM"
            },
            {
              "name": "年达鲁阿",
              "id": "NYN"
            },
            {
              "name": "涅里",
              "id": "NYE"
            },
            {
              "name": "桑布卢",
              "id": "UAS"
            },
            {
              "name": "塔纳河",
              "id": "TRI"
            },
            {
              "name": "泰塔塔维塔",
              "id": "TTA"
            },
            {
              "name": "特兰斯恩佐亚",
              "id": "TNZ"
            },
            {
              "name": "图尔卡纳",
              "id": "TUR"
            },
            {
              "name": "瓦吉尔",
              "id": "WJR"
            },
            {
              "name": "瓦辛基苏",
              "id": "UGI"
            },
            {
              "name": "韦希加",
              "id": "VIH"
            },
            {
              "name": "西波克特",
              "id": "WPO"
            },
            {
              "name": "夏亚",
              "id": "SIA"
            },
            {
              "name": "伊希约洛",
              "id": "ISI"
            },
            {
              "name": "中央",
              "id": "CE"
            }
          ]
        }
      },
      {
        "name": "库克群岛",
        "id": "COK"
      },
      {
        "name": "拉脱维亚",
        "id": "LVA",
        "State": {
          "City": [
            {
              "name": "阿卢克斯内",
              "id": "ALU"
            },
            {
              "name": "爱兹克劳克雷",
              "id": "AIZ"
            },
            {
              "name": "奥格雷",
              "id": "OGR"
            },
            {
              "name": "巴尔维",
              "id": "BAL"
            },
            {
              "name": "包斯卡",
              "id": "BAU"
            },
            {
              "name": "采西斯",
              "id": "CES"
            },
            {
              "name": "多贝莱",
              "id": "DOB"
            },
            {
              "name": "古尔贝内",
              "id": "GUL"
            },
            {
              "name": "杰卡布皮尔斯",
              "id": "JEK"
            },
            {
              "name": "克拉斯拉瓦",
              "id": "KRA"
            },
            {
              "name": "库尔迪加",
              "id": "KUL"
            },
            {
              "name": "雷泽克内",
              "id": "RZR"
            },
            {
              "name": "里加",
              "id": "RGA"
            },
            {
              "name": "利耶帕亚",
              "id": "LPK"
            },
            {
              "name": "林巴济",
              "id": "LIM"
            },
            {
              "name": "卢扎",
              "id": "LUD"
            },
            {
              "name": "马多纳",
              "id": "MAD"
            },
            {
              "name": "普雷利",
              "id": "PRE"
            },
            {
              "name": "萨尔杜斯",
              "id": "SAL"
            },
            {
              "name": "塔尔西",
              "id": "TAL"
            },
            {
              "name": "陶格夫皮尔斯",
              "id": "DGR"
            },
            {
              "name": "图库马",
              "id": "TUK"
            },
            {
              "name": "瓦尔加",
              "id": "VLK"
            },
            {
              "name": "瓦尔米耶拉",
              "id": "VLM"
            },
            {
              "name": "文茨皮尔斯",
              "id": "VSL"
            },
            {
              "name": "叶尔加瓦",
              "id": "JGR"
            }
          ]
        }
      },
      {
        "name": "莱索托",
        "id": "LSO",
        "State": {
          "City": [
            {
              "name": "伯里亚",
              "id": "D"
            },
            {
              "name": "布塔布泰",
              "id": "B"
            },
            {
              "name": "古廷",
              "id": "G"
            },
            {
              "name": "加查斯内克",
              "id": "H"
            },
            {
              "name": "莱里贝",
              "id": "C"
            },
            {
              "name": "马费滕",
              "id": "E"
            },
            {
              "name": "马塞卢",
              "id": "A"
            },
            {
              "name": "莫哈莱斯胡克",
              "id": "F"
            },
            {
              "name": "莫霍特隆",
              "id": "J"
            },
            {
              "name": "塔巴采卡",
              "id": "K"
            }
          ]
        }
      },
      {
        "name": "老挝",
        "id": "LAO",
        "State": {
          "City": [
            {
              "name": "阿速坡",
              "id": "AT"
            },
            {
              "name": "波里坎赛",
              "id": "BL"
            },
            {
              "name": "博乔",
              "id": "BK"
            },
            {
              "name": "川圹",
              "id": "XI"
            },
            {
              "name": "丰沙里",
              "id": "PH"
            },
            {
              "name": "甘蒙",
              "id": "KH"
            },
            {
              "name": "华潘",
              "id": "HO"
            },
            {
              "name": "琅勃拉邦",
              "id": "LP"
            },
            {
              "name": "琅南塔",
              "id": "LM"
            },
            {
              "name": "赛宋本行政特区",
              "id": "XN"
            },
            {
              "name": "色贡",
              "id": "XE"
            },
            {
              "name": "沙拉湾",
              "id": "SL"
            },
            {
              "name": "沙湾拿吉",
              "id": "SV"
            },
            {
              "name": "沙耶武里",
              "id": "XA"
            },
            {
              "name": "万象",
              "id": "VI"
            },
            {
              "name": "乌多姆赛",
              "id": "OU"
            },
            {
              "name": "占巴塞",
              "id": "CH"
            }
          ]
        }
      },
      {
        "name": "黎巴嫩",
        "id": "LBN",
        "State": {
          "City": [
            {
              "name": "北部",
              "id": "AS"
            },
            {
              "name": "贝卡",
              "id": "BI"
            },
            {
              "name": "贝鲁特",
              "id": "BA"
            },
            {
              "name": "黎巴嫩山",
              "id": "JL"
            },
            {
              "name": "奈拜提耶市",
              "id": "NA"
            },
            {
              "name": "南部",
              "id": "JA"
            }
          ]
        }
      },
      {
        "name": "利比里亚",
        "id": "LBR",
        "State": {
          "City": [
            {
              "name": "巴波卢",
              "id": "GBA"
            },
            {
              "name": "邦",
              "id": "BG"
            },
            {
              "name": "博波卢",
              "id": "BOP"
            },
            {
              "name": "博米",
              "id": "BM"
            },
            {
              "name": "大巴萨",
              "id": "GB"
            },
            {
              "name": "大吉德",
              "id": "GG"
            },
            {
              "name": "大角山",
              "id": "CM"
            },
            {
              "name": "大克鲁",
              "id": "GK"
            },
            {
              "name": "菲什敦",
              "id": "FT"
            },
            {
              "name": "吉河",
              "id": "RG"
            },
            {
              "name": "里弗塞斯",
              "id": "RI"
            },
            {
              "name": "洛法",
              "id": "LO"
            },
            {
              "name": "马吉比",
              "id": "MG"
            },
            {
              "name": "马里兰",
              "id": "MY"
            },
            {
              "name": "蒙特塞拉多",
              "id": "MO"
            },
            {
              "name": "宁巴",
              "id": "NI"
            },
            {
              "name": "锡诺",
              "id": "SI"
            }
          ]
        }
      },
      {
        "name": "利比亚",
        "id": "LBY"
      },
      {
        "name": "立陶宛",
        "id": "LTU",
        "State": {
          "City": [
            {
              "name": "阿利图斯",
              "id": "AL"
            },
            {
              "name": "考纳斯",
              "id": "KA"
            },
            {
              "name": "克莱佩达",
              "id": "KL"
            },
            {
              "name": "马里扬泊列",
              "id": "MA"
            },
            {
              "name": "帕涅韦日斯",
              "id": "PA"
            },
            {
              "name": "陶拉格",
              "id": "TA"
            },
            {
              "name": "特尔希艾",
              "id": "TE"
            },
            {
              "name": "维尔纽斯",
              "id": "VI"
            },
            {
              "name": "乌田纳",
              "id": "UT"
            },
            {
              "name": "希奥利艾",
              "id": "SI"
            },
            {
              "name": "亚克曼",
              "id": "AKM"
            }
          ]
        }
      },
      {
        "name": "列支敦士登",
        "id": "LIE"
      },
      {
        "name": "留尼旺岛",
        "id": "REU"
      },
      {
        "name": "卢森堡",
        "id": "LUX",
        "State": {
          "City": [
            {
              "name": "迪基希",
              "id": "DD"
            },
            {
              "name": "格雷文马赫",
              "id": "GG"
            },
            {
              "name": "卢森堡",
              "id": "LL"
            }
          ]
        }
      },
      {
        "name": "卢旺达",
        "id": "RWA",
        "State": {
          "City": [
            {
              "name": "比温巴",
              "id": "BY"
            },
            {
              "name": "布塔雷",
              "id": "BU"
            },
            {
              "name": "恩延扎",
              "id": "NY"
            },
            {
              "name": "基本古",
              "id": "KG"
            },
            {
              "name": "基布耶",
              "id": "KY"
            },
            {
              "name": "基加利恩加利",
              "id": "KR"
            },
            {
              "name": "基加利市",
              "id": "KV"
            },
            {
              "name": "吉孔戈罗",
              "id": "GK"
            },
            {
              "name": "吉塞尼",
              "id": "GS"
            },
            {
              "name": "吉塔拉马",
              "id": "GT"
            },
            {
              "name": "卡布加",
              "id": "KA"
            },
            {
              "name": "卢瓦马加纳",
              "id": "RW"
            },
            {
              "name": "鲁汉戈",
              "id": "RH"
            },
            {
              "name": "鲁亨盖里",
              "id": "RU"
            },
            {
              "name": "尚古古",
              "id": "CY"
            },
            {
              "name": "乌姆塔拉",
              "id": "UM"
            }
          ]
        }
      },
      {
        "name": "罗马尼亚",
        "id": "ROU",
        "State": {
          "City": [
            {
              "name": "阿尔巴尤利亚",
              "id": "AL"
            },
            {
              "name": "阿拉德",
              "id": "AR"
            },
            {
              "name": "奥拉迪亚",
              "id": "OR"
            },
            {
              "name": "巴克乌",
              "id": "BA"
            },
            {
              "name": "巴亚马雷",
              "id": "BM"
            },
            {
              "name": "比斯特里察",
              "id": "BN"
            },
            {
              "name": "博托沙尼",
              "id": "BO"
            },
            {
              "name": "布加勒斯特",
              "id": "BC"
            },
            {
              "name": "布拉索夫",
              "id": "BS"
            },
            {
              "name": "布勒伊拉",
              "id": "BL"
            },
            {
              "name": "布泽乌",
              "id": "BZ"
            },
            {
              "name": "德罗贝塔塞维林堡",
              "id": "DT"
            },
            {
              "name": "德瓦",
              "id": "DE"
            },
            {
              "name": "蒂米什瓦拉",
              "id": "TI"
            },
            {
              "name": "福克沙尼",
              "id": "FO"
            },
            {
              "name": "加拉茨",
              "id": "GL"
            },
            {
              "name": "久尔久",
              "id": "GG"
            },
            {
              "name": "康斯坦察",
              "id": "CT"
            },
            {
              "name": "克拉约瓦",
              "id": "DO"
            },
            {
              "name": "克勒拉希",
              "id": "CR"
            },
            {
              "name": "克卢日纳波卡",
              "id": "CN"
            },
            {
              "name": "勒姆尼库沃尔恰",
              "id": "VI"
            },
            {
              "name": "雷希察",
              "id": "RE"
            },
            {
              "name": "梅尔库里亚丘克",
              "id": "MC"
            },
            {
              "name": "皮特什蒂",
              "id": "PI"
            },
            {
              "name": "皮亚特拉尼亚姆茨",
              "id": "PN"
            },
            {
              "name": "普洛耶什蒂",
              "id": "PL"
            },
            {
              "name": "萨图·马雷",
              "id": "SM"
            },
            {
              "name": "圣格奥尔基",
              "id": "SG"
            },
            {
              "name": "斯拉蒂纳",
              "id": "ST"
            },
            {
              "name": "斯洛博齐亚",
              "id": "SB"
            },
            {
              "name": "苏恰瓦",
              "id": "SU"
            },
            {
              "name": "特尔戈维什泰",
              "id": "TA"
            },
            {
              "name": "特尔古穆列什",
              "id": "TM"
            },
            {
              "name": "特尔古日乌",
              "id": "TJ"
            },
            {
              "name": "图尔恰",
              "id": "TU"
            },
            {
              "name": "瓦斯卢伊",
              "id": "VA"
            },
            {
              "name": "锡比乌",
              "id": "SO"
            },
            {
              "name": "雅西",
              "id": "IS"
            },
            {
              "name": "亚厉山德里亚",
              "id": "AD"
            },
            {
              "name": "扎勒乌",
              "id": "ZA"
            }
          ]
        }
      },
      {
        "name": "马达加斯加",
        "id": "MDG",
        "State": {
          "City": [
            {
              "name": "安齐拉纳纳",
              "id": "AS"
            },
            {
              "name": "菲亚纳兰楚阿",
              "id": "FN"
            },
            {
              "name": "马哈赞加",
              "id": "MJ"
            },
            {
              "name": "塔那那利佛",
              "id": "AN"
            },
            {
              "name": "图阿马西拉",
              "id": "TM"
            },
            {
              "name": "图利亚拉",
              "id": "TL"
            }
          ]
        }
      },
      {
        "name": "马尔代夫",
        "id": "MDV",
        "State": {
          "City": [
            {
              "name": "阿杜",
              "id": "ADD"
            },
            {
              "name": "北阿里",
              "id": "AAD"
            },
            {
              "name": "北蒂拉杜马蒂",
              "id": "THD"
            },
            {
              "name": "北马洛斯马杜卢",
              "id": "MAD"
            },
            {
              "name": "北米拉杜马杜卢",
              "id": "MLD"
            },
            {
              "name": "北尼兰杜",
              "id": "NAD"
            },
            {
              "name": "北苏瓦迪瓦",
              "id": "HAD"
            },
            {
              "name": "法迪福卢",
              "id": "FAA"
            },
            {
              "name": "费利杜",
              "id": "FEA"
            },
            {
              "name": "福阿穆拉库",
              "id": "FMU"
            },
            {
              "name": "哈杜马蒂",
              "id": "HDH"
            },
            {
              "name": "科卢马杜卢",
              "id": "KLH"
            },
            {
              "name": "马累",
              "id": "MAL"
            },
            {
              "name": "马累岛",
              "id": "MAA"
            },
            {
              "name": "穆拉库",
              "id": "MUA"
            },
            {
              "name": "南阿里",
              "id": "AAU"
            },
            {
              "name": "南蒂拉杜马蒂",
              "id": "THU"
            },
            {
              "name": "南马洛斯马杜卢",
              "id": "MAU"
            },
            {
              "name": "南米拉杜马杜卢",
              "id": "MLU"
            },
            {
              "name": "南尼兰杜",
              "id": "NAU"
            },
            {
              "name": "南苏瓦迪瓦",
              "id": "HAU"
            }
          ]
        }
      },
      {
        "name": "马耳他",
        "id": "MLT"
      },
      {
        "name": "马拉维",
        "id": "MWI",
        "State": {
          "City": [
            {
              "name": "北部区",
              "id": "N"
            },
            {
              "name": "南部区",
              "id": "S"
            },
            {
              "name": "中央区",
              "id": "C"
            }
          ]
        }
      },
      {
        "name": "马来西亚",
        "id": "MYS",
        "State": [
          {
            "name": "槟榔屿",
            "id": "PH",
            "City": [
              {
                "name": "北海",
                "id": "BWH"
              },
              {
                "name": "槟城",
                "id": "PEN"
              },
              {
                "name": "大山脚",
                "id": "BMJ"
              },
              {
                "name": "高渊",
                "id": "NTE"
              }
            ]
          },
          {
            "name": "玻璃市",
            "id": "PS",
            "City": {
              "name": "加央",
              "id": "KGR"
            }
          },
          {
            "name": "丁加奴",
            "id": "TR",
            "City": [
              {
                "name": "甘马挽",
                "id": "KEM"
              },
              {
                "name": "瓜拉丁加奴",
                "id": "TGG"
              },
              {
                "name": "龙运",
                "id": "DGN"
              },
              {
                "name": "马江",
                "id": "MAR"
              },
              {
                "name": "实兆",
                "id": "SET"
              },
              {
                "name": "乌鲁",
                "id": "HUL"
              },
              {
                "name": "勿述",
                "id": "BES"
              }
            ]
          },
          {
            "name": "吉打",
            "id": "KD",
            "City": [
              {
                "name": "巴东得腊",
                "id": "PGT"
              },
              {
                "name": "笨筒",
                "id": "PEN"
              },
              {
                "name": "浮罗交怡",
                "id": "LGK"
              },
              {
                "name": "哥打士打",
                "id": "KOR"
              },
              {
                "name": "古邦巴素",
                "id": "KPA"
              },
              {
                "name": "瓜拉姆达",
                "id": "KMU"
              },
              {
                "name": "华玲",
                "id": "BLZ"
              },
              {
                "name": "居林",
                "id": "KLM"
              },
              {
                "name": "万拉峇鲁",
                "id": "BMA"
              }
            ]
          },
          {
            "name": "吉兰丹",
            "id": "KN",
            "City": [
              {
                "name": "巴西富地",
                "id": "PPU"
              },
              {
                "name": "巴西马",
                "id": "PMA"
              },
              {
                "name": "丹那美拉",
                "id": "TMR"
              },
              {
                "name": "道北",
                "id": "TUM"
              },
              {
                "name": "登卓",
                "id": "BAC"
              },
              {
                "name": "哥打巴鲁",
                "id": "KBR"
              },
              {
                "name": "瓜拉吉赖",
                "id": "KUG"
              },
              {
                "name": "话望生",
                "id": "GMU"
              },
              {
                "name": "马樟",
                "id": "MAC"
              },
              {
                "name": "日里",
                "id": "JEL"
              }
            ]
          },
          {
            "name": "吉隆坡",
            "id": "KL",
            "City": {
              "name": "吉隆坡",
              "id": "KUL"
            }
          },
          {
            "name": "马六甲",
            "id": "ML",
            "City": [
              {
                "name": "马六甲市",
                "id": "MEL"
              },
              {
                "name": "亚罗牙也",
                "id": "AOG"
              },
              {
                "name": "野新",
                "id": "JAS"
              }
            ]
          },
          {
            "name": "纳闽",
            "id": "LB",
            "City": [
              {
                "name": "纳闽",
                "id": "LBU"
              },
              {
                "name": "维多利亚",
                "id": "VIC"
              }
            ]
          },
          {
            "name": "彭亨",
            "id": "PG",
            "City": [
              {
                "name": "百乐",
                "id": "BER"
              },
              {
                "name": "北根",
                "id": "PEK"
              },
              {
                "name": "淡马鲁",
                "id": "TEM"
              },
              {
                "name": "而连突",
                "id": "JER"
              },
              {
                "name": "关丹",
                "id": "KUA"
              },
              {
                "name": "金马仑高原",
                "id": "CAH"
              },
              {
                "name": "劳勿",
                "id": "RAU"
              },
              {
                "name": "立卑",
                "id": "KUL"
              },
              {
                "name": "马兰",
                "id": "MAR"
              },
              {
                "name": "文冬",
                "id": "BEN"
              },
              {
                "name": "云冰",
                "id": "TOM"
              }
            ]
          },
          {
            "name": "霹雳",
            "id": "PK",
            "City": [
              {
                "name": "安顺",
                "id": "TAS"
              },
              {
                "name": "丹绒马",
                "id": "TAM"
              },
              {
                "name": "和丰",
                "id": "SSP"
              },
              {
                "name": "紅土坎",
                "id": "LUM"
              },
              {
                "name": "华都牙也",
                "id": "BGA"
              },
              {
                "name": "江沙",
                "id": "KAR"
              },
              {
                "name": "太平",
                "id": "TPG"
              },
              {
                "name": "怡保",
                "id": "IPH"
              }
            ]
          },
          {
            "name": "柔佛",
            "id": "JH",
            "City": [
              {
                "name": "笨珍",
                "id": "POW"
              },
              {
                "name": "丰盛港",
                "id": "MEP"
              },
              {
                "name": "哥打丁宜",
                "id": "KTI"
              },
              {
                "name": "居銮",
                "id": "KLA"
              },
              {
                "name": "峇株巴辖",
                "id": "BAT"
              },
              {
                "name": "麻坡",
                "id": "MUA"
              },
              {
                "name": "昔加末",
                "id": "SGM"
              },
              {
                "name": "新山",
                "id": "JHB"
              }
            ]
          },
          {
            "name": "森美兰",
            "id": "NS",
            "City": [
              {
                "name": "波德申",
                "id": "PDI"
              },
              {
                "name": "淡边",
                "id": "TAI"
              },
              {
                "name": "芙蓉",
                "id": "SRB"
              },
              {
                "name": "瓜拉庇劳",
                "id": "KPI"
              },
              {
                "name": "林茂",
                "id": "REM"
              },
              {
                "name": "仁保",
                "id": "JEP"
              },
              {
                "name": "日叻务",
                "id": "JEL"
              }
            ]
          },
          {
            "name": "沙巴",
            "id": "SB",
            "City": [
              {
                "name": "吧巴",
                "id": "PAP"
              },
              {
                "name": "保佛",
                "id": "BEF"
              },
              {
                "name": "比鲁兰",
                "id": "BEL"
              },
              {
                "name": "必达士",
                "id": "PIT"
              },
              {
                "name": "兵南邦",
                "id": "PMP"
              },
              {
                "name": "担布南",
                "id": "TAB"
              },
              {
                "name": "丹南",
                "id": "TEN"
              },
              {
                "name": "斗湖",
                "id": "TAW"
              },
              {
                "name": "斗亚兰",
                "id": "TUR"
              },
              {
                "name": "哥打基纳巴鲁",
                "id": "BKI"
              },
              {
                "name": "哥打马鲁都",
                "id": "KMU"
              },
              {
                "name": "根地咬",
                "id": "KEG"
              },
              {
                "name": "古达",
                "id": "KUD"
              },
              {
                "name": "古打毛律",
                "id": "KBD"
              },
              {
                "name": "古纳",
                "id": "KUN"
              },
              {
                "name": "瓜拉班尤",
                "id": "KPU"
              },
              {
                "name": "京那巴登岸",
                "id": "KBT"
              },
              {
                "name": "兰脑",
                "id": "RNU"
              },
              {
                "name": "拿笃",
                "id": "LDU"
              },
              {
                "name": "纳巴湾",
                "id": "NAB"
              },
              {
                "name": "山打根",
                "id": "SDK"
              },
              {
                "name": "西比陶",
                "id": "SPT"
              },
              {
                "name": "仙本那",
                "id": "SMM"
              }
            ]
          },
          {
            "name": "沙捞越",
            "id": "SR",
            "City": [
              {
                "name": "古晋",
                "id": "KCH"
              },
              {
                "name": "加帛",
                "id": "KPI"
              },
              {
                "name": "林梦",
                "id": "LMN"
              },
              {
                "name": "美里",
                "id": "MYY"
              },
              {
                "name": "民都鲁",
                "id": "BTU"
              },
              {
                "name": "木胶",
                "id": "MKM"
              },
              {
                "name": "木中",
                "id": "BTG"
              },
              {
                "name": "三马拉汉",
                "id": "SMH"
              },
              {
                "name": "斯里阿曼",
                "id": "SAM"
              },
              {
                "name": "泗里街",
                "id": "SAR"
              },
              {
                "name": "泗务",
                "id": "SBW"
              }
            ]
          },
          {
            "name": "雪兰莪",
            "id": "SL",
            "City": [
              {
                "name": "八打灵",
                "id": "PJA"
              },
              {
                "name": "鹅麦",
                "id": "GOM"
              },
              {
                "name": "瓜拉冷岳",
                "id": "KLG"
              },
              {
                "name": "瓜拉雪兰莪",
                "id": "KSL"
              },
              {
                "name": "沙白安南",
                "id": "SBM"
              },
              {
                "name": "乌鲁冷岳",
                "id": "HUL"
              },
              {
                "name": "乌鲁雪兰莪",
                "id": "HUS"
              },
              {
                "name": "雪邦",
                "id": "SEP"
              }
            ]
          }
        ]
      },
      {
        "name": "马里",
        "id": "MLI",
        "State": {
          "City": [
            {
              "name": "巴马科首都区",
              "id": "CD"
            },
            {
              "name": "基达尔",
              "id": "KD"
            },
            {
              "name": "加奥",
              "id": "GA"
            },
            {
              "name": "卡伊",
              "id": "KY"
            },
            {
              "name": "库利科罗",
              "id": "KL"
            },
            {
              "name": "莫普提",
              "id": "MP"
            },
            {
              "name": "塞古",
              "id": "SG"
            },
            {
              "name": "通布图",
              "id": "TB"
            },
            {
              "name": "锡卡索",
              "id": "SK"
            }
          ]
        }
      },
      {
        "name": "马其顿",
        "id": "MKD"
      },
      {
        "name": "马绍尔群岛",
        "id": "MHL"
      },
      {
        "name": "马提尼克",
        "id": "MTQ"
      },
      {
        "name": "马约特岛",
        "id": "MYT"
      },
      {
        "name": "曼岛",
        "id": "IMN"
      },
      {
        "name": "毛里求斯",
        "id": "MUS"
      },
      {
        "name": "毛里塔尼亚",
        "id": "MRT",
        "State": {
          "City": [
            {
              "name": "阿德拉尔",
              "id": "AD"
            },
            {
              "name": "阿萨巴",
              "id": "AS"
            },
            {
              "name": "卜拉克纳",
              "id": "BR"
            },
            {
              "name": "东胡德",
              "id": "HG"
            },
            {
              "name": "戈尔戈勒",
              "id": "GO"
            },
            {
              "name": "吉迪马卡",
              "id": "GM"
            },
            {
              "name": "努瓦迪布湾",
              "id": "DN"
            },
            {
              "name": "努瓦克肖特特区",
              "id": "NO"
            },
            {
              "name": "塔甘特",
              "id": "TA"
            },
            {
              "name": "特拉扎",
              "id": "TR"
            },
            {
              "name": "提里斯宰穆尔",
              "id": "TZ"
            },
            {
              "name": "西胡德",
              "id": "HC"
            },
            {
              "name": "因希里",
              "id": "IN"
            }
          ]
        }
      },
      {
        "name": "美国",
        "id": "USA",
        "State": [
          {
            "name": "阿肯色",
            "id": "AR",
            "City": [
              {
                "name": "费耶特维尔",
                "id": "FYV"
              },
              {
                "name": "史密斯堡",
                "id": "FSM"
              },
              {
                "name": "小石城",
                "id": "LIT"
              }
            ]
          },
          {
            "name": "阿拉巴马",
            "id": "AL",
            "City": [
              {
                "name": "伯明罕",
                "id": "BHM"
              },
              {
                "name": "蒙哥马利",
                "id": "MGM"
              },
              {
                "name": "莫比尔",
                "id": "MOB"
              }
            ]
          },
          {
            "name": "阿拉斯加",
            "id": "AK",
            "City": [
              {
                "name": "安克雷奇",
                "id": "ANC"
              },
              {
                "name": "费尔班克斯",
                "id": "FAI"
              },
              {
                "name": "朱诺",
                "id": "JNU"
              }
            ]
          },
          {
            "name": "爱达荷",
            "id": "ID",
            "City": [
              {
                "name": "爱达荷福尔斯",
                "id": "IDA"
              },
              {
                "name": "波卡特洛",
                "id": "PIH"
              },
              {
                "name": "博伊西",
                "id": "BOI"
              },
              {
                "name": "布莱克富特",
                "id": "BLK"
              },
              {
                "name": "科达伦",
                "id": "COE"
              },
              {
                "name": "刘易斯顿",
                "id": "LWS"
              },
              {
                "name": "莫斯科",
                "id": "MJL"
              },
              {
                "name": "墨菲",
                "id": "ZMU"
              },
              {
                "name": "楠帕",
                "id": "NPA"
              },
              {
                "name": "岂彻姆",
                "id": "QKM"
              },
              {
                "name": "森瓦利",
                "id": "SVY"
              },
              {
                "name": "亚美利加瀑布城",
                "id": "YAF"
              }
            ]
          },
          {
            "name": "爱荷华",
            "id": "IA",
            "City": [
              {
                "name": "达文波特",
                "id": "DVN"
              },
              {
                "name": "得梅因",
                "id": "DSM"
              },
              {
                "name": "锡达拉皮兹",
                "id": "CID"
              }
            ]
          },
          {
            "name": "北达科他",
            "id": "ND",
            "City": [
              {
                "name": "俾斯麦",
                "id": "BIS"
              },
              {
                "name": "大福克斯",
                "id": "GFK"
              },
              {
                "name": "法戈",
                "id": "FAR"
              },
              {
                "name": "迈诺特",
                "id": "MOT"
              }
            ]
          },
          {
            "name": "北卡罗来纳",
            "id": "NC",
            "City": [
              {
                "name": "艾许维尔",
                "id": "AEV"
              },
              {
                "name": "杜罕",
                "id": "DHH"
              },
              {
                "name": "格林斯伯勒",
                "id": "GBO"
              },
              {
                "name": "教堂山",
                "id": "CHE"
              },
              {
                "name": "罗利",
                "id": "RAG"
              },
              {
                "name": "洛利杜罕都会区",
                "id": "RDU"
              },
              {
                "name": "夏洛特",
                "id": "CRQ"
              }
            ]
          },
          {
            "name": "宾夕法尼亚",
            "id": "PA",
            "City": [
              {
                "name": "阿伦敦",
                "id": "AEW"
              },
              {
                "name": "费城",
                "id": "PHL"
              },
              {
                "name": "匹兹堡",
                "id": "PIT"
              }
            ]
          },
          {
            "name": "德克萨斯",
            "id": "TX",
            "City": [
              {
                "name": "埃尔帕索",
                "id": "ELP"
              },
              {
                "name": "奥斯汀",
                "id": "AUS"
              },
              {
                "name": "达拉斯",
                "id": "DAL"
              },
              {
                "name": "哥帕斯基斯蒂",
                "id": "CRP"
              },
              {
                "name": "交维斯顿",
                "id": "GLS"
              },
              {
                "name": "拉雷多",
                "id": "LRD"
              },
              {
                "name": "麦亚伦",
                "id": "TXC"
              },
              {
                "name": "圣安东尼奥",
                "id": "SAT"
              },
              {
                "name": "休斯敦",
                "id": "HOU"
              }
            ]
          },
          {
            "name": "俄亥俄",
            "id": "OH",
            "City": [
              {
                "name": "代顿",
                "id": "DYT"
              },
              {
                "name": "哥伦布",
                "id": "CZX"
              },
              {
                "name": "克利夫兰",
                "id": "CLE"
              },
              {
                "name": "托莱多",
                "id": "TOL"
              },
              {
                "name": "辛辛那提",
                "id": "CVG"
              }
            ]
          },
          {
            "name": "俄克拉荷马",
            "id": "OK",
            "City": [
              {
                "name": "俄克拉荷马城",
                "id": "OKC"
              },
              {
                "name": "诺曼",
                "id": "OUN"
              },
              {
                "name": "塔尔萨",
                "id": "TUL"
              }
            ]
          },
          {
            "name": "俄勒冈",
            "id": "OR",
            "City": [
              {
                "name": "本德",
                "id": "BZO"
              },
              {
                "name": "波特兰",
                "id": "PDX"
              },
              {
                "name": "达尔斯",
                "id": "DLS"
              },
              {
                "name": "达拉斯",
                "id": "DAC"
              },
              {
                "name": "蒂拉穆克",
                "id": "TLM"
              },
              {
                "name": "格兰茨帕斯",
                "id": "XFX"
              },
              {
                "name": "胡德里弗",
                "id": "HDX"
              },
              {
                "name": "火山口湖",
                "id": "CTR"
              },
              {
                "name": "科瓦利斯",
                "id": "YCV"
              },
              {
                "name": "库斯贝",
                "id": "COB"
              },
              {
                "name": "梅德福",
                "id": "MFR"
              },
              {
                "name": "塞勒姆",
                "id": "SLE"
              },
              {
                "name": "圣海伦斯",
                "id": "STH"
              },
              {
                "name": "斯普林菲尔德",
                "id": "SPY"
              },
              {
                "name": "尤金",
                "id": "EUG"
              }
            ]
          },
          {
            "name": "佛罗里达",
            "id": "FL",
            "City": [
              {
                "name": "奥兰多",
                "id": "ORL"
              },
              {
                "name": "基韦斯特",
                "id": "EYW"
              },
              {
                "name": "杰克逊维尔",
                "id": "JAX"
              },
              {
                "name": "卡纳维尔角",
                "id": "CPV"
              },
              {
                "name": "罗德岱堡",
                "id": "FLL"
              },
              {
                "name": "迈阿密",
                "id": "MIA"
              },
              {
                "name": "圣彼德斯堡市",
                "id": "PIE"
              },
              {
                "name": "塔拉哈西",
                "id": "TLH"
              },
              {
                "name": "坦帕",
                "id": "TPA"
              }
            ]
          },
          {
            "name": "佛蒙特",
            "id": "VT",
            "City": [
              {
                "name": "伯灵顿",
                "id": "BTV"
              },
              {
                "name": "拉特兰",
                "id": "RUT"
              },
              {
                "name": "南伯灵顿",
                "id": "ZBR"
              }
            ]
          },
          {
            "name": "哥伦比亚特区",
            "id": "DC",
            "City": {
              "name": "华盛顿哥伦比亚特区",
              "id": "WAS"
            }
          },
          {
            "name": "华盛顿",
            "id": "WA",
            "City": [
              {
                "name": "斯波坎",
                "id": "GEG"
              },
              {
                "name": "塔科马",
                "id": "TTW"
              },
              {
                "name": "西雅图",
                "id": "SEA"
              }
            ]
          },
          {
            "name": "怀俄明",
            "id": "WY",
            "City": [
              {
                "name": "埃文斯顿",
                "id": "EVD"
              },
              {
                "name": "卡斯珀",
                "id": "CPR"
              },
              {
                "name": "拉勒米",
                "id": "LAR"
              },
              {
                "name": "罗克斯普林斯",
                "id": "RKS"
              },
              {
                "name": "夏延",
                "id": "CYS"
              },
              {
                "name": "谢里登",
                "id": "SHR"
              }
            ]
          },
          {
            "name": "加利福尼亚",
            "id": "CA",
            "City": [
              {
                "name": "旧金山",
                "id": "SFO"
              },
              {
                "name": "洛杉矶",
                "id": "LAX"
              },
              {
                "name": "圣迭戈",
                "id": "SAN"
              },
              {
                "name": "圣何塞",
                "id": "SJC"
              }
            ]
          },
          {
            "name": "堪萨斯",
            "id": "KS",
            "City": [
              {
                "name": "阿比林",
                "id": "ABZ"
              },
              {
                "name": "奥弗兰公园",
                "id": "OVL"
              },
              {
                "name": "哈钦森",
                "id": "HCH"
              },
              {
                "name": "堪萨斯城",
                "id": "KCK"
              },
              {
                "name": "莱文沃思",
                "id": "XIA"
              },
              {
                "name": "劳伦斯",
                "id": "LWC"
              },
              {
                "name": "曼哈顿",
                "id": "MHK"
              },
              {
                "name": "托皮卡",
                "id": "TOP"
              },
              {
                "name": "威奇托",
                "id": "ICT"
              }
            ]
          },
          {
            "name": "康涅狄格",
            "id": "CT",
            "City": [
              {
                "name": "布里奇波特",
                "id": "BDR"
              },
              {
                "name": "达里恩",
                "id": "DAQ"
              },
              {
                "name": "格林尼治",
                "id": "GRH"
              },
              {
                "name": "哈特福德",
                "id": "HFD"
              },
              {
                "name": "米德尔顿",
                "id": "XIN"
              },
              {
                "name": "纽黑文",
                "id": "HVN"
              },
              {
                "name": "韦斯特波特",
                "id": "WPT"
              },
              {
                "name": "沃特伯里",
                "id": "WAT"
              },
              {
                "name": "新不列颠",
                "id": "NWT"
              }
            ]
          },
          {
            "name": "科罗拉多",
            "id": "CO",
            "City": [
              {
                "name": "阿斯彭",
                "id": "ASE"
              },
              {
                "name": "奥罗拉",
                "id": "AUX"
              },
              {
                "name": "博尔德",
                "id": "WBU"
              },
              {
                "name": "大章克申",
                "id": "GJT"
              },
              {
                "name": "丹佛",
                "id": "DEN"
              },
              {
                "name": "柯林斯堡",
                "id": "FNL"
              },
              {
                "name": "科罗拉多斯普林斯",
                "id": "COS"
              },
              {
                "name": "韦尔",
                "id": "VAC"
              }
            ]
          },
          {
            "name": "肯塔基",
            "id": "KY",
            "City": [
              {
                "name": "列克星敦",
                "id": "LEX"
              },
              {
                "name": "路易斯维尔",
                "id": "LUI"
              },
              {
                "name": "欧文斯伯勒",
                "id": "OWB"
              }
            ]
          },
          {
            "name": "路易斯安那",
            "id": "LA",
            "City": [
              {
                "name": "巴吞鲁日",
                "id": "BTR"
              },
              {
                "name": "什里夫波特",
                "id": "SHV"
              },
              {
                "name": "新奥尔良",
                "id": "MSY"
              }
            ]
          },
          {
            "name": "罗德岛",
            "id": "RI",
            "City": [
              {
                "name": "波塔基特",
                "id": "PAW"
              },
              {
                "name": "克兰斯顿",
                "id": "CQH"
              },
              {
                "name": "纽波特",
                "id": "NPO"
              },
              {
                "name": "普罗维登斯",
                "id": "PVD"
              },
              {
                "name": "韦斯特利",
                "id": "WST"
              },
              {
                "name": "文索基特",
                "id": "SFN"
              },
              {
                "name": "沃威克",
                "id": "UZO"
              }
            ]
          },
          {
            "name": "马里兰",
            "id": "MD",
            "City": [
              {
                "name": "巴尔的摩",
                "id": "BAL"
              },
              {
                "name": "盖瑟斯堡",
                "id": "GAI"
              },
              {
                "name": "罗克维尔",
                "id": "RKV"
              }
            ]
          },
          {
            "name": "马萨诸塞",
            "id": "MA",
            "City": [
              {
                "name": "波士顿",
                "id": "BZD"
              },
              {
                "name": "斯普林菲尔德",
                "id": "SFY"
              },
              {
                "name": "伍斯特",
                "id": "ORH"
              }
            ]
          },
          {
            "name": "蒙大拿",
            "id": "MT",
            "City": [
              {
                "name": "比灵斯",
                "id": "BGS"
              },
              {
                "name": "大瀑布村",
                "id": "GTF"
              },
              {
                "name": "米苏拉",
                "id": "MSO"
              }
            ]
          },
          {
            "name": "密苏里",
            "id": "MO",
            "City": [
              {
                "name": "哥伦比亚",
                "id": "COV"
              },
              {
                "name": "杰佛逊市",
                "id": "JEF"
              },
              {
                "name": "堪萨斯城",
                "id": "MKC"
              },
              {
                "name": "圣路易斯",
                "id": "STL"
              },
              {
                "name": "斯普林菲尔德",
                "id": "SGF"
              }
            ]
          },
          {
            "name": "密西西比",
            "id": "MS",
            "City": [
              {
                "name": "比洛克西",
                "id": "BIX"
              },
              {
                "name": "格尔夫波特",
                "id": "GPT"
              },
              {
                "name": "格林维尔",
                "id": "GLH"
              },
              {
                "name": "哈蒂斯堡",
                "id": "HBG"
              },
              {
                "name": "杰克逊",
                "id": "JAN"
              },
              {
                "name": "默里迪恩",
                "id": "MEI"
              },
              {
                "name": "维克斯堡",
                "id": "VKS"
              }
            ]
          },
          {
            "name": "密歇根",
            "id": "MI",
            "City": [
              {
                "name": "安娜堡",
                "id": "ARB"
              },
              {
                "name": "巴特尔克里克",
                "id": "BTL"
              },
              {
                "name": "贝城",
                "id": "BCY"
              },
              {
                "name": "大急流城",
                "id": "GRR"
              },
              {
                "name": "迪尔伯恩",
                "id": "DEO"
              },
              {
                "name": "底特律",
                "id": "DET"
              },
              {
                "name": "弗林特",
                "id": "FNT"
              },
              {
                "name": "怀恩多特",
                "id": "WYD"
              },
              {
                "name": "卡拉马袓",
                "id": "AZO"
              },
              {
                "name": "兰辛",
                "id": "LAN"
              },
              {
                "name": "马斯基根",
                "id": "MKG"
              },
              {
                "name": "庞菷亚克",
                "id": "PTK"
              },
              {
                "name": "萨吉诺",
                "id": "SGM"
              },
              {
                "name": "苏圣玛丽",
                "id": "SSM"
              },
              {
                "name": "沃伦",
                "id": "WAM"
              },
              {
                "name": "休伦港",
                "id": "PHN"
              }
            ]
          },
          {
            "name": "缅因",
            "id": "ME",
            "City": [
              {
                "name": "班戈",
                "id": "BNQ"
              },
              {
                "name": "波特兰",
                "id": "POL"
              },
              {
                "name": "刘易斯顿",
                "id": "QLW"
              }
            ]
          },
          {
            "name": "明尼苏达",
            "id": "MN",
            "City": [
              {
                "name": "罗切斯特",
                "id": "RST"
              },
              {
                "name": "明尼阿波利斯",
                "id": "MES"
              },
              {
                "name": "圣保罗",
                "id": "STP"
              }
            ]
          },
          {
            "name": "南达科他",
            "id": "SD",
            "City": [
              {
                "name": "阿伯丁",
                "id": "ABK"
              },
              {
                "name": "拉皮德城",
                "id": "RAP"
              },
              {
                "name": "苏福尔斯",
                "id": "FSD"
              }
            ]
          },
          {
            "name": "南卡罗来纳",
            "id": "SC",
            "City": [
              {
                "name": "北查尔斯顿",
                "id": "NTS"
              },
              {
                "name": "查尔斯顿",
                "id": "CHS"
              },
              {
                "name": "哥伦比亚",
                "id": "COV"
              }
            ]
          },
          {
            "name": "内布拉斯加",
            "id": "NE",
            "City": [
              {
                "name": "奥马哈",
                "id": "OMA"
              },
              {
                "name": "贝尔维尤",
                "id": "XDE"
              },
              {
                "name": "林肯",
                "id": "LNK"
              }
            ]
          },
          {
            "name": "内华达",
            "id": "NV",
            "City": [
              {
                "name": "埃尔科",
                "id": "EKO"
              },
              {
                "name": "北拉斯维加斯",
                "id": "NVS"
              },
              {
                "name": "弗吉尼亚城",
                "id": "VGI"
              },
              {
                "name": "亨德森",
                "id": "HNZ"
              },
              {
                "name": "卡森城",
                "id": "CSN"
              },
              {
                "name": "拉斯维加斯",
                "id": "LAS"
              },
              {
                "name": "里诺",
                "id": "RNO"
              },
              {
                "name": "斯帕克斯",
                "id": "SPK"
              }
            ]
          },
          {
            "name": "纽约",
            "id": "NY",
            "City": [
              {
                "name": "布法罗",
                "id": "FFO"
              },
              {
                "name": "罗切斯特",
                "id": "ROC"
              },
              {
                "name": "纽约市",
                "id": "QEE"
              }
            ]
          },
          {
            "name": "特拉华",
            "id": "DE",
            "City": [
              {
                "name": "多佛",
                "id": "DOR"
              },
              {
                "name": "纽瓦克",
                "id": "NWK"
              },
              {
                "name": "威明顿",
                "id": "ILG"
              }
            ]
          },
          {
            "name": "田纳西",
            "id": "TN",
            "City": [
              {
                "name": "布利斯托",
                "id": "BSJ"
              },
              {
                "name": "查塔努加",
                "id": "CHA"
              },
              {
                "name": "金斯波特",
                "id": "TRI"
              },
              {
                "name": "孟菲斯",
                "id": "MEM"
              },
              {
                "name": "纳什维尔",
                "id": "BNA"
              },
              {
                "name": "诺克斯维尔",
                "id": "TYS"
              },
              {
                "name": "三城区",
                "id": "YTC"
              },
              {
                "name": "士麦那",
                "id": "MQY"
              },
              {
                "name": "斯普林希尔",
                "id": "RGI"
              },
              {
                "name": "约翰逊城",
                "id": "JCY"
              }
            ]
          },
          {
            "name": "威斯康星",
            "id": "WI",
            "City": [
              {
                "name": "阿普尓顿",
                "id": "ATW"
              },
              {
                "name": "奥什科什",
                "id": "OSH"
              },
              {
                "name": "格林贝",
                "id": "GBK"
              },
              {
                "name": "基诺沙",
                "id": "ENW"
              },
              {
                "name": "拉克罗斯",
                "id": "LSE"
              },
              {
                "name": "拉辛",
                "id": "RAC"
              },
              {
                "name": "马尼托沃克",
                "id": "MTW"
              },
              {
                "name": "迈迪逊",
                "id": "QMD"
              },
              {
                "name": "密尔沃基",
                "id": "MKE"
              },
              {
                "name": "欧克莱尓",
                "id": "EAU"
              },
              {
                "name": "沃索",
                "id": "AUW"
              },
              {
                "name": "希博伊根",
                "id": "SBM"
              }
            ]
          },
          {
            "name": "维吉尼亚",
            "id": "VA",
            "City": [
              {
                "name": "弗吉尼亚比奇",
                "id": "VAB"
              },
              {
                "name": "诺福克",
                "id": "ORF"
              },
              {
                "name": "切萨皮克",
                "id": "HTW"
              }
            ]
          },
          {
            "name": "西佛吉尼亚",
            "id": "WV",
            "City": [
              {
                "name": "查尔斯顿",
                "id": "CRW"
              },
              {
                "name": "亨廷顿",
                "id": "HNU"
              },
              {
                "name": "帕克斯堡",
                "id": "PKB"
              }
            ]
          },
          {
            "name": "夏威夷",
            "id": "HI",
            "City": [
              {
                "name": "凯卢阿",
                "id": "KHH"
              },
              {
                "name": "檀香山",
                "id": "HNL"
              },
              {
                "name": "希洛",
                "id": "ITO"
              }
            ]
          },
          {
            "name": "新罕布什尔",
            "id": "NH",
            "City": [
              {
                "name": "康科德",
                "id": "CON"
              },
              {
                "name": "曼彻斯特",
                "id": "MHT"
              },
              {
                "name": "纳舒厄",
                "id": "ASH"
              }
            ]
          },
          {
            "name": "新墨西哥",
            "id": "NM",
            "City": [
              {
                "name": "阿尔伯克基",
                "id": "ABQ"
              },
              {
                "name": "拉斯克鲁塞斯",
                "id": "LRU"
              },
              {
                "name": "罗斯韦尔",
                "id": "ROW"
              },
              {
                "name": "圣菲",
                "id": "SAF"
              }
            ]
          },
          {
            "name": "新泽西",
            "id": "NJ",
            "City": [
              {
                "name": "纽瓦克",
                "id": "NRK"
              },
              {
                "name": "帕特森",
                "id": "PAT"
              },
              {
                "name": "泽西城",
                "id": "JEC"
              }
            ]
          },
          {
            "name": "亚利桑那",
            "id": "AZ",
            "City": [
              {
                "name": "凤凰城",
                "id": "PHX"
              },
              {
                "name": "格兰代尔",
                "id": "GDA"
              },
              {
                "name": "梅萨",
                "id": "MQA"
              },
              {
                "name": "史卡兹代尔",
                "id": "STZ"
              },
              {
                "name": "坦普",
                "id": "TPE"
              },
              {
                "name": "图森",
                "id": "TUC"
              },
              {
                "name": "优玛",
                "id": "YUM"
              }
            ]
          },
          {
            "name": "伊利诺斯",
            "id": "IL",
            "City": [
              {
                "name": "奥尔顿",
                "id": "ALN"
              },
              {
                "name": "奥罗拉",
                "id": "AUZ"
              },
              {
                "name": "布卢明顿",
                "id": "BLO"
              },
              {
                "name": "丹维尓",
                "id": "DVI"
              },
              {
                "name": "迪卡尔布",
                "id": "DEK"
              },
              {
                "name": "迪凯持",
                "id": "DEC"
              },
              {
                "name": "东圣路易斯",
                "id": "ESL"
              },
              {
                "name": "厄巴纳香槟",
                "id": "CMI"
              },
              {
                "name": "盖尔斯堡",
                "id": "GSU"
              },
              {
                "name": "卡本代尔",
                "id": "MDH"
              },
              {
                "name": "罗克艾兰",
                "id": "RKI"
              },
              {
                "name": "罗克福德",
                "id": "RFD"
              },
              {
                "name": "诺黙尔",
                "id": "NOM"
              },
              {
                "name": "皮奥里亚",
                "id": "PLA"
              },
              {
                "name": "森特勒利亚",
                "id": "CRA"
              },
              {
                "name": "斯普林菲尔德",
                "id": "SPI"
              },
              {
                "name": "沃其根",
                "id": "UGN"
              },
              {
                "name": "芝加哥",
                "id": "CHI"
              }
            ]
          },
          {
            "name": "印第安那",
            "id": "IN",
            "City": [
              {
                "name": "埃文斯维尔",
                "id": "EVV"
              },
              {
                "name": "韦恩堡",
                "id": "FWA"
              },
              {
                "name": "印第安纳波利斯",
                "id": "IND"
              }
            ]
          },
          {
            "name": "犹他",
            "id": "UT",
            "City": [
              {
                "name": "奥格登",
                "id": "OGD"
              },
              {
                "name": "雷登",
                "id": "LTJ"
              },
              {
                "name": "欧仁",
                "id": "OEU"
              },
              {
                "name": "帕克城",
                "id": "PAC"
              },
              {
                "name": "普罗沃",
                "id": "PVU"
              },
              {
                "name": "圣乔治",
                "id": "SGU"
              },
              {
                "name": "西瓦利城",
                "id": "WVC"
              },
              {
                "name": "盐湖城",
                "id": "SLC"
              }
            ]
          },
          {
            "name": "佐治亚",
            "id": "GA",
            "City": [
              {
                "name": "奥古斯塔",
                "id": "AUT"
              },
              {
                "name": "哥伦布",
                "id": "CZX"
              },
              {
                "name": "梅肯",
                "id": "MCN"
              },
              {
                "name": "沙瓦纳",
                "id": "SAV"
              },
              {
                "name": "亚特兰大",
                "id": "TAT"
              }
            ]
          }
        ]
      },
      {
        "name": "美属萨摩亚",
        "id": "ASM",
        "State": {
          "City": [
            {
              "name": "阿纳",
              "id": "AAN"
            },
            {
              "name": "阿图阿",
              "id": "ATU"
            },
            {
              "name": "艾加伊勒泰",
              "id": "AIT"
            },
            {
              "name": "法塞莱莱阿加",
              "id": "FAA"
            },
            {
              "name": "加盖福毛加",
              "id": "GFG"
            },
            {
              "name": "加加埃毛加",
              "id": "GMG"
            },
            {
              "name": "帕劳利",
              "id": "PAL"
            },
            {
              "name": "萨图帕伊泰阿",
              "id": "SAT"
            },
            {
              "name": "萨瓦伊岛",
              "id": "SAV"
            },
            {
              "name": "图阿马萨加",
              "id": "TUA"
            },
            {
              "name": "瓦奥福诺蒂",
              "id": "VAF"
            },
            {
              "name": "韦西加诺",
              "id": "VAI"
            },
            {
              "name": "乌波卢岛",
              "id": "UPO"
            }
          ]
        }
      },
      {
        "name": "美属外岛",
        "id": "UMI"
      },
      {
        "name": "蒙古",
        "id": "MNG",
        "State": {
          "City": [
            {
              "name": "巴彦洪格尔",
              "id": "69"
            },
            {
              "name": "巴彦乌勒盖",
              "id": "71"
            },
            {
              "name": "布尔干",
              "id": "67"
            },
            {
              "name": "达尔汗乌勒",
              "id": "37"
            },
            {
              "name": "东方",
              "id": "61"
            },
            {
              "name": "东戈壁",
              "id": "63"
            },
            {
              "name": "鄂尔浑",
              "id": "35"
            },
            {
              "name": "戈壁阿尔泰",
              "id": "65"
            },
            {
              "name": "戈壁苏木贝尔",
              "id": "64"
            },
            {
              "name": "后杭爱",
              "id": "73"
            },
            {
              "name": "科布多",
              "id": "43"
            },
            {
              "name": "肯特",
              "id": "39"
            },
            {
              "name": "库苏古尔",
              "id": "41"
            },
            {
              "name": "南戈壁",
              "id": "UMN"
            },
            {
              "name": "前杭爱",
              "id": "UVO"
            },
            {
              "name": "色楞格",
              "id": "49"
            },
            {
              "name": "苏赫巴托尔",
              "id": "51"
            },
            {
              "name": "乌布苏",
              "id": "46"
            },
            {
              "name": "乌兰巴托市",
              "id": "1"
            },
            {
              "name": "扎布汗",
              "id": "57"
            },
            {
              "name": "中戈壁",
              "id": "59"
            },
            {
              "name": "中央",
              "id": "47"
            }
          ]
        }
      },
      {
        "name": "蒙特塞拉特",
        "id": "MSR"
      },
      {
        "name": "孟加拉",
        "id": "BGD",
        "State": {
          "City": [
            {
              "name": "达卡",
              "id": "DAC"
            },
            {
              "name": "吉大港",
              "id": "CGP"
            },
            {
              "name": "库尔纳",
              "id": "KHL"
            }
          ]
        }
      },
      {
        "name": "密克罗尼西亚",
        "id": "FSM"
      },
      {
        "name": "秘鲁",
        "id": "PER",
        "State": {
          "City": [
            {
              "name": "阿雷基帕",
              "id": "AR"
            },
            {
              "name": "阿普里马克",
              "id": "AP"
            },
            {
              "name": "阿亚库乔",
              "id": "AY"
            },
            {
              "name": "安卡什",
              "id": "AN"
            },
            {
              "name": "胡利亚卡",
              "id": "JUL"
            },
            {
              "name": "胡宁",
              "id": "JU"
            },
            {
              "name": "卡哈马卡",
              "id": "CJ"
            },
            {
              "name": "卡亚俄",
              "id": "CL"
            },
            {
              "name": "库斯科",
              "id": "CU"
            },
            {
              "name": "拉利伯塔德",
              "id": "LD"
            },
            {
              "name": "兰巴耶克",
              "id": "LY"
            },
            {
              "name": "利马",
              "id": "LI"
            },
            {
              "name": "洛雷托",
              "id": "LO"
            },
            {
              "name": "马德雷德迪奥斯",
              "id": "MD"
            },
            {
              "name": "莫克瓜",
              "id": "MO"
            },
            {
              "name": "帕斯科",
              "id": "PA"
            },
            {
              "name": "皮乌拉",
              "id": "PI"
            },
            {
              "name": "普诺",
              "id": "PU"
            },
            {
              "name": "钦博特",
              "id": "CHM"
            },
            {
              "name": "钦查阿尔塔",
              "id": "CHI"
            },
            {
              "name": "圣马丁",
              "id": "SM"
            },
            {
              "name": "苏拉纳",
              "id": "SUL"
            },
            {
              "name": "塔克纳",
              "id": "TA"
            },
            {
              "name": "通贝斯",
              "id": "TU"
            },
            {
              "name": "瓦努科",
              "id": "HO"
            },
            {
              "name": "万卡维利卡",
              "id": "HV"
            },
            {
              "name": "乌卡亚利",
              "id": "UC"
            },
            {
              "name": "亚马孙",
              "id": "AM"
            },
            {
              "name": "伊卡",
              "id": "IC"
            }
          ]
        }
      },
      {
        "name": "缅甸",
        "id": "MMR",
        "State": {
          "City": [
            {
              "name": "勃固省",
              "id": "BG"
            },
            {
              "name": "掸邦",
              "id": "SH"
            },
            {
              "name": "德林达依省",
              "id": "TN"
            },
            {
              "name": "克伦邦",
              "id": "KN"
            },
            {
              "name": "克钦邦",
              "id": "KC"
            },
            {
              "name": "克耶邦",
              "id": "KH"
            },
            {
              "name": "马圭省",
              "id": "MG"
            },
            {
              "name": "曼德勒省",
              "id": "MD"
            },
            {
              "name": "孟邦",
              "id": "MN"
            },
            {
              "name": "钦邦",
              "id": "CH"
            },
            {
              "name": "若开邦",
              "id": "RK"
            },
            {
              "name": "实皆省",
              "id": "SG"
            },
            {
              "name": "仰光省",
              "id": "YG"
            },
            {
              "name": "伊洛瓦底省",
              "id": "AY"
            }
          ]
        }
      },
      {
        "name": "摩尔多瓦",
        "id": "MDA"
      },
      {
        "name": "摩洛哥",
        "id": "MAR",
        "State": {
          "City": [
            {
              "name": "丹吉尔",
              "id": "TGR"
            },
            {
              "name": "得土安",
              "id": "TET"
            },
            {
              "name": "非斯",
              "id": "FES"
            },
            {
              "name": "卡萨布兰卡",
              "id": "CBL"
            },
            {
              "name": "拉巴特",
              "id": "RSA"
            },
            {
              "name": "马拉喀什",
              "id": "MRK"
            },
            {
              "name": "梅克内斯",
              "id": "MKN"
            },
            {
              "name": "乌季达",
              "id": "OUJ"
            },
            {
              "name": "西撒哈拉",
              "id": "WSH"
            }
          ]
        }
      },
      {
        "name": "摩纳哥",
        "id": "MCO"
      },
      {
        "name": "莫桑比克",
        "id": "MOZ"
      },
      {
        "name": "墨西哥",
        "id": "MEX",
        "State": {
          "City": [
            {
              "name": "阿瓜斯卡连斯特",
              "id": "AGU"
            },
            {
              "name": "阿卡普尔科",
              "id": "ACA"
            },
            {
              "name": "埃莫西约",
              "id": "HMO"
            },
            {
              "name": "埃佩切",
              "id": "CAM"
            },
            {
              "name": "奥夫雷贡城",
              "id": "OBR"
            },
            {
              "name": "奥里萨巴",
              "id": "ORI"
            },
            {
              "name": "巴利城",
              "id": "VHM"
            },
            {
              "name": "巴亚尔塔港",
              "id": "PVR"
            },
            {
              "name": "比利亚埃尔莫萨",
              "id": "VSA"
            },
            {
              "name": "波萨里卡",
              "id": "PRH"
            },
            {
              "name": "蒂华纳",
              "id": "TIJ"
            },
            {
              "name": "杜兰戈",
              "id": "DUR"
            },
            {
              "name": "恩塞纳达",
              "id": "ESE"
            },
            {
              "name": "瓜达拉哈拉",
              "id": "GDL"
            },
            {
              "name": "瓜纳华托",
              "id": "GUA"
            },
            {
              "name": "哈拉帕",
              "id": "JAL"
            },
            {
              "name": "华雷斯",
              "id": "JUZ"
            },
            {
              "name": "华雷斯港",
              "id": "BJU"
            },
            {
              "name": "卡门",
              "id": "CAR"
            },
            {
              "name": "科利马",
              "id": "COL"
            },
            {
              "name": "克雷塔罗",
              "id": "QUE"
            },
            {
              "name": "库埃纳瓦卡",
              "id": "CVC"
            },
            {
              "name": "库利阿坎",
              "id": "CUL"
            },
            {
              "name": "夸察夸拉克斯",
              "id": "COA"
            },
            {
              "name": "拉巴斯",
              "id": "LAP"
            },
            {
              "name": "莱昂",
              "id": "LEN"
            },
            {
              "name": "雷诺萨",
              "id": "REX"
            },
            {
              "name": "洛斯莫奇斯",
              "id": "LMM"
            },
            {
              "name": "马萨特兰",
              "id": "MZT"
            },
            {
              "name": "马塔莫罗斯",
              "id": "MAM"
            },
            {
              "name": "梅里达",
              "id": "MID"
            },
            {
              "name": "蒙克洛瓦",
              "id": "LOV"
            },
            {
              "name": "蒙特雷",
              "id": "MTY"
            },
            {
              "name": "莫雷利亚",
              "id": "MLM"
            },
            {
              "name": "墨西哥城",
              "id": "MEX"
            },
            {
              "name": "墨西卡利",
              "id": "MXL"
            },
            {
              "name": "诺加莱斯",
              "id": "NOG"
            },
            {
              "name": "帕丘卡",
              "id": "PAC"
            },
            {
              "name": "普埃布拉",
              "id": "PUE"
            },
            {
              "name": "奇尔潘辛戈",
              "id": "CHI"
            },
            {
              "name": "奇瓦瓦",
              "id": "CHH"
            },
            {
              "name": "切图马尔",
              "id": "CTM"
            },
            {
              "name": "萨尔蒂约",
              "id": "SLW"
            },
            {
              "name": "萨卡特卡斯",
              "id": "ZAC"
            },
            {
              "name": "塞拉亚",
              "id": "CLY"
            },
            {
              "name": "圣路易斯波托亚",
              "id": "SLP"
            },
            {
              "name": "塔帕丘拉",
              "id": "TAP"
            },
            {
              "name": "坦皮科",
              "id": "TAM"
            },
            {
              "name": "特拉斯卡拉",
              "id": "TLA"
            },
            {
              "name": "特皮克",
              "id": "TPQ"
            },
            {
              "name": "特瓦坎",
              "id": "TCN"
            },
            {
              "name": "图斯特拉古铁雷斯",
              "id": "TGZ"
            },
            {
              "name": "托雷翁",
              "id": "TRC"
            },
            {
              "name": "托卢卡",
              "id": "TLC"
            },
            {
              "name": "瓦哈卡",
              "id": "OAX"
            },
            {
              "name": "维多利亚城",
              "id": "VIC"
            },
            {
              "name": "韦拉克鲁斯",
              "id": "VER"
            },
            {
              "name": "乌鲁阿潘",
              "id": "UPN"
            },
            {
              "name": "新拉雷多",
              "id": "NLE"
            },
            {
              "name": "伊拉普阿托",
              "id": "IRP"
            }
          ]
        }
      },
      {
        "name": "纳米比亚",
        "id": "NAM",
        "State": {
          "City": [
            {
              "name": "埃龙戈",
              "id": "ER"
            },
            {
              "name": "奥汉圭纳",
              "id": "OW"
            },
            {
              "name": "奥卡万戈",
              "id": "KV"
            },
            {
              "name": "奥马赫科",
              "id": "OK"
            },
            {
              "name": "奥姆沙蒂",
              "id": "OT"
            },
            {
              "name": "奥乔宗蒂约巴",
              "id": "OJ"
            },
            {
              "name": "奥沙纳",
              "id": "ON"
            },
            {
              "name": "奥希科托",
              "id": "OO"
            },
            {
              "name": "哈达普",
              "id": "HA"
            },
            {
              "name": "霍马斯",
              "id": "KH"
            },
            {
              "name": "卡拉斯",
              "id": "KR"
            },
            {
              "name": "卡普里维",
              "id": "CA"
            },
            {
              "name": "库内内",
              "id": "KU"
            }
          ]
        }
      },
      {
        "name": "南非",
        "id": "ZAF",
        "State": {
          "City": [
            {
              "name": "阿平顿",
              "id": "UTN"
            },
            {
              "name": "艾利弗山",
              "id": "MAY"
            },
            {
              "name": "彼德马里茨堡",
              "id": "PZB"
            },
            {
              "name": "彼德斯堡",
              "id": "PTG"
            },
            {
              "name": "比勒陀利亚",
              "id": "PRY"
            },
            {
              "name": "比索",
              "id": "BIY"
            },
            {
              "name": "布雷达斯多普",
              "id": "BDD"
            },
            {
              "name": "布隆方丹",
              "id": "BFN"
            },
            {
              "name": "布隆克斯特斯普利特",
              "id": "BHT"
            },
            {
              "name": "德阿尔",
              "id": "DAA"
            },
            {
              "name": "德班",
              "id": "DUR"
            },
            {
              "name": "邓迪",
              "id": "DUN"
            },
            {
              "name": "东巴克利",
              "id": "BAE"
            },
            {
              "name": "东伦敦",
              "id": "ELS"
            },
            {
              "name": "弗雷堡",
              "id": "VRU"
            },
            {
              "name": "弗里尼欣",
              "id": "VGG"
            },
            {
              "name": "格罗布莱斯达尔",
              "id": "GBD"
            },
            {
              "name": "基雅尼",
              "id": "GIY"
            },
            {
              "name": "金伯利",
              "id": "KIM"
            },
            {
              "name": "开普敦",
              "id": "CPT"
            },
            {
              "name": "克莱克斯多普",
              "id": "KXE"
            },
            {
              "name": "库鲁曼",
              "id": "KMH"
            },
            {
              "name": "昆士敦",
              "id": "UTW"
            },
            {
              "name": "莱迪史密斯",
              "id": "LAY"
            },
            {
              "name": "兰德方丹",
              "id": "RFT"
            },
            {
              "name": "理查兹湾",
              "id": "RCB"
            },
            {
              "name": "利斯滕堡",
              "id": "RSB"
            },
            {
              "name": "米德尔堡",
              "id": "MDB"
            },
            {
              "name": "姆库泽",
              "id": "MZQ"
            },
            {
              "name": "穆里斯堡",
              "id": "MOO"
            },
            {
              "name": "内尔斯普雷特",
              "id": "NLP"
            },
            {
              "name": "尼尔斯特隆",
              "id": "NYL"
            },
            {
              "name": "纽卡斯尔",
              "id": "NCS"
            },
            {
              "name": "乔治",
              "id": "GRJ"
            },
            {
              "name": "萨索尔堡",
              "id": "SAS"
            },
            {
              "name": "瑟孔达",
              "id": "ZEC"
            },
            {
              "name": "特克索波",
              "id": "IXO"
            },
            {
              "name": "特隆普斯堡",
              "id": "TPB"
            },
            {
              "name": "跳羚",
              "id": "SBU"
            },
            {
              "name": "图拉马哈谢",
              "id": "TLH"
            },
            {
              "name": "托霍延杜",
              "id": "THY"
            },
            {
              "name": "韦茨肖克",
              "id": "WSH"
            },
            {
              "name": "韦尔科姆",
              "id": "WEL"
            },
            {
              "name": "乌伦迪",
              "id": "ULD"
            },
            {
              "name": "乌姆塔塔",
              "id": "UTT"
            },
            {
              "name": "伍斯特",
              "id": "WOR"
            },
            {
              "name": "西博福特",
              "id": "BEW"
            },
            {
              "name": "谢普斯通港",
              "id": "PSS"
            },
            {
              "name": "伊丽莎白港",
              "id": "PLZ"
            },
            {
              "name": "约翰内斯堡",
              "id": "JNB"
            }
          ]
        }
      },
      {
        "name": "南极洲",
        "id": "ATA"
      },
      {
        "name": "南乔治亚和南桑德威奇群岛",
        "id": "SGS"
      },
      {
        "name": "瑙鲁",
        "id": "NRU"
      },
      {
        "name": "尼泊尔",
        "id": "NPL",
        "State": {
          "City": [
            {
              "name": "巴格马蒂",
              "id": "BA"
            },
            {
              "name": "道拉吉里",
              "id": "DH"
            },
            {
              "name": "甘达基",
              "id": "GA"
            },
            {
              "name": "戈西",
              "id": "KO"
            },
            {
              "name": "格尔纳利",
              "id": "KA"
            },
            {
              "name": "贾纳克布尔",
              "id": "JA"
            },
            {
              "name": "拉布蒂",
              "id": "RA"
            },
            {
              "name": "蓝毗尼",
              "id": "LU"
            },
            {
              "name": "马哈卡利",
              "id": "MA"
            },
            {
              "name": "梅吉",
              "id": "ME"
            },
            {
              "name": "纳拉亚尼",
              "id": "NA"
            },
            {
              "name": "佩里",
              "id": "BH"
            },
            {
              "name": "萨加玛塔",
              "id": "SA"
            },
            {
              "name": "塞蒂",
              "id": "SE"
            }
          ]
        }
      },
      {
        "name": "尼加拉瓜",
        "id": "NIC",
        "State": {
          "City": [
            {
              "name": "埃斯特利",
              "id": "ES"
            },
            {
              "name": "北大西洋",
              "id": "AN"
            },
            {
              "name": "博阿科",
              "id": "BO"
            },
            {
              "name": "格拉纳达",
              "id": "GR"
            },
            {
              "name": "卡拉索",
              "id": "CA"
            },
            {
              "name": "莱昂",
              "id": "LE"
            },
            {
              "name": "里瓦斯",
              "id": "RV"
            },
            {
              "name": "马德里斯",
              "id": "MD"
            },
            {
              "name": "马那瓜",
              "id": "MN"
            },
            {
              "name": "马萨亚",
              "id": "MS"
            },
            {
              "name": "马塔加尔帕",
              "id": "MT"
            },
            {
              "name": "南大西洋",
              "id": "AS"
            },
            {
              "name": "奇南德加",
              "id": "CD"
            },
            {
              "name": "琼塔莱斯",
              "id": "CT"
            },
            {
              "name": "圣胡安河",
              "id": "SJ"
            },
            {
              "name": "希诺特加",
              "id": "JI"
            },
            {
              "name": "新塞哥维亚",
              "id": "NS"
            }
          ]
        }
      },
      {
        "name": "尼日尔",
        "id": "NER",
        "State": {
          "City": [
            {
              "name": "阿加德兹",
              "id": "AJY"
            },
            {
              "name": "迪法",
              "id": "DIF"
            },
            {
              "name": "蒂拉贝里",
              "id": "TIL"
            },
            {
              "name": "多索",
              "id": "DSS"
            },
            {
              "name": "津德尔",
              "id": "ZND"
            },
            {
              "name": "马拉迪",
              "id": "MFQ"
            },
            {
              "name": "尼亚美市",
              "id": "NIM"
            },
            {
              "name": "塔瓦",
              "id": "THZ"
            }
          ]
        }
      },
      {
        "name": "尼日利亚",
        "id": "NGA",
        "State": {
          "City": [
            {
              "name": "阿比亚",
              "id": "ABV"
            },
            {
              "name": "奥博莫绍",
              "id": "OGB"
            },
            {
              "name": "卡诺",
              "id": "KAN"
            },
            {
              "name": "拉各斯",
              "id": "LOS"
            },
            {
              "name": "伊巴丹",
              "id": "IBA"
            }
          ]
        }
      },
      {
        "name": "纽埃",
        "id": "NIU"
      },
      {
        "name": "挪威",
        "id": "NOR",
        "State": {
          "City": [
            {
              "name": "阿克什胡斯",
              "id": "2"
            },
            {
              "name": "奥普兰",
              "id": "5"
            },
            {
              "name": "奥斯陆市",
              "id": "3"
            },
            {
              "name": "北特伦德拉格",
              "id": "17"
            },
            {
              "name": "布斯克吕",
              "id": "6"
            },
            {
              "name": "东阿格德尔",
              "id": "9"
            },
            {
              "name": "东福尔",
              "id": "1"
            },
            {
              "name": "芬马克",
              "id": "20"
            },
            {
              "name": "海德马克",
              "id": "4"
            },
            {
              "name": "霍达兰",
              "id": "12"
            },
            {
              "name": "罗加兰",
              "id": "11"
            },
            {
              "name": "默勒－鲁姆斯达尔",
              "id": "15"
            },
            {
              "name": "南特伦德拉格",
              "id": "16"
            },
            {
              "name": "诺尔兰",
              "id": "18"
            },
            {
              "name": "松恩－菲尤拉讷",
              "id": "14"
            },
            {
              "name": "泰勒马克",
              "id": "8"
            },
            {
              "name": "特罗姆斯",
              "id": "19"
            },
            {
              "name": "西阿格德尔",
              "id": "10"
            },
            {
              "name": "西福尔",
              "id": "7"
            }
          ]
        }
      },
      {
        "name": "诺福克",
        "id": "NFK"
      },
      {
        "name": "帕劳群岛",
        "id": "PLW"
      },
      {
        "name": "皮特凯恩",
        "id": "PCN"
      },
      {
        "name": "葡萄牙",
        "id": "PRT",
        "State": {
          "City": [
            {
              "name": "滨海阿连特茹",
              "id": "ALL"
            },
            {
              "name": "滨海皮尼亚尔",
              "id": "PLT"
            },
            {
              "name": "波尔图",
              "id": "VDP"
            },
            {
              "name": "杜罗",
              "id": "MDR"
            },
            {
              "name": "恩特拉杜罗伏日",
              "id": "EDV"
            },
            {
              "name": "法鲁",
              "id": "FAO"
            },
            {
              "name": "丰沙尔",
              "id": "FUN"
            },
            {
              "name": "卡瓦多",
              "id": "CAV"
            },
            {
              "name": "科瓦贝拉",
              "id": "CLB"
            },
            {
              "name": "里斯本",
              "id": "LIS"
            },
            {
              "name": "利巴特茹",
              "id": "LTE"
            },
            {
              "name": "梅地奥特茹",
              "id": "MTE"
            },
            {
              "name": "米尼奥利马",
              "id": "MLI"
            },
            {
              "name": "内贝拉北",
              "id": "BIN"
            },
            {
              "name": "内贝拉南",
              "id": "BIS"
            },
            {
              "name": "内皮尼亚尔北",
              "id": "PIN"
            },
            {
              "name": "内皮尼亚尔南",
              "id": "PIS"
            },
            {
              "name": "蓬塔德尔加达",
              "id": "PDL"
            },
            {
              "name": "塞图巴尔半岛",
              "id": "PSE"
            },
            {
              "name": "山后",
              "id": "SES"
            },
            {
              "name": "上阿连特茹",
              "id": "AAT"
            },
            {
              "name": "上特拉斯山",
              "id": "ATM"
            },
            {
              "name": "塔梅加",
              "id": "TAM"
            },
            {
              "name": "万福",
              "id": "AES"
            },
            {
              "name": "西部",
              "id": "OES"
            },
            {
              "name": "下阿连特茹",
              "id": "BAL"
            },
            {
              "name": "下伏日",
              "id": "BVO"
            },
            {
              "name": "下蒙德古",
              "id": "BMO"
            },
            {
              "name": "中阿连特茹",
              "id": "ALC"
            }
          ]
        }
      },
      {
        "name": "乔治亚",
        "id": "GEO"
      },
      {
        "name": "日本",
        "id": "JPN",
        "State": {
          "City": [
            {
              "name": "爱媛",
              "id": "38"
            },
            {
              "name": "爱知",
              "id": "23"
            },
            {
              "name": "北海道",
              "id": "1"
            },
            {
              "name": "兵库",
              "id": "28"
            },
            {
              "name": "冲绳",
              "id": "47"
            },
            {
              "name": "茨城",
              "id": "8"
            },
            {
              "name": "大阪",
              "id": "27"
            },
            {
              "name": "大分",
              "id": "44"
            },
            {
              "name": "岛根",
              "id": "32"
            },
            {
              "name": "徳岛",
              "id": "36"
            },
            {
              "name": "东京",
              "id": "13"
            },
            {
              "name": "福岛",
              "id": "7"
            },
            {
              "name": "福冈",
              "id": "40"
            },
            {
              "name": "福井",
              "id": "18"
            },
            {
              "name": "富山",
              "id": "16"
            },
            {
              "name": "冈山",
              "id": "33"
            },
            {
              "name": "高知",
              "id": "39"
            },
            {
              "name": "宮城",
              "id": "4"
            },
            {
              "name": "宫崎",
              "id": "45"
            },
            {
              "name": "广岛",
              "id": "34"
            },
            {
              "name": "和歌山",
              "id": "30"
            },
            {
              "name": "京都",
              "id": "26"
            },
            {
              "name": "静冈",
              "id": "22"
            },
            {
              "name": "枥木",
              "id": "9"
            },
            {
              "name": "鹿儿岛",
              "id": "46"
            },
            {
              "name": "奈良",
              "id": "29"
            },
            {
              "name": "鸟取",
              "id": "31"
            },
            {
              "name": "岐阜",
              "id": "21"
            },
            {
              "name": "埼玉",
              "id": "11"
            },
            {
              "name": "千叶",
              "id": "12"
            },
            {
              "name": "青森",
              "id": "2"
            },
            {
              "name": "秋田",
              "id": "5"
            },
            {
              "name": "群马",
              "id": "10"
            },
            {
              "name": "三重",
              "id": "24"
            },
            {
              "name": "山口",
              "id": "35"
            },
            {
              "name": "山梨",
              "id": "19"
            },
            {
              "name": "山形",
              "id": "6"
            },
            {
              "name": "神奈川",
              "id": "14"
            },
            {
              "name": "石川",
              "id": "17"
            },
            {
              "name": "香川",
              "id": "37"
            },
            {
              "name": "新潟",
              "id": "15"
            },
            {
              "name": "熊本",
              "id": "43"
            },
            {
              "name": "岩手",
              "id": "3"
            },
            {
              "name": "长崎",
              "id": "42"
            },
            {
              "name": "长野",
              "id": "20"
            },
            {
              "name": "滋贺",
              "id": "25"
            },
            {
              "name": "佐贺",
              "id": "41"
            }
          ]
        }
      },
      {
        "name": "瑞典",
        "id": "SWE",
        "State": {
          "City": [
            {
              "name": "北博滕",
              "id": "BD"
            },
            {
              "name": "布莱金厄",
              "id": "K"
            },
            {
              "name": "达拉纳",
              "id": "DLN"
            },
            {
              "name": "东约特兰",
              "id": "UGL"
            },
            {
              "name": "厄勒布鲁",
              "id": "T"
            },
            {
              "name": "哥得兰",
              "id": "I"
            },
            {
              "name": "哈兰",
              "id": "N"
            },
            {
              "name": "卡尔马",
              "id": "H"
            },
            {
              "name": "克鲁努贝里",
              "id": "G"
            },
            {
              "name": "南曼兰",
              "id": "D"
            },
            {
              "name": "斯德哥尔摩",
              "id": "AB"
            },
            {
              "name": "斯科耐",
              "id": "M"
            },
            {
              "name": "韦姆兰",
              "id": "S"
            },
            {
              "name": "乌普萨拉",
              "id": "C"
            },
            {
              "name": "西博滕",
              "id": "AC"
            },
            {
              "name": "西曼兰",
              "id": "U"
            },
            {
              "name": "西诺尔兰",
              "id": "Y"
            },
            {
              "name": "西约特兰",
              "id": "O"
            },
            {
              "name": "延雪平",
              "id": "F"
            },
            {
              "name": "耶夫勒堡",
              "id": "X"
            },
            {
              "name": "耶姆特兰",
              "id": "Z"
            }
          ]
        }
      },
      {
        "name": "瑞士",
        "id": "CHE",
        "State": {
          "City": [
            {
              "name": "阿尔高",
              "id": "AG"
            },
            {
              "name": "巴塞尔城市",
              "id": "BS"
            },
            {
              "name": "巴塞尔乡村",
              "id": "BL"
            },
            {
              "name": "伯尔尼",
              "id": "BE"
            },
            {
              "name": "楚格",
              "id": "ZG"
            },
            {
              "name": "弗里堡",
              "id": "FR"
            },
            {
              "name": "格拉鲁斯",
              "id": "GL"
            },
            {
              "name": "格劳宾登",
              "id": "GR"
            },
            {
              "name": "卢塞恩",
              "id": "LU"
            },
            {
              "name": "洛桑",
              "id": "LA"
            },
            {
              "name": "纳沙泰尔",
              "id": "NE"
            },
            {
              "name": "内阿彭策尔",
              "id": "AI"
            },
            {
              "name": "日内瓦",
              "id": "GE"
            },
            {
              "name": "汝拉",
              "id": "JU"
            },
            {
              "name": "沙夫豪森",
              "id": "SH"
            },
            {
              "name": "上瓦尔登",
              "id": "OW"
            },
            {
              "name": "圣加仑",
              "id": "SG"
            },
            {
              "name": "施维茨",
              "id": "SZ"
            },
            {
              "name": "苏黎世",
              "id": "ZH"
            },
            {
              "name": "索洛图恩",
              "id": "SO"
            },
            {
              "name": "提契诺",
              "id": "TI"
            },
            {
              "name": "图尔高",
              "id": "TG"
            },
            {
              "name": "瓦莱",
              "id": "VS"
            },
            {
              "name": "外阿彭策尔",
              "id": "AR"
            },
            {
              "name": "沃",
              "id": "VD"
            },
            {
              "name": "乌里",
              "id": "UR"
            },
            {
              "name": "下瓦尔登",
              "id": "NW"
            }
          ]
        }
      },
      {
        "name": "萨尔瓦多",
        "id": "SLV",
        "State": {
          "City": [
            {
              "name": "阿波帕",
              "id": "APO"
            },
            {
              "name": "阿瓦查潘",
              "id": "AH"
            },
            {
              "name": "滨海",
              "id": "LI"
            },
            {
              "name": "查拉特南戈",
              "id": "CH"
            },
            {
              "name": "德尔加多",
              "id": "DE"
            },
            {
              "name": "基埃恩特姆",
              "id": "KN"
            },
            {
              "name": "卡瓦尼亚斯",
              "id": "CA"
            },
            {
              "name": "库斯卡特兰",
              "id": "CU"
            },
            {
              "name": "拉巴斯",
              "id": "PZ"
            },
            {
              "name": "拉利伯塔德",
              "id": "LB"
            },
            {
              "name": "拉乌尼翁",
              "id": "UN"
            },
            {
              "name": "梅基卡诺斯",
              "id": "MEJ"
            },
            {
              "name": "莫拉桑",
              "id": "MO"
            },
            {
              "name": "圣安娜",
              "id": "SA"
            },
            {
              "name": "圣米格尔",
              "id": "SM"
            },
            {
              "name": "圣萨尔瓦多",
              "id": "SS"
            },
            {
              "name": "圣维森特",
              "id": "SV"
            },
            {
              "name": "松索纳特",
              "id": "SO"
            },
            {
              "name": "索亚潘戈",
              "id": "SOY"
            },
            {
              "name": "韦莱恩萨斯",
              "id": "WN"
            },
            {
              "name": "乌苏卢坦",
              "id": "US"
            },
            {
              "name": "伊洛潘戈",
              "id": "IL"
            },
            {
              "name": "中南",
              "id": "CS"
            }
          ]
        }
      },
      {
        "name": "萨摩亚",
        "id": "WSM"
      },
      {
        "name": "塞尔维亚,黑山",
        "id": "SCG",
        "State": {
          "City": [
            {
              "name": "贝尔格莱德",
              "id": "BEG"
            },
            {
              "name": "波德戈里察",
              "id": "POD"
            },
            {
              "name": "克拉古涅瓦茨",
              "id": "KGV"
            },
            {
              "name": "尼什",
              "id": "INI"
            },
            {
              "name": "诺维萨德",
              "id": "NVS"
            },
            {
              "name": "普里什蒂纳",
              "id": "PRN"
            },
            {
              "name": "苏博蒂察",
              "id": "SUB"
            },
            {
              "name": "泽蒙",
              "id": "ZEM"
            }
          ]
        }
      },
      {
        "name": "塞拉利昂",
        "id": "SLE",
        "State": {
          "City": [
            {
              "name": "北部",
              "id": "N"
            },
            {
              "name": "东部",
              "id": "E"
            },
            {
              "name": "南部",
              "id": "S"
            },
            {
              "name": "西部区",
              "id": "W"
            }
          ]
        }
      },
      {
        "name": "塞内加尔",
        "id": "SEN",
        "State": {
          "City": [
            {
              "name": "达喀尔",
              "id": "DA"
            },
            {
              "name": "法蒂克",
              "id": "FA"
            },
            {
              "name": "济金绍尔",
              "id": "ZI"
            },
            {
              "name": "捷斯",
              "id": "TH"
            },
            {
              "name": "久尔贝勒",
              "id": "DI"
            },
            {
              "name": "考拉克",
              "id": "KA"
            },
            {
              "name": "科尔达",
              "id": "KO"
            },
            {
              "name": "卢加",
              "id": "LO"
            },
            {
              "name": "马塔姆",
              "id": "MA"
            },
            {
              "name": "圣路易",
              "id": "SL"
            },
            {
              "name": "坦巴昆达",
              "id": "TA"
            }
          ]
        }
      },
      {
        "name": "塞浦路斯",
        "id": "CYP",
        "State": {
          "City": [
            {
              "name": "法马古斯塔",
              "id": "4"
            },
            {
              "name": "凯里尼亚",
              "id": "6"
            },
            {
              "name": "拉纳卡",
              "id": "3"
            },
            {
              "name": "利马索尔",
              "id": "2"
            },
            {
              "name": "尼科西亚",
              "id": "1"
            },
            {
              "name": "帕福斯",
              "id": "5"
            }
          ]
        }
      },
      {
        "name": "塞舌尔",
        "id": "SYC"
      },
      {
        "name": "沙特阿拉伯",
        "id": "SAU",
        "State": {
          "City": [
            {
              "name": "阿尔阿尔",
              "id": "ARA"
            },
            {
              "name": "艾卜哈",
              "id": "AHB"
            },
            {
              "name": "巴哈",
              "id": "BH"
            },
            {
              "name": "布赖代",
              "id": "BUR"
            },
            {
              "name": "达曼",
              "id": "DAM"
            },
            {
              "name": "哈费尔巴廷",
              "id": "HBT"
            },
            {
              "name": "哈伊勒",
              "id": "HL"
            },
            {
              "name": "海米斯穆谢特",
              "id": "KMX"
            },
            {
              "name": "海耶",
              "id": "AKH"
            },
            {
              "name": "胡富夫",
              "id": "HFF"
            },
            {
              "name": "吉达",
              "id": "JED"
            },
            {
              "name": "吉赞",
              "id": "JZ"
            },
            {
              "name": "利雅得",
              "id": "RD"
            },
            {
              "name": "麦地那",
              "id": "MED"
            },
            {
              "name": "麦加",
              "id": "ML"
            },
            {
              "name": "姆巴拉兹",
              "id": "MBR"
            },
            {
              "name": "纳季兰",
              "id": "NR"
            },
            {
              "name": "塞卡卡",
              "id": "SAK"
            },
            {
              "name": "塔布克",
              "id": "TB"
            },
            {
              "name": "塔伊夫",
              "id": "TAR"
            },
            {
              "name": "延布",
              "id": "YNB"
            },
            {
              "name": "朱拜勒",
              "id": "JBI"
            }
          ]
        }
      },
      {
        "name": "圣诞岛",
        "id": "CXR"
      },
      {
        "name": "圣多美和普林西比",
        "id": "STP"
      },
      {
        "name": "圣赫勒拿",
        "id": "SHN"
      },
      {
        "name": "圣基茨和尼维斯",
        "id": "KNA"
      },
      {
        "name": "圣卢西亚",
        "id": "LCA"
      },
      {
        "name": "圣马力诺",
        "id": "SMR"
      },
      {
        "name": "圣皮埃尔和米克隆群岛",
        "id": "SPM"
      },
      {
        "name": "圣文森特和格林纳丁斯",
        "id": "VCT"
      },
      {
        "name": "斯里兰卡",
        "id": "LKA",
        "State": {
          "City": [
            {
              "name": "阿努拉德普勒",
              "id": "ADP"
            },
            {
              "name": "安帕赖",
              "id": "AMP"
            },
            {
              "name": "巴杜勒",
              "id": "BAD"
            },
            {
              "name": "拜蒂克洛",
              "id": "BTC"
            },
            {
              "name": "波隆纳鲁沃",
              "id": "POL"
            },
            {
              "name": "汉班托特",
              "id": "HBA"
            },
            {
              "name": "基里诺奇",
              "id": "KIL"
            },
            {
              "name": "加勒",
              "id": "GAL"
            },
            {
              "name": "加姆珀哈",
              "id": "GAM"
            },
            {
              "name": "贾夫纳",
              "id": "JAF"
            },
            {
              "name": "卡卢特勒",
              "id": "KLT"
            },
            {
              "name": "凯格勒",
              "id": "KEG"
            },
            {
              "name": "康提",
              "id": "KAN"
            },
            {
              "name": "科伦坡",
              "id": "CMB"
            },
            {
              "name": "库鲁内格勒",
              "id": "KUR"
            },
            {
              "name": "拉特纳普勒",
              "id": "RAT"
            },
            {
              "name": "马纳尔",
              "id": "MAN"
            },
            {
              "name": "马特莱",
              "id": "MAT"
            },
            {
              "name": "马特勒",
              "id": "MAA"
            },
            {
              "name": "莫讷勒格勒",
              "id": "MON"
            },
            {
              "name": "穆莱蒂武",
              "id": "MUL"
            },
            {
              "name": "努沃勒埃利耶",
              "id": "NUE"
            },
            {
              "name": "普塔勒姆",
              "id": "PUT"
            },
            {
              "name": "亭可马里",
              "id": "TRR"
            },
            {
              "name": "瓦武尼亚",
              "id": "VAV"
            }
          ]
        }
      },
      {
        "name": "斯洛伐克",
        "id": "SVK",
        "State": {
          "City": [
            {
              "name": "班斯卡比斯特里察",
              "id": "BBY"
            },
            {
              "name": "布拉迪斯拉发",
              "id": "BTS"
            },
            {
              "name": "科希策",
              "id": "KOR"
            },
            {
              "name": "尼特拉",
              "id": "NRA"
            },
            {
              "name": "普雷绍夫",
              "id": "POV"
            },
            {
              "name": "日利纳",
              "id": "RIL"
            },
            {
              "name": "特尔纳瓦",
              "id": "TNA"
            },
            {
              "name": "特伦钦",
              "id": "TRE"
            }
          ]
        }
      },
      {
        "name": "斯洛文尼亚",
        "id": "SVN",
        "State": {
          "City": [
            {
              "name": "奥巴尔诺克拉",
              "id": "OKR"
            },
            {
              "name": "奥斯雷德涅斯洛文",
              "id": "OSR"
            },
            {
              "name": "波德拉夫",
              "id": "POD"
            },
            {
              "name": "波穆尔",
              "id": "POM"
            },
            {
              "name": "多雷尼",
              "id": "DLJ"
            },
            {
              "name": "戈雷尼",
              "id": "GSZ"
            },
            {
              "name": "戈里",
              "id": "GSK"
            },
            {
              "name": "科洛",
              "id": "KOR"
            },
            {
              "name": "诺特拉尼",
              "id": "NKR"
            },
            {
              "name": "萨维尼",
              "id": "SAV"
            },
            {
              "name": "斯波德涅波萨夫",
              "id": "SPO"
            },
            {
              "name": "扎萨夫",
              "id": "ZAS"
            }
          ]
        }
      },
      {
        "name": "斯瓦尔巴和扬马廷",
        "id": "SJM"
      },
      {
        "name": "斯威士兰",
        "id": "SWZ"
      },
      {
        "name": "苏丹",
        "id": "SDN",
        "State": {
          "City": [
            {
              "name": "北部",
              "id": "ASH"
            },
            {
              "name": "赤道",
              "id": "SIS"
            },
            {
              "name": "达尔富尔",
              "id": "SDA"
            },
            {
              "name": "东部",
              "id": "SHA"
            },
            {
              "name": "加扎勒河",
              "id": "SBG"
            },
            {
              "name": "喀土穆",
              "id": "KRT"
            },
            {
              "name": "科尔多凡",
              "id": "GKU"
            },
            {
              "name": "上尼罗",
              "id": "ANB"
            },
            {
              "name": "中部",
              "id": "WDH"
            }
          ]
        }
      },
      {
        "name": "苏里南",
        "id": "SUR",
        "State": {
          "City": [
            {
              "name": "布罗科蓬多",
              "id": "BR"
            },
            {
              "name": "科罗尼",
              "id": "CR"
            },
            {
              "name": "科默韦讷",
              "id": "CM"
            },
            {
              "name": "马罗韦讷",
              "id": "MA"
            },
            {
              "name": "尼克里",
              "id": "NI"
            },
            {
              "name": "帕拉",
              "id": "PA"
            },
            {
              "name": "帕拉马里博",
              "id": "PM"
            },
            {
              "name": "萨拉马卡",
              "id": "SA"
            },
            {
              "name": "瓦尼卡",
              "id": "WA"
            },
            {
              "name": "西帕里韦尼",
              "id": "SI"
            }
          ]
        }
      },
      {
        "name": "所罗门群岛",
        "id": "SLB",
        "State": {
          "City": [
            {
              "name": "瓜达尔卡纳尔",
              "id": "GC"
            },
            {
              "name": "霍尼亚拉",
              "id": "HO"
            },
            {
              "name": "拉纳尔和贝罗纳",
              "id": "RB"
            },
            {
              "name": "马基拉",
              "id": "MK"
            },
            {
              "name": "马莱塔",
              "id": "ML"
            },
            {
              "name": "乔伊索",
              "id": "CH"
            },
            {
              "name": "泰莫图",
              "id": "TM"
            },
            {
              "name": "西部",
              "id": "WE"
            },
            {
              "name": "伊萨贝尔",
              "id": "IS"
            },
            {
              "name": "中部群岛",
              "id": "CE"
            }
          ]
        }
      },
      {
        "name": "索马里",
        "id": "SOM"
      },
      {
        "name": "塔吉克斯坦",
        "id": "TJK",
        "State": {
          "City": [
            {
              "name": "杜尚别",
              "id": "DYU"
            },
            {
              "name": "霍罗格",
              "id": "KHO"
            },
            {
              "name": "卡尼巴达姆",
              "id": "KAN"
            },
            {
              "name": "科法尔尼洪",
              "id": "KOF"
            },
            {
              "name": "苦盏",
              "id": "KHU"
            },
            {
              "name": "库尔干秋别",
              "id": "KTJ"
            },
            {
              "name": "库洛布",
              "id": "KLB"
            },
            {
              "name": "洛贡",
              "id": "RGU"
            },
            {
              "name": "努雷克",
              "id": "NUR"
            },
            {
              "name": "彭吉肯特",
              "id": "PJK"
            },
            {
              "name": "萨班特",
              "id": "SBA"
            },
            {
              "name": "塔博沙尔",
              "id": "TBS"
            },
            {
              "name": "图尔孙扎德",
              "id": "TSZ"
            },
            {
              "name": "乌拉秋别",
              "id": "UTJ"
            },
            {
              "name": "伊斯法拉",
              "id": "ISF"
            }
          ]
        }
      },
      {
        "name": "泰国",
        "id": "THA",
        "State": {
          "City": [
            {
              "name": "安纳乍能",
              "id": "37"
            },
            {
              "name": "巴蜀",
              "id": "77"
            },
            {
              "name": "巴吞他尼",
              "id": "13"
            },
            {
              "name": "巴真",
              "id": "25"
            },
            {
              "name": "北碧",
              "id": "71"
            },
            {
              "name": "北标",
              "id": "19"
            },
            {
              "name": "北大年",
              "id": "94"
            },
            {
              "name": "北揽",
              "id": "11"
            },
            {
              "name": "北榄坡",
              "id": "60"
            },
            {
              "name": "北柳",
              "id": "24"
            },
            {
              "name": "碧差汶",
              "id": "76"
            },
            {
              "name": "博达伦",
              "id": "93"
            },
            {
              "name": "猜那",
              "id": "18"
            },
            {
              "name": "猜也奔",
              "id": "36"
            },
            {
              "name": "程逸",
              "id": "53"
            },
            {
              "name": "春蓬",
              "id": "86"
            },
            {
              "name": "春武里",
              "id": "20"
            },
            {
              "name": "达",
              "id": "63"
            },
            {
              "name": "达叻",
              "id": "23"
            },
            {
              "name": "大城",
              "id": "14"
            },
            {
              "name": "董里",
              "id": "92"
            },
            {
              "name": "佛丕",
              "id": "78"
            },
            {
              "name": "佛统",
              "id": "73"
            },
            {
              "name": "甘烹碧",
              "id": "62"
            },
            {
              "name": "红统",
              "id": "15"
            },
            {
              "name": "华富里",
              "id": "16"
            },
            {
              "name": "加拉信",
              "id": "46"
            },
            {
              "name": "甲米",
              "id": "81"
            },
            {
              "name": "尖竹汶",
              "id": "22"
            },
            {
              "name": "孔敬",
              "id": "40"
            },
            {
              "name": "拉农",
              "id": "21"
            },
            {
              "name": "廊开",
              "id": "43"
            },
            {
              "name": "廊莫那浦",
              "id": "39"
            },
            {
              "name": "叻丕",
              "id": "70"
            },
            {
              "name": "黎",
              "id": "42"
            },
            {
              "name": "黎逸",
              "id": "45"
            },
            {
              "name": "龙仔厝",
              "id": "74"
            },
            {
              "name": "罗勇",
              "id": "85"
            },
            {
              "name": "洛坤",
              "id": "80"
            },
            {
              "name": "玛哈沙拉堪",
              "id": "44"
            },
            {
              "name": "曼谷",
              "id": "10"
            },
            {
              "name": "莫达汉",
              "id": "49"
            },
            {
              "name": "那空那育",
              "id": "26"
            },
            {
              "name": "那空帕农",
              "id": "48"
            },
            {
              "name": "难",
              "id": "55"
            },
            {
              "name": "南奔",
              "id": "51"
            },
            {
              "name": "暖武里",
              "id": "12"
            },
            {
              "name": "帕",
              "id": "54"
            },
            {
              "name": "帕尧",
              "id": "56"
            },
            {
              "name": "攀牙",
              "id": "82"
            },
            {
              "name": "彭世洛",
              "id": "65"
            },
            {
              "name": "披集",
              "id": "66"
            },
            {
              "name": "普吉",
              "id": "83"
            },
            {
              "name": "清莱",
              "id": "57"
            },
            {
              "name": "清迈",
              "id": "50"
            },
            {
              "name": "色军",
              "id": "47"
            },
            {
              "name": "沙敦",
              "id": "91"
            },
            {
              "name": "沙缴",
              "id": "27"
            },
            {
              "name": "四色菊",
              "id": "33"
            },
            {
              "name": "宋卡",
              "id": "90"
            },
            {
              "name": "素可泰",
              "id": "64"
            },
            {
              "name": "素叻",
              "id": "84"
            },
            {
              "name": "素林",
              "id": "32"
            },
            {
              "name": "素攀武里",
              "id": "72"
            },
            {
              "name": "陶公",
              "id": "96"
            },
            {
              "name": "乌隆",
              "id": "41"
            },
            {
              "name": "乌泰他尼",
              "id": "61"
            },
            {
              "name": "乌汶",
              "id": "34"
            },
            {
              "name": "武里南",
              "id": "31"
            },
            {
              "name": "信武里",
              "id": "17"
            },
            {
              "name": "耶梭通",
              "id": "35"
            },
            {
              "name": "也拉",
              "id": "95"
            },
            {
              "name": "夜丰颂",
              "id": "58"
            },
            {
              "name": "夜功",
              "id": "75"
            }
          ]
        }
      },
      {
        "name": "坦桑尼亚",
        "id": "TZA",
        "State": {
          "City": [
            {
              "name": "阿鲁沙",
              "id": "AR"
            },
            {
              "name": "奔巴北",
              "id": "PN"
            },
            {
              "name": "奔巴南",
              "id": "PS"
            },
            {
              "name": "滨海",
              "id": "PW"
            },
            {
              "name": "达累斯萨拉姆",
              "id": "DS"
            },
            {
              "name": "多多马",
              "id": "DO"
            },
            {
              "name": "基戈马",
              "id": "KI"
            },
            {
              "name": "卡盖拉",
              "id": "KA"
            },
            {
              "name": "林迪",
              "id": "LN"
            },
            {
              "name": "鲁夸",
              "id": "RK"
            },
            {
              "name": "鲁伍马",
              "id": "RV"
            },
            {
              "name": "马腊",
              "id": "MR"
            },
            {
              "name": "曼亚拉",
              "id": "MY"
            },
            {
              "name": "莫洛戈罗",
              "id": "MO"
            },
            {
              "name": "姆贝亚",
              "id": "MB"
            },
            {
              "name": "姆特瓦拉",
              "id": "MT"
            },
            {
              "name": "姆万扎",
              "id": "MW"
            },
            {
              "name": "乞力马扎罗",
              "id": "KJ"
            },
            {
              "name": "桑给巴尔",
              "id": "ZN"
            },
            {
              "name": "桑给巴尔北",
              "id": "UN"
            },
            {
              "name": "桑给巴尔南",
              "id": "US"
            },
            {
              "name": "桑给巴尔市和西",
              "id": "MM"
            },
            {
              "name": "塔波拉",
              "id": "TB"
            },
            {
              "name": "坦噶",
              "id": "TN"
            },
            {
              "name": "辛吉达",
              "id": "SI"
            },
            {
              "name": "欣延加",
              "id": "SH"
            },
            {
              "name": "伊林加",
              "id": "IR"
            }
          ]
        }
      },
      {
        "name": "汤加",
        "id": "TON",
        "State": {
          "City": [
            {
              "name": "埃瓦",
              "id": "E"
            },
            {
              "name": "哈派",
              "id": "H"
            },
            {
              "name": "纽阿斯",
              "id": "N"
            },
            {
              "name": "汤加塔布",
              "id": "T"
            },
            {
              "name": "瓦瓦乌",
              "id": "V"
            }
          ]
        }
      },
      {
        "name": "特克斯和凯克特斯群岛",
        "id": "TCA"
      },
      {
        "name": "特里斯坦达昆哈",
        "id": "TAA"
      },
      {
        "name": "特立尼达和多巴哥",
        "id": "TTO"
      },
      {
        "name": "突尼斯",
        "id": "TUN",
        "State": {
          "City": [
            {
              "name": "艾尔亚奈",
              "id": "AR"
            },
            {
              "name": "巴杰",
              "id": "BJ"
            },
            {
              "name": "本阿鲁斯",
              "id": "BA"
            },
            {
              "name": "比塞大",
              "id": "BI"
            },
            {
              "name": "吉比利",
              "id": "KB"
            },
            {
              "name": "加贝斯",
              "id": "GB"
            },
            {
              "name": "加夫萨",
              "id": "GF"
            },
            {
              "name": "坚杜拜",
              "id": "JE"
            },
            {
              "name": "卡夫",
              "id": "LK"
            },
            {
              "name": "卡塞林",
              "id": "KS"
            },
            {
              "name": "凯鲁万",
              "id": "KR"
            },
            {
              "name": "马赫迪耶",
              "id": "MH"
            },
            {
              "name": "马努巴",
              "id": "MN"
            },
            {
              "name": "梅德宁",
              "id": "ME"
            },
            {
              "name": "莫纳斯提尔",
              "id": "MO"
            },
            {
              "name": "纳布勒",
              "id": "NA"
            },
            {
              "name": "斯法克斯",
              "id": "SF"
            },
            {
              "name": "苏塞",
              "id": "SO"
            },
            {
              "name": "泰塔温",
              "id": "TA"
            },
            {
              "name": "突尼斯",
              "id": "TU"
            },
            {
              "name": "托泽尔",
              "id": "TO"
            },
            {
              "name": "西迪布济德",
              "id": "SD"
            },
            {
              "name": "锡勒亚奈",
              "id": "SL"
            },
            {
              "name": "宰格万",
              "id": "ZA"
            }
          ]
        }
      },
      {
        "name": "图瓦卢",
        "id": "TUV"
      },
      {
        "name": "土耳其",
        "id": "TUR",
        "State": {
          "City": [
            {
              "name": "阿达纳",
              "id": "ADA"
            },
            {
              "name": "阿德亚曼",
              "id": "ADI"
            },
            {
              "name": "阿尔达罕",
              "id": "ARD"
            },
            {
              "name": "阿尔特温",
              "id": "ART"
            },
            {
              "name": "阿菲永",
              "id": "AFY"
            },
            {
              "name": "阿克萨赖",
              "id": "AKS"
            },
            {
              "name": "阿勒",
              "id": "AGR"
            },
            {
              "name": "阿马西亚",
              "id": "AMA"
            },
            {
              "name": "埃迪尔内",
              "id": "EDI"
            },
            {
              "name": "埃尔津詹",
              "id": "EZC"
            },
            {
              "name": "埃尔祖鲁姆",
              "id": "EZR"
            },
            {
              "name": "埃拉泽",
              "id": "ELA"
            },
            {
              "name": "埃斯基谢希尔",
              "id": "ESK"
            },
            {
              "name": "艾登",
              "id": "AYI"
            },
            {
              "name": "安卡拉",
              "id": "ANK"
            },
            {
              "name": "安塔利亚",
              "id": "ANT"
            },
            {
              "name": "奥尔杜",
              "id": "ORD"
            },
            {
              "name": "巴尔腾",
              "id": "BAR"
            },
            {
              "name": "巴勒克埃西尔",
              "id": "BAL"
            },
            {
              "name": "巴特曼",
              "id": "BAT"
            },
            {
              "name": "巴伊布尔特",
              "id": "BAY"
            },
            {
              "name": "比莱吉克",
              "id": "BIL"
            },
            {
              "name": "比特利斯",
              "id": "BIT"
            },
            {
              "name": "宾格尔",
              "id": "BIN"
            },
            {
              "name": "博卢",
              "id": "BOL"
            },
            {
              "name": "布尔杜尔",
              "id": "BRD"
            },
            {
              "name": "布尔萨",
              "id": "BRS"
            },
            {
              "name": "昌克勒",
              "id": "CKR"
            },
            {
              "name": "代尼兹利",
              "id": "DEN"
            },
            {
              "name": "迪亚巴克尔",
              "id": "DIY"
            },
            {
              "name": "凡",
              "id": "VAN"
            },
            {
              "name": "哈卡里",
              "id": "HKR"
            },
            {
              "name": "哈塔伊",
              "id": "HTY"
            },
            {
              "name": "基利斯",
              "id": "KLS"
            },
            {
              "name": "吉雷松",
              "id": "GIR"
            },
            {
              "name": "加济安泰普",
              "id": "GAZ"
            },
            {
              "name": "居米什哈内",
              "id": "GMS"
            },
            {
              "name": "卡尔斯",
              "id": "KRS"
            },
            {
              "name": "卡赫拉曼马拉什",
              "id": "KAH"
            },
            {
              "name": "卡拉比克",
              "id": "KRB"
            },
            {
              "name": "卡拉曼",
              "id": "KRM"
            },
            {
              "name": "卡斯塔莫努",
              "id": "KAS"
            },
            {
              "name": "开塞利",
              "id": "KAY"
            },
            {
              "name": "科贾埃利",
              "id": "KOC"
            },
            {
              "name": "柯克拉雷利",
              "id": "KLR"
            },
            {
              "name": "科尼亚",
              "id": "KON"
            },
            {
              "name": "克尔谢希尔",
              "id": "KRH"
            },
            {
              "name": "克勒克卡莱",
              "id": "KRK"
            },
            {
              "name": "拉飞",
              "id": "URF"
            },
            {
              "name": "里泽",
              "id": "RIZ"
            },
            {
              "name": "马尔丁",
              "id": "MAR"
            },
            {
              "name": "马拉蒂亚",
              "id": "MAL"
            },
            {
              "name": "马尼萨",
              "id": "MAN"
            },
            {
              "name": "穆拉",
              "id": "MUG"
            },
            {
              "name": "穆什",
              "id": "MUS"
            },
            {
              "name": "内夫谢希尔",
              "id": "NEV"
            },
            {
              "name": "尼代",
              "id": "NIG"
            },
            {
              "name": "恰纳卡莱",
              "id": "CKL"
            },
            {
              "name": "乔鲁姆",
              "id": "COR"
            },
            {
              "name": "屈塔希亚",
              "id": "KUT"
            },
            {
              "name": "萨卡里亚",
              "id": "SAK"
            },
            {
              "name": "萨姆松",
              "id": "SAM"
            },
            {
              "name": "泰基尔达",
              "id": "TEL"
            },
            {
              "name": "特拉布宗",
              "id": "TRA"
            },
            {
              "name": "通杰利",
              "id": "TUN"
            },
            {
              "name": "托卡特",
              "id": "TOK"
            },
            {
              "name": "乌萨克",
              "id": "USK"
            },
            {
              "name": "锡尔纳克",
              "id": "SIR"
            },
            {
              "name": "锡尔特",
              "id": "SII"
            },
            {
              "name": "锡诺普",
              "id": "SIN"
            },
            {
              "name": "锡瓦斯",
              "id": "SIV"
            },
            {
              "name": "伊迪尔",
              "id": "IGD"
            },
            {
              "name": "伊切尔",
              "id": "ICE"
            },
            {
              "name": "伊斯帕尔塔",
              "id": "ISP"
            },
            {
              "name": "伊斯坦布尔",
              "id": "IST"
            },
            {
              "name": "伊兹密尔",
              "id": "IZM"
            },
            {
              "name": "约兹加特",
              "id": "YOZ"
            },
            {
              "name": "宗古尔达克",
              "id": "ZON"
            }
          ]
        }
      },
      {
        "name": "土库曼斯坦",
        "id": "TKM",
        "State": {
          "City": [
            {
              "name": "阿哈尔",
              "id": "A"
            },
            {
              "name": "阿什哈巴德市",
              "id": "ASB"
            },
            {
              "name": "巴尔坎",
              "id": "B"
            },
            {
              "name": "达沙古兹",
              "id": "D"
            },
            {
              "name": "列巴普",
              "id": "L"
            },
            {
              "name": "马雷",
              "id": "M"
            },
            {
              "name": "涅比特达格",
              "id": "NEB"
            }
          ]
        }
      },
      {
        "name": "托克劳",
        "id": "TKL"
      },
      {
        "name": "瓦利斯和福图纳",
        "id": "WLF"
      },
      {
        "name": "瓦努阿图",
        "id": "VUT",
        "State": {
          "City": [
            {
              "name": "马朗帕",
              "id": "MA"
            },
            {
              "name": "彭纳马",
              "id": "PE"
            },
            {
              "name": "桑马",
              "id": "SA"
            },
            {
              "name": "塔菲阿",
              "id": "TA"
            },
            {
              "name": "托尔巴",
              "id": "TO"
            },
            {
              "name": "谢法",
              "id": "SH"
            }
          ]
        }
      },
      {
        "name": "危地马拉",
        "id": "GTM",
        "State": {
          "City": [
            {
              "name": "埃尔普罗格雷索",
              "id": "PR"
            },
            {
              "name": "埃斯昆特拉",
              "id": "ES"
            },
            {
              "name": "哈拉帕",
              "id": "JA"
            },
            {
              "name": "胡蒂亚帕",
              "id": "JU"
            },
            {
              "name": "基切",
              "id": "QC"
            },
            {
              "name": "克萨尔特南戈",
              "id": "QZ"
            },
            {
              "name": "雷塔卢莱乌",
              "id": "RE"
            },
            {
              "name": "米克斯科",
              "id": "MIX"
            },
            {
              "name": "佩滕",
              "id": "PE"
            },
            {
              "name": "奇基穆拉",
              "id": "CQ"
            },
            {
              "name": "奇马尔特南戈",
              "id": "CM"
            },
            {
              "name": "萨卡帕",
              "id": "ZA"
            },
            {
              "name": "萨卡特佩克斯",
              "id": "ST"
            },
            {
              "name": "上韦拉帕斯",
              "id": "AV"
            },
            {
              "name": "圣罗莎",
              "id": "SR"
            },
            {
              "name": "圣马科斯",
              "id": "SM"
            },
            {
              "name": "苏奇特佩克斯",
              "id": "SU"
            },
            {
              "name": "索洛拉",
              "id": "SO"
            },
            {
              "name": "托托尼卡潘",
              "id": "TO"
            },
            {
              "name": "危地马拉",
              "id": "GU"
            },
            {
              "name": "韦韦特南戈",
              "id": "HU"
            },
            {
              "name": "下韦拉帕斯",
              "id": "BV"
            },
            {
              "name": "新城",
              "id": "VIN"
            },
            {
              "name": "伊萨瓦尔",
              "id": "IZ"
            }
          ]
        }
      },
      {
        "name": "维尔京群岛，美属",
        "id": "VIR"
      },
      {
        "name": "维尔京群岛，英属",
        "id": "VGB"
      },
      {
        "name": "委内瑞拉",
        "id": "VEN",
        "State": {
          "City": [
            {
              "name": "阿拉瓜",
              "id": "D"
            },
            {
              "name": "阿马库罗三角洲",
              "id": "Y"
            },
            {
              "name": "阿普雷",
              "id": "C"
            },
            {
              "name": "安索阿特吉",
              "id": "B"
            },
            {
              "name": "巴里纳斯",
              "id": "E"
            },
            {
              "name": "玻利瓦尔",
              "id": "F"
            },
            {
              "name": "波图格萨",
              "id": "P"
            },
            {
              "name": "法尔孔",
              "id": "I"
            },
            {
              "name": "瓜里科",
              "id": "J"
            },
            {
              "name": "加拉加斯",
              "id": "A"
            },
            {
              "name": "卡拉沃沃",
              "id": "G"
            },
            {
              "name": "科赫德斯",
              "id": "H"
            },
            {
              "name": "拉腊",
              "id": "K"
            },
            {
              "name": "联邦属地",
              "id": "W"
            },
            {
              "name": "梅里达",
              "id": "L"
            },
            {
              "name": "米兰达",
              "id": "M"
            },
            {
              "name": "莫纳加斯",
              "id": "N"
            },
            {
              "name": "苏克雷",
              "id": "R"
            },
            {
              "name": "苏利亚",
              "id": "V"
            },
            {
              "name": "塔奇拉",
              "id": "S"
            },
            {
              "name": "特鲁希略",
              "id": "T"
            },
            {
              "name": "新埃斯帕塔",
              "id": "O"
            },
            {
              "name": "亚拉奎",
              "id": "U"
            },
            {
              "name": "亚马孙",
              "id": "Z"
            }
          ]
        }
      },
      {
        "name": "文莱",
        "id": "BRN"
      },
      {
        "name": "乌干达",
        "id": "UGA",
        "State": {
          "City": [
            {
              "name": "阿鲁阿",
              "id": "ARU"
            },
            {
              "name": "阿帕克",
              "id": "APC"
            },
            {
              "name": "阿朱马尼",
              "id": "ADJ"
            },
            {
              "name": "本迪布焦",
              "id": "BUN"
            },
            {
              "name": "布吉里",
              "id": "BUG"
            },
            {
              "name": "布西亚",
              "id": "BUS"
            },
            {
              "name": "布谢尼",
              "id": "BSH"
            },
            {
              "name": "恩通加莫",
              "id": "NTU"
            },
            {
              "name": "古卢",
              "id": "GUL"
            },
            {
              "name": "霍伊马",
              "id": "HOI"
            },
            {
              "name": "基巴莱",
              "id": "KBA"
            },
            {
              "name": "基博加",
              "id": "KIB"
            },
            {
              "name": "基恩乔乔",
              "id": "KYE"
            },
            {
              "name": "基索罗",
              "id": "KIS"
            },
            {
              "name": "基特古姆",
              "id": "KIT"
            },
            {
              "name": "金贾",
              "id": "JIN"
            },
            {
              "name": "卡巴莱",
              "id": "KBL"
            },
            {
              "name": "卡巴罗莱",
              "id": "KAR"
            },
            {
              "name": "卡贝拉马伊多",
              "id": "KAB"
            },
            {
              "name": "卡兰加拉",
              "id": "KAL"
            },
            {
              "name": "卡姆文盖",
              "id": "KAM"
            },
            {
              "name": "卡穆利",
              "id": "KML"
            },
            {
              "name": "卡农古",
              "id": "KAN"
            },
            {
              "name": "卡普乔鲁瓦",
              "id": "KPC"
            },
            {
              "name": "卡塞塞",
              "id": "KAS"
            },
            {
              "name": "卡塔奎",
              "id": "KTK"
            },
            {
              "name": "卡永加",
              "id": "KAY"
            },
            {
              "name": "坎帕拉",
              "id": "KMP"
            },
            {
              "name": "科蒂多",
              "id": "KOT"
            },
            {
              "name": "库米",
              "id": "KUM"
            },
            {
              "name": "拉卡伊",
              "id": "RAK"
            },
            {
              "name": "利拉",
              "id": "LIR"
            },
            {
              "name": "卢韦罗",
              "id": "LUW"
            },
            {
              "name": "鲁昆吉里",
              "id": "RUK"
            },
            {
              "name": "马萨卡",
              "id": "MAS"
            },
            {
              "name": "马辛迪",
              "id": "MSN"
            },
            {
              "name": "马尤盖",
              "id": "MAY"
            },
            {
              "name": "莫罗托",
              "id": "MRT"
            },
            {
              "name": "莫约",
              "id": "MOY"
            },
            {
              "name": "姆巴拉拉",
              "id": "MBR"
            },
            {
              "name": "姆巴莱",
              "id": "MBA"
            },
            {
              "name": "姆皮吉",
              "id": "MPI"
            },
            {
              "name": "穆本德",
              "id": "MUB"
            },
            {
              "name": "穆科诺",
              "id": "MUK"
            },
            {
              "name": "纳卡皮里皮里特",
              "id": "NAK"
            },
            {
              "name": "纳卡松戈拉",
              "id": "NKS"
            },
            {
              "name": "内比",
              "id": "NEB"
            },
            {
              "name": "帕德尔",
              "id": "PAD"
            },
            {
              "name": "帕利萨",
              "id": "PAL"
            },
            {
              "name": "森巴布莱",
              "id": "SEM"
            },
            {
              "name": "索罗提",
              "id": "SOR"
            },
            {
              "name": "托罗罗",
              "id": "TOR"
            },
            {
              "name": "瓦基索",
              "id": "WAK"
            },
            {
              "name": "锡龙科",
              "id": "SIR"
            },
            {
              "name": "伊甘加",
              "id": "IGA"
            },
            {
              "name": "永贝",
              "id": "YUM"
            }
          ]
        }
      },
      {
        "name": "乌克兰",
        "id": "UKR",
        "State": {
          "City": [
            {
              "name": "敖德萨",
              "id": "51"
            },
            {
              "name": "波尔塔瓦",
              "id": "53"
            },
            {
              "name": "第聂伯罗波得罗夫斯克",
              "id": "12"
            },
            {
              "name": "顿涅茨克",
              "id": "14"
            },
            {
              "name": "哈尔科夫",
              "id": "63"
            },
            {
              "name": "赫尔松州",
              "id": "65"
            },
            {
              "name": "赫梅利尼茨基",
              "id": "68"
            },
            {
              "name": "基辅",
              "id": "30"
            },
            {
              "name": "基洛夫格勒",
              "id": "35"
            },
            {
              "name": "捷尔诺波尔",
              "id": "61"
            },
            {
              "name": "克里米亚自治共和国",
              "id": "43"
            },
            {
              "name": "利沃夫",
              "id": "46"
            },
            {
              "name": "卢甘斯克",
              "id": "9"
            },
            {
              "name": "罗夫诺",
              "id": "56"
            },
            {
              "name": "尼古拉耶夫",
              "id": "48"
            },
            {
              "name": "切尔卡瑟",
              "id": "71"
            },
            {
              "name": "切尔尼戈夫",
              "id": "74"
            },
            {
              "name": "切尔诺夫策",
              "id": "77"
            },
            {
              "name": "日托米尔",
              "id": "18"
            },
            {
              "name": "苏梅",
              "id": "59"
            },
            {
              "name": "外喀尔巴阡",
              "id": "21"
            },
            {
              "name": "文尼察",
              "id": "5"
            },
            {
              "name": "沃伦",
              "id": "7"
            },
            {
              "name": "伊万－弗兰科夫州",
              "id": "26"
            },
            {
              "name": "扎波罗热",
              "id": "23"
            }
          ]
        }
      },
      {
        "name": "乌拉圭",
        "id": "URY",
        "State": {
          "City": [
            {
              "name": "阿蒂加斯",
              "id": "AR"
            },
            {
              "name": "杜拉斯诺",
              "id": "DU"
            },
            {
              "name": "佛罗里达",
              "id": "FA"
            },
            {
              "name": "弗洛雷斯",
              "id": "FS"
            },
            {
              "name": "卡内洛内斯",
              "id": "CA"
            },
            {
              "name": "科洛尼亚",
              "id": "CO"
            },
            {
              "name": "拉瓦耶哈",
              "id": "LA"
            },
            {
              "name": "里韦拉",
              "id": "RV"
            },
            {
              "name": "罗恰",
              "id": "RO"
            },
            {
              "name": "马尔多纳多",
              "id": "MA"
            },
            {
              "name": "蒙得维的亚",
              "id": "MO"
            },
            {
              "name": "内格罗河",
              "id": "RN"
            },
            {
              "name": "派桑杜",
              "id": "PA"
            },
            {
              "name": "萨尔托",
              "id": "SL"
            },
            {
              "name": "塞罗拉尔戈",
              "id": "CL"
            },
            {
              "name": "三十三人",
              "id": "TT"
            },
            {
              "name": "圣何塞",
              "id": "SJ"
            },
            {
              "name": "索里亚诺",
              "id": "SO"
            },
            {
              "name": "塔夸伦博",
              "id": "TAW"
            }
          ]
        }
      },
      {
        "name": "乌兹别克斯坦",
        "id": "UZB",
        "State": {
          "City": [
            {
              "name": "安集延",
              "id": "AN"
            },
            {
              "name": "布哈拉",
              "id": "BU"
            },
            {
              "name": "费尔干纳",
              "id": "FA"
            },
            {
              "name": "花拉子模",
              "id": "XO"
            },
            {
              "name": "吉扎克",
              "id": "JI"
            },
            {
              "name": "卡拉卡尔帕克斯坦共和国",
              "id": "QR"
            },
            {
              "name": "卡什卡达里亚",
              "id": "QA"
            },
            {
              "name": "纳曼干",
              "id": "NG"
            },
            {
              "name": "纳沃伊",
              "id": "NW"
            },
            {
              "name": "撒马尔罕",
              "id": "SA"
            },
            {
              "name": "苏尔汉河",
              "id": "SU"
            },
            {
              "name": "塔什干",
              "id": "TK"
            },
            {
              "name": "塔什干市",
              "id": "TO"
            },
            {
              "name": "锡尔河",
              "id": "SI"
            }
          ]
        }
      },
      {
        "name": "西班牙",
        "id": "ESP",
        "State": {
          "City": [
            {
              "name": "阿尔梅里亚",
              "id": "LEI"
            },
            {
              "name": "阿尔瓦塞特",
              "id": "ALB"
            },
            {
              "name": "阿拉瓦",
              "id": "ALA"
            },
            {
              "name": "阿利坎特",
              "id": "ALC"
            },
            {
              "name": "阿斯图利亚斯",
              "id": "AST"
            },
            {
              "name": "阿维拉",
              "id": "AVI"
            },
            {
              "name": "奥伦塞",
              "id": "ORE"
            },
            {
              "name": "巴达霍斯",
              "id": "BJZ"
            },
            {
              "name": "巴利阿里",
              "id": "BLR"
            },
            {
              "name": "巴利亚多利德",
              "id": "VLL"
            },
            {
              "name": "巴伦西亚",
              "id": "VLC"
            },
            {
              "name": "巴塞罗那",
              "id": "BCN"
            },
            {
              "name": "比斯开",
              "id": "VSE"
            },
            {
              "name": "布尔戈斯",
              "id": "BUR"
            },
            {
              "name": "格拉纳达",
              "id": "GRX"
            },
            {
              "name": "瓜达拉哈拉",
              "id": "GUA"
            },
            {
              "name": "哈恩",
              "id": "JAE"
            },
            {
              "name": "赫罗纳",
              "id": "GRO"
            },
            {
              "name": "吉普斯夸",
              "id": "GUI"
            },
            {
              "name": "加的斯",
              "id": "CAD"
            },
            {
              "name": "卡塞雷斯",
              "id": "CCS"
            },
            {
              "name": "卡斯蒂利亚",
              "id": "CIR"
            },
            {
              "name": "卡斯特利翁",
              "id": "CAS"
            },
            {
              "name": "科尔多瓦",
              "id": "ODB"
            },
            {
              "name": "昆卡",
              "id": "CUE"
            },
            {
              "name": "拉科鲁尼亚",
              "id": "LCG"
            },
            {
              "name": "拉里奥哈",
              "id": "ARL"
            },
            {
              "name": "拉斯帕尔马斯",
              "id": "LPA"
            },
            {
              "name": "莱昂",
              "id": "LEN"
            },
            {
              "name": "莱里达",
              "id": "LLE"
            },
            {
              "name": "卢戈",
              "id": "LGO"
            },
            {
              "name": "马德里",
              "id": "MAD"
            },
            {
              "name": "马拉加",
              "id": "AGP"
            },
            {
              "name": "穆尔西亚",
              "id": "MJV"
            },
            {
              "name": "纳瓦拉",
              "id": "NVV"
            },
            {
              "name": "帕伦西亚",
              "id": "PAC"
            },
            {
              "name": "蓬特韦德拉",
              "id": "PEV"
            },
            {
              "name": "萨拉戈萨",
              "id": "ZAZ"
            },
            {
              "name": "萨拉曼卡",
              "id": "SLM"
            },
            {
              "name": "萨莫拉",
              "id": "ZMR"
            },
            {
              "name": "塞哥维亚",
              "id": "SEG"
            },
            {
              "name": "塞维利亚",
              "id": "SVQ"
            },
            {
              "name": "桑坦德",
              "id": "SDR"
            },
            {
              "name": "圣克鲁斯德特内里费",
              "id": "SCT"
            },
            {
              "name": "索里亚",
              "id": "SOR"
            },
            {
              "name": "塔拉戈纳",
              "id": "TAR"
            },
            {
              "name": "特鲁埃尔",
              "id": "TER"
            },
            {
              "name": "托莱多",
              "id": "TOL"
            },
            {
              "name": "韦尔瓦",
              "id": "HUV"
            },
            {
              "name": "韦斯卡",
              "id": "HUC"
            }
          ]
        }
      },
      {
        "name": "希腊",
        "id": "GRC",
        "State": {
          "City": [
            {
              "name": "比雷埃夫斯",
              "id": "PRI"
            },
            {
              "name": "多德卡尼斯",
              "id": "DO"
            },
            {
              "name": "干尼亚",
              "id": "CHQ"
            },
            {
              "name": "基克拉迪",
              "id": "CY"
            },
            {
              "name": "拉西锡",
              "id": "LST"
            },
            {
              "name": "莱斯博斯",
              "id": "LES"
            },
            {
              "name": "雷西姆农",
              "id": "RET"
            },
            {
              "name": "萨摩斯",
              "id": "SMI"
            },
            {
              "name": "雅典",
              "id": "ATH"
            },
            {
              "name": "伊拉克里翁",
              "id": "HER"
            }
          ]
        }
      },
      {
        "name": "新加坡",
        "id": "SGP"
      },
      {
        "name": "新喀里多尼亚",
        "id": "NCL"
      },
      {
        "name": "新西兰",
        "id": "NZL",
        "State": {
          "City": [
            {
              "name": "奥克兰",
              "id": "AUK"
            },
            {
              "name": "北岸",
              "id": "NSH"
            },
            {
              "name": "北帕默斯顿",
              "id": "PMR"
            },
            {
              "name": "北远",
              "id": "FNR"
            },
            {
              "name": "布莱尼姆",
              "id": "BHE"
            },
            {
              "name": "达尼丁",
              "id": "DUD"
            },
            {
              "name": "格雷茅斯",
              "id": "GMN"
            },
            {
              "name": "哈密尔顿",
              "id": "HLZ"
            },
            {
              "name": "黑斯廷斯",
              "id": "HAS"
            },
            {
              "name": "怀塔科拉",
              "id": "WAE"
            },
            {
              "name": "吉斯伯恩",
              "id": "GIS"
            },
            {
              "name": "凯帕拉",
              "id": "KAI"
            },
            {
              "name": "克赖斯特彻奇",
              "id": "CHC"
            },
            {
              "name": "里士满",
              "id": "RMD"
            },
            {
              "name": "马努考",
              "id": "MNK"
            },
            {
              "name": "纳尔逊",
              "id": "NSN"
            },
            {
              "name": "内皮尔",
              "id": "NPE"
            },
            {
              "name": "斯特拉特福德",
              "id": "STR"
            },
            {
              "name": "陶马鲁努伊",
              "id": "TAU"
            },
            {
              "name": "瓦卡塔尼",
              "id": "WHK"
            },
            {
              "name": "旺阿雷",
              "id": "WRE"
            },
            {
              "name": "旺格努伊",
              "id": "WAG"
            },
            {
              "name": "新普利茅斯",
              "id": "NPL"
            },
            {
              "name": "因弗卡吉尔",
              "id": "IVC"
            }
          ]
        }
      },
      {
        "name": "匈牙利",
        "id": "HUN",
        "State": {
          "City": [
            {
              "name": "巴兰尼亚",
              "id": "BA"
            },
            {
              "name": "巴奇基什孔",
              "id": "BK"
            },
            {
              "name": "包尔绍德奥包乌伊曾普伦",
              "id": "BZ"
            },
            {
              "name": "贝凯什",
              "id": "BE"
            },
            {
              "name": "布达佩斯",
              "id": "BU"
            },
            {
              "name": "费耶尔",
              "id": "FE"
            },
            {
              "name": "豪伊杜比豪尔",
              "id": "HB"
            },
            {
              "name": "赫维什",
              "id": "HE"
            },
            {
              "name": "加兹纳杰孔索尔诺克",
              "id": "JN"
            },
            {
              "name": "杰尔莫松肖普朗",
              "id": "GS"
            },
            {
              "name": "科马罗姆",
              "id": "KE"
            },
            {
              "name": "诺格拉德",
              "id": "NO"
            },
            {
              "name": "佩斯",
              "id": "PE"
            },
            {
              "name": "琼格拉德",
              "id": "CS"
            },
            {
              "name": "绍莫吉",
              "id": "SO"
            },
            {
              "name": "索博尔奇索特马尔贝拉格",
              "id": "SZ"
            },
            {
              "name": "托尔瑙",
              "id": "TO"
            },
            {
              "name": "维斯普雷姆",
              "id": "VE"
            },
            {
              "name": "沃什",
              "id": "VA"
            },
            {
              "name": "佐洛",
              "id": "ZA"
            }
          ]
        }
      },
      {
        "name": "叙利亚",
        "id": "SYR",
        "State": {
          "City": [
            {
              "name": "阿勒颇",
              "id": "HL"
            },
            {
              "name": "大马士革",
              "id": "RD"
            },
            {
              "name": "大马士革市",
              "id": "DI"
            },
            {
              "name": "代尔祖尔",
              "id": "DZ"
            },
            {
              "name": "德拉",
              "id": "DA"
            },
            {
              "name": "哈马",
              "id": "HM"
            },
            {
              "name": "哈塞克",
              "id": "HA"
            },
            {
              "name": "霍姆斯",
              "id": "HI"
            },
            {
              "name": "加布",
              "id": "GH"
            },
            {
              "name": "卡米什利",
              "id": "QA"
            },
            {
              "name": "库奈特拉",
              "id": "QU"
            },
            {
              "name": "拉卡",
              "id": "RQ"
            },
            {
              "name": "拉塔基亚",
              "id": "LA"
            },
            {
              "name": "苏韦达",
              "id": "SU"
            },
            {
              "name": "塔尔图斯",
              "id": "TA"
            },
            {
              "name": "伊德利卜",
              "id": "ID"
            }
          ]
        }
      },
      {
        "name": "牙买加",
        "id": "JAM",
        "State": {
          "City": [
            {
              "name": "波特兰",
              "id": "POR"
            },
            {
              "name": "汉诺威",
              "id": "HAN"
            },
            {
              "name": "金斯敦",
              "id": "KIN"
            },
            {
              "name": "克拉伦登",
              "id": "CLA"
            },
            {
              "name": "曼彻斯特",
              "id": "MAN"
            },
            {
              "name": "圣安德鲁斯",
              "id": "AND"
            },
            {
              "name": "圣安娜",
              "id": "ANN"
            },
            {
              "name": "圣凯瑟琳",
              "id": "CAT"
            },
            {
              "name": "圣玛丽",
              "id": "MAR"
            },
            {
              "name": "圣托马斯",
              "id": "THO"
            },
            {
              "name": "圣伊丽莎白",
              "id": "ELI"
            },
            {
              "name": "圣詹姆斯",
              "id": "JAM"
            },
            {
              "name": "特里洛尼",
              "id": "TRL"
            },
            {
              "name": "西摩兰",
              "id": "WML"
            }
          ]
        }
      },
      {
        "name": "亚美尼亚",
        "id": "ARM",
        "State": {
          "City": [
            {
              "name": "阿尔马维尔",
              "id": "ARM"
            },
            {
              "name": "阿拉加措特恩",
              "id": "AGT"
            },
            {
              "name": "阿拉拉特",
              "id": "ARA"
            },
            {
              "name": "埃里温市",
              "id": "EVN"
            },
            {
              "name": "格加尔库尼克",
              "id": "GEG"
            },
            {
              "name": "科泰克",
              "id": "KOT"
            },
            {
              "name": "洛里",
              "id": "LOR"
            },
            {
              "name": "塔武什",
              "id": "TAV"
            },
            {
              "name": "瓦约茨·佐尔",
              "id": "VAY"
            },
            {
              "name": "希拉克",
              "id": "SHI"
            },
            {
              "name": "休尼克",
              "id": "SYU"
            }
          ]
        }
      },
      {
        "name": "也门",
        "id": "YEM",
        "State": {
          "City": [
            {
              "name": "阿比扬",
              "id": "AB"
            },
            {
              "name": "阿姆兰",
              "id": "AM"
            },
            {
              "name": "贝达",
              "id": "BA"
            },
            {
              "name": "达利",
              "id": "DA"
            },
            {
              "name": "哈德拉毛",
              "id": "HD"
            },
            {
              "name": "哈杰",
              "id": "HJ"
            },
            {
              "name": "荷台达",
              "id": "HU"
            },
            {
              "name": "焦夫",
              "id": "JA"
            },
            {
              "name": "拉赫季",
              "id": "LA"
            },
            {
              "name": "马里卜",
              "id": "MA"
            },
            {
              "name": "迈赫拉",
              "id": "MR"
            },
            {
              "name": "迈赫维特",
              "id": "MW"
            },
            {
              "name": "萨达",
              "id": "SD"
            },
            {
              "name": "萨那",
              "id": "SN"
            },
            {
              "name": "赛文",
              "id": "GXF"
            },
            {
              "name": "舍卜沃",
              "id": "SH"
            },
            {
              "name": "塔伊兹",
              "id": "TA"
            },
            {
              "name": "希赫尔",
              "id": "ASR"
            },
            {
              "name": "亚丁",
              "id": "AD"
            },
            {
              "name": "伊卜",
              "id": "IB"
            },
            {
              "name": "扎玛尔",
              "id": "DH"
            }
          ]
        }
      },
      {
        "name": "伊拉克",
        "id": "IRQ"
      },
      {
        "name": "伊朗",
        "id": "IRN"
      },
      {
        "name": "以色列",
        "id": "ISR",
        "State": {
          "City": [
            {
              "name": "阿什杜德",
              "id": "ASH"
            },
            {
              "name": "贝尔谢巴",
              "id": "BEV"
            },
            {
              "name": "贝特雁",
              "id": "BAT"
            },
            {
              "name": "海法",
              "id": "HFA"
            },
            {
              "name": "霍隆",
              "id": "HOL"
            },
            {
              "name": "内坦亚",
              "id": "NAT"
            },
            {
              "name": "特拉维夫",
              "id": "TLV"
            },
            {
              "name": "耶路撒冷",
              "id": "J"
            }
          ]
        }
      },
      {
        "name": "意大利",
        "id": "ITA",
        "State": {
          "City": [
            {
              "name": "阿斯蒂",
              "id": "AST"
            },
            {
              "name": "阿斯科利皮切诺",
              "id": "ASP"
            },
            {
              "name": "安科纳",
              "id": "AOI"
            },
            {
              "name": "奥尔比亚",
              "id": "OLB"
            },
            {
              "name": "奥里斯塔诺",
              "id": "QOS"
            },
            {
              "name": "奥斯塔",
              "id": "AOT"
            },
            {
              "name": "巴勒莫",
              "id": "PMO"
            },
            {
              "name": "巴里",
              "id": "BRI"
            },
            {
              "name": "贝加莫",
              "id": "BGO"
            },
            {
              "name": "贝内文托",
              "id": "BEN"
            },
            {
              "name": "比萨",
              "id": "PSA"
            },
            {
              "name": "波代诺内",
              "id": "PRD"
            },
            {
              "name": "波坦察",
              "id": "QPO"
            },
            {
              "name": "博洛尼亚",
              "id": "BLQ"
            },
            {
              "name": "布拉",
              "id": "BIE"
            },
            {
              "name": "布雷西亚",
              "id": "BRC"
            },
            {
              "name": "布林迪西",
              "id": "BDS"
            },
            {
              "name": "的里雅斯特",
              "id": "TRS"
            },
            {
              "name": "都灵",
              "id": "TRN"
            },
            {
              "name": "费拉拉",
              "id": "FRR"
            },
            {
              "name": "佛罗伦萨",
              "id": "FLR"
            },
            {
              "name": "福贾",
              "id": "FOG"
            },
            {
              "name": "卡利亚里",
              "id": "CAG"
            },
            {
              "name": "卡塞塔",
              "id": "CST"
            },
            {
              "name": "卡塔尼亚",
              "id": "CTA"
            },
            {
              "name": "卡坦扎罗",
              "id": "QCZ"
            },
            {
              "name": "坎波巴索",
              "id": "COB"
            },
            {
              "name": "科摩",
              "id": "CIY"
            },
            {
              "name": "科森扎",
              "id": "QCS"
            },
            {
              "name": "克罗托内",
              "id": "CRV"
            },
            {
              "name": "库内奥",
              "id": "CUN"
            },
            {
              "name": "拉奎拉",
              "id": "LAQ"
            },
            {
              "name": "拉斯佩齐亚",
              "id": "SPE"
            },
            {
              "name": "莱科",
              "id": "LCO"
            },
            {
              "name": "莱切",
              "id": "LCC"
            },
            {
              "name": "雷焦艾米利亚",
              "id": "RNE"
            },
            {
              "name": "雷焦卡拉布里亚",
              "id": "REG"
            },
            {
              "name": "里窝那",
              "id": "LIV"
            },
            {
              "name": "罗马",
              "id": "ROM"
            },
            {
              "name": "马萨",
              "id": "MCR"
            },
            {
              "name": "马泰拉",
              "id": "MTR"
            },
            {
              "name": "蒙扎",
              "id": "MZA"
            },
            {
              "name": "米兰",
              "id": "MIL"
            },
            {
              "name": "摩德纳",
              "id": "MOD"
            },
            {
              "name": "墨西拿",
              "id": "MSN"
            },
            {
              "name": "那不勒斯",
              "id": "NAP"
            },
            {
              "name": "努奥罗",
              "id": "QNU"
            },
            {
              "name": "诺瓦拉",
              "id": "NVR"
            },
            {
              "name": "帕尔马",
              "id": "PMF"
            },
            {
              "name": "帕维亚",
              "id": "PAV"
            },
            {
              "name": "佩鲁贾",
              "id": "PEG"
            },
            {
              "name": "热那亚",
              "id": "CAX"
            },
            {
              "name": "萨莱诺",
              "id": "SAL"
            },
            {
              "name": "萨萨里",
              "id": "QSS"
            },
            {
              "name": "萨沃纳",
              "id": "SVN"
            },
            {
              "name": "塔兰托",
              "id": "TAR"
            },
            {
              "name": "特拉帕尼",
              "id": "TPS"
            },
            {
              "name": "特伦托",
              "id": "TRT"
            },
            {
              "name": "威尼斯",
              "id": "VCE"
            },
            {
              "name": "韦尔切利",
              "id": "VRL"
            },
            {
              "name": "维泰博",
              "id": "VIT"
            },
            {
              "name": "乌迪内",
              "id": "UDN"
            },
            {
              "name": "锡拉库扎",
              "id": "SYR"
            },
            {
              "name": "锡耶纳",
              "id": "SNA"
            },
            {
              "name": "亚历山德里亚",
              "id": "ALE"
            },
            {
              "name": "伊塞尔尼亚",
              "id": "ISE"
            }
          ]
        }
      },
      {
        "name": "印度",
        "id": "IND",
        "State": {
          "City": [
            {
              "name": "艾藻尔",
              "id": "AJL"
            },
            {
              "name": "班加罗尔",
              "id": "BLR"
            },
            {
              "name": "本地治里",
              "id": "PNY"
            },
            {
              "name": "博帕尔",
              "id": "BHO"
            },
            {
              "name": "布巴内斯瓦尔",
              "id": "BBI"
            },
            {
              "name": "昌迪加尔",
              "id": "IXC"
            },
            {
              "name": "达曼",
              "id": "DAM"
            },
            {
              "name": "第乌",
              "id": "DIU"
            },
            {
              "name": "甘托克",
              "id": "GTO"
            },
            {
              "name": "哥印拜陀",
              "id": "CJB"
            },
            {
              "name": "加尔各答",
              "id": "CCU"
            },
            {
              "name": "加里加尔",
              "id": "KRK"
            },
            {
              "name": "贾巴尔普尔",
              "id": "JLR"
            },
            {
              "name": "贾朗达尔",
              "id": "JUC"
            },
            {
              "name": "焦特布尔",
              "id": "JDH"
            },
            {
              "name": "金奈",
              "id": "MAA"
            },
            {
              "name": "卡瓦拉蒂",
              "id": "KVA"
            },
            {
              "name": "科希马",
              "id": "KOM"
            },
            {
              "name": "马埃",
              "id": "MAH"
            },
            {
              "name": "马杜赖",
              "id": "IXM"
            },
            {
              "name": "森伯尔布尔",
              "id": "SLR"
            },
            {
              "name": "特里凡得琅",
              "id": "TRV"
            },
            {
              "name": "乌代布尔",
              "id": "UDR"
            },
            {
              "name": "西隆",
              "id": "SHL"
            },
            {
              "name": "锡尔萨瓦",
              "id": "SIL"
            },
            {
              "name": "新德里",
              "id": "ICD"
            },
            {
              "name": "亚南",
              "id": "SRV"
            },
            {
              "name": "因帕尔",
              "id": "IMF"
            },
            {
              "name": "印多尔",
              "id": "IDR"
            },
            {
              "name": "斋普尔",
              "id": "JAI"
            }
          ]
        }
      },
      {
        "name": "印度尼西亚",
        "id": "IDN",
        "State": {
          "City": [
            {
              "name": "巴厘",
              "id": "BA"
            },
            {
              "name": "邦加－勿里洞群岛",
              "id": "BB"
            },
            {
              "name": "北苏拉威西",
              "id": "SA"
            },
            {
              "name": "北苏门答腊",
              "id": "SU"
            },
            {
              "name": "大雅加达首都特区",
              "id": "KB"
            },
            {
              "name": "东加里曼丹",
              "id": "KI"
            },
            {
              "name": "东南苏拉威西",
              "id": "SG"
            },
            {
              "name": "东努沙登加拉",
              "id": "NT"
            },
            {
              "name": "东爪哇",
              "id": "JI"
            },
            {
              "name": "廖内",
              "id": "RI"
            },
            {
              "name": "马鲁古",
              "id": "MA"
            },
            {
              "name": "明古鲁",
              "id": "BE"
            },
            {
              "name": "楠榜",
              "id": "LA"
            },
            {
              "name": "南加里曼丹",
              "id": "KS"
            },
            {
              "name": "南苏拉威西",
              "id": "SN"
            },
            {
              "name": "南苏门答腊",
              "id": "SS"
            },
            {
              "name": "日惹特区",
              "id": "YO"
            },
            {
              "name": "万丹",
              "id": "BT"
            },
            {
              "name": "西努沙登加拉",
              "id": "NB"
            },
            {
              "name": "西苏门答腊",
              "id": "SR"
            },
            {
              "name": "西爪哇",
              "id": "JB"
            },
            {
              "name": "雅加达",
              "id": "JK"
            },
            {
              "name": "亚齐",
              "id": "AC"
            },
            {
              "name": "伊里安查亚",
              "id": "IJ"
            },
            {
              "name": "占碑",
              "id": "JA"
            },
            {
              "name": "中加里曼丹",
              "id": "KT"
            },
            {
              "name": "中苏拉威西",
              "id": "ST"
            },
            {
              "name": "中爪哇",
              "id": "JT"
            }
          ]
        }
      },
      {
        "name": "英国",
        "id": "GBR",
        "State": [
          {
            "name": "北爱尔兰",
            "id": "NIR",
            "City": [
              {
                "name": "贝尔法斯特",
                "id": "BFS"
              },
              {
                "name": "德里",
                "id": "DRY"
              },
              {
                "name": "利斯本",
                "id": "LSB"
              },
              {
                "name": "纽里",
                "id": "NYM"
              }
            ]
          },
          {
            "name": "苏格兰",
            "id": "SCT",
            "City": [
              {
                "name": "阿伯丁",
                "id": "ABD"
              },
              {
                "name": "爱丁堡",
                "id": "EDH"
              },
              {
                "name": "丹迪",
                "id": "DND"
              },
              {
                "name": "格拉斯哥",
                "id": "GLG"
              },
              {
                "name": "斯特灵",
                "id": "STG"
              },
              {
                "name": "因弗内斯",
                "id": "INV"
              }
            ]
          },
          {
            "name": "威尔士",
            "id": "WLS",
            "City": [
              {
                "name": "班戈",
                "id": "BAN"
              },
              {
                "name": "卡迪夫",
                "id": "CDF"
              },
              {
                "name": "纽波特",
                "id": "NWP"
              },
              {
                "name": "斯旺西",
                "id": "SWA"
              }
            ]
          },
          {
            "name": "英格兰",
            "id": "ENG",
            "City": [
              {
                "name": "埃克塞特",
                "id": "EXE"
              },
              {
                "name": "巴斯",
                "id": "BAS"
              },
              {
                "name": "彼得伯勒",
                "id": "PTE"
              },
              {
                "name": "伯明翰",
                "id": "BIR"
              },
              {
                "name": "布拉德福德",
                "id": "BRD"
              },
              {
                "name": "布莱顿与赫福",
                "id": "BNH"
              },
              {
                "name": "布里斯托尔",
                "id": "BST"
              },
              {
                "name": "德比",
                "id": "DER"
              },
              {
                "name": "德罕",
                "id": "DUR"
              },
              {
                "name": "格洛斯特",
                "id": "GLO"
              },
              {
                "name": "赫尔河畔京斯敦",
                "id": "KUH"
              },
              {
                "name": "赫里福德",
                "id": "HAF"
              },
              {
                "name": "剑桥",
                "id": "CAM"
              },
              {
                "name": "卡莱尔",
                "id": "CAX"
              },
              {
                "name": "坎特伯雷",
                "id": "CNG"
              },
              {
                "name": "考文垂",
                "id": "COV"
              },
              {
                "name": "兰开斯特",
                "id": "LAN"
              },
              {
                "name": "里彭",
                "id": "RIP"
              },
              {
                "name": "利奇菲尔德",
                "id": "LHF"
              },
              {
                "name": "利物浦",
                "id": "LIV"
              },
              {
                "name": "利茲",
                "id": "LDS"
              },
              {
                "name": "列斯特",
                "id": "LCE"
              },
              {
                "name": "林肯",
                "id": "LCN"
              },
              {
                "name": "伦敦",
                "id": "LND"
              },
              {
                "name": "曼彻斯特",
                "id": "MAN"
              },
              {
                "name": "南安普敦",
                "id": "STH"
              },
              {
                "name": "牛津",
                "id": "OXF"
              },
              {
                "name": "纽卡斯尔",
                "id": "NCL"
              },
              {
                "name": "诺丁汉",
                "id": "NGM"
              },
              {
                "name": "诺里奇",
                "id": "NRW"
              },
              {
                "name": "朴茨茅斯",
                "id": "POR"
              },
              {
                "name": "普雷斯顿",
                "id": "PRE"
              },
              {
                "name": "普利茅斯",
                "id": "PLY"
              },
              {
                "name": "奇切斯特",
                "id": "CST"
              },
              {
                "name": "切斯特",
                "id": "CEG"
              },
              {
                "name": "桑德兰",
                "id": "SUN"
              },
              {
                "name": "圣阿本斯",
                "id": "TBL"
              },
              {
                "name": "索尔斯堡",
                "id": "SLS"
              },
              {
                "name": "索福特",
                "id": "SLF"
              },
              {
                "name": "特鲁罗",
                "id": "TRU"
              },
              {
                "name": "特伦特河畔斯多克",
                "id": "SOT"
              },
              {
                "name": "威尔斯",
                "id": "WLS"
              },
              {
                "name": "韦克菲尔德",
                "id": "WKF"
              },
              {
                "name": "温彻斯特",
                "id": "WNE"
              },
              {
                "name": "伍尔弗汉普顿",
                "id": "WOV"
              },
              {
                "name": "伍斯特",
                "id": "WOR"
              },
              {
                "name": "谢菲尔德",
                "id": "SHE"
              },
              {
                "name": "伊利",
                "id": "ELY"
              },
              {
                "name": "约克",
                "id": "YOR"
              }
            ]
          }
        ]
      },
      {
        "name": "英属印度洋领地",
        "id": "IOT"
      },
      {
        "name": "约旦",
        "id": "JOR",
        "State": {
          "City": [
            {
              "name": "阿吉隆",
              "id": "AJ"
            },
            {
              "name": "安曼",
              "id": "AM"
            },
            {
              "name": "拜勒加",
              "id": "BA"
            },
            {
              "name": "杰拉什",
              "id": "JA"
            },
            {
              "name": "卡拉克",
              "id": "KA"
            },
            {
              "name": "鲁赛法",
              "id": "RU"
            },
            {
              "name": "马安",
              "id": "MN"
            },
            {
              "name": "马德巴",
              "id": "MD"
            },
            {
              "name": "马夫拉克",
              "id": "MF"
            },
            {
              "name": "塔菲拉",
              "id": "TA"
            },
            {
              "name": "亚喀巴",
              "id": "AQ"
            },
            {
              "name": "伊尔比德",
              "id": "IR"
            },
            {
              "name": "扎尔卡",
              "id": "ZA"
            }
          ]
        }
      },
      {
        "name": "越南",
        "id": "VNM",
        "State": {
          "City": [
            {
              "name": "海防",
              "id": "HP"
            },
            {
              "name": "河内",
              "id": "HI"
            },
            {
              "name": "胡志明市",
              "id": "HC"
            }
          ]
        }
      },
      {
        "name": "赞比亚",
        "id": "ZMB",
        "State": {
          "City": [
            {
              "name": "北方",
              "id": "NO"
            },
            {
              "name": "东方",
              "id": "EA"
            },
            {
              "name": "卢阿普拉",
              "id": "LP"
            },
            {
              "name": "卢萨卡",
              "id": "LK"
            },
            {
              "name": "南方",
              "id": "SO"
            },
            {
              "name": "铜带",
              "id": "CB"
            },
            {
              "name": "西北",
              "id": "NW"
            },
            {
              "name": "西方",
              "id": "WE"
            },
            {
              "name": "中央",
              "id": "CE"
            }
          ]
        }
      },
      {
        "name": "泽西岛",
        "id": "JEY"
      },
      {
        "name": "乍得",
        "id": "TCD"
      },
      {
        "name": "直布罗陀",
        "id": "GIB"
      },
      {
        "name": "智利",
        "id": "CHL",
        "State": {
          "City": [
            {
              "name": "阿劳卡尼亚大区",
              "id": "AR"
            },
            {
              "name": "阿塔卡马大区",
              "id": "AT"
            },
            {
              "name": "安托法加斯塔大区",
              "id": "AN"
            },
            {
              "name": "比奥比奥大区",
              "id": "BI"
            },
            {
              "name": "复活节岛",
              "id": "LI"
            },
            {
              "name": "湖大区",
              "id": "LL"
            },
            {
              "name": "科金博大区",
              "id": "CO"
            },
            {
              "name": "马乌莱大区",
              "id": "ML"
            },
            {
              "name": "麦哲伦智利南极大区",
              "id": "MA"
            },
            {
              "name": "圣地亚哥",
              "id": "RM"
            },
            {
              "name": "塔拉帕卡大区",
              "id": "TA"
            },
            {
              "name": "瓦尔帕莱索大区",
              "id": "VS"
            },
            {
              "name": "伊瓦涅斯将军的艾森大区",
              "id": "AI"
            }
          ]
        }
      },
      {
        "name": "中非共和国",
        "id": "CAF",
        "State": {
          "City": [
            {
              "name": "巴明吉班戈兰",
              "id": "BB"
            },
            {
              "name": "班吉直辖市",
              "id": "BGF"
            },
            {
              "name": "宾博",
              "id": "BI"
            },
            {
              "name": "凯莫",
              "id": "KG"
            },
            {
              "name": "洛巴伊",
              "id": "LB"
            },
            {
              "name": "曼贝雷卡代",
              "id": "HS"
            },
            {
              "name": "姆博穆",
              "id": "MB"
            },
            {
              "name": "纳纳格里比齐",
              "id": "KB"
            },
            {
              "name": "纳纳曼贝雷",
              "id": "NM"
            },
            {
              "name": "桑加姆巴埃雷",
              "id": "SE"
            },
            {
              "name": "上科托",
              "id": "HK"
            },
            {
              "name": "上姆博穆",
              "id": "HM"
            },
            {
              "name": "瓦卡",
              "id": "UK"
            },
            {
              "name": "瓦卡加",
              "id": "VK"
            },
            {
              "name": "瓦姆",
              "id": "AC"
            },
            {
              "name": "瓦姆彭代",
              "id": "OP"
            },
            {
              "name": "翁贝拉姆波科",
              "id": "MP"
            },
            {
              "name": "下科托",
              "id": "BK"
            }
          ]
        }
      }
    ]
  }
};
export default countryData;